/* automatically generated by rust-bindgen */

#[repr(C)]
#[derive(Default)]
pub struct __IncompleteArrayField<T>(::std::marker::PhantomData<T>);
impl <T> __IncompleteArrayField<T> {
    #[inline]
    pub fn new() -> Self {
        __IncompleteArrayField(::std::marker::PhantomData)
    }
    #[inline]
    pub unsafe fn as_ptr(&self) -> *const T { ::std::mem::transmute(self) }
    #[inline]
    pub unsafe fn as_mut_ptr(&mut self) -> *mut T {
        ::std::mem::transmute(self)
    }
    #[inline]
    pub unsafe fn as_slice(&self, len: usize) -> &[T] {
        ::std::slice::from_raw_parts(self.as_ptr(), len)
    }
    #[inline]
    pub unsafe fn as_mut_slice(&mut self, len: usize) -> &mut [T] {
        ::std::slice::from_raw_parts_mut(self.as_mut_ptr(), len)
    }
}
impl <T> ::std::fmt::Debug for __IncompleteArrayField<T> {
    fn fmt(&self, fmt: &mut ::std::fmt::Formatter) -> ::std::fmt::Result {
        fmt.write_str("__IncompleteArrayField")
    }
}
impl <T> ::std::clone::Clone for __IncompleteArrayField<T> {
    #[inline]
    fn clone(&self) -> Self { Self::new() }
}
impl <T> ::std::marker::Copy for __IncompleteArrayField<T> { }
#[repr(C)]
pub struct __BindgenUnionField<T>(::std::marker::PhantomData<T>);
impl <T> __BindgenUnionField<T> {
    #[inline]
    pub fn new() -> Self { __BindgenUnionField(::std::marker::PhantomData) }
    #[inline]
    pub unsafe fn as_ref(&self) -> &T { ::std::mem::transmute(self) }
    #[inline]

pub const F_SHLCK: ::std::os::raw::c_uint = 8;
pub const LOCK_SH: ::std::os::raw::c_uint = 1;
pub const LOCK_EX: ::std::os::raw::c_uint = 2;
pub const LOCK_NB: ::std::os::raw::c_uint = 4;
pub const LOCK_UN: ::std::os::raw::c_uint = 8;
pub const FAPPEND: ::std::os::raw::c_uint = 1024;
pub const FFSYNC: ::std::os::raw::c_uint = 1052672;
pub const FASYNC: ::std::os::raw::c_uint = 8192;
pub const FNONBLOCK: ::std::os::raw::c_uint = 2048;
pub const FNDELAY: ::std::os::raw::c_uint = 2048;
pub const __POSIX_FADV_DONTNEED: ::std::os::raw::c_uint = 4;
pub const __POSIX_FADV_NOREUSE: ::std::os::raw::c_uint = 5;
pub const POSIX_FADV_NORMAL: ::std::os::raw::c_uint = 0;
pub const POSIX_FADV_RANDOM: ::std::os::raw::c_uint = 1;
pub const POSIX_FADV_SEQUENTIAL: ::std::os::raw::c_uint = 2;
pub const POSIX_FADV_WILLNEED: ::std::os::raw::c_uint = 3;
pub const POSIX_FADV_DONTNEED: ::std::os::raw::c_uint = 4;
pub const POSIX_FADV_NOREUSE: ::std::os::raw::c_uint = 5;
pub const AT_FDCWD: ::std::os::raw::c_int = -100;
pub const AT_SYMLINK_NOFOLLOW: ::std::os::raw::c_uint = 256;
pub const AT_REMOVEDIR: ::std::os::raw::c_uint = 512;
pub const AT_SYMLINK_FOLLOW: ::std::os::raw::c_uint = 1024;
pub const AT_EACCESS: ::std::os::raw::c_uint = 512;
pub type osalbool = ::std::os::raw::c_uchar;
pub type int8 = ::std::os::raw::c_schar;
pub type int16 = ::std::os::raw::c_short;
pub type int32 = ::std::os::raw::c_int;
pub type int64 = ::std::os::raw::c_long;
pub type uint8 = ::std::os::raw::c_uchar;
pub type uint16 = ::std::os::raw::c_ushort;
pub type uint32 = ::std::os::raw::c_uint;
pub type uint64 = ::std::os::raw::c_ulong;
pub type cpuaddr = ::std::os::raw::c_ulong;
pub type cpusize = ::std::os::raw::c_ulong;
pub type cpudiff = ::std::os::raw::c_long;
pub type boolean = osalbool;
pub type TypeUint8WrongSize = [::std::os::raw::c_char; 1usize];
pub type TypeUint16WrongSize = [::std::os::raw::c_char; 1usize];
pub type TypeUint32WrongSize = [::std::os::raw::c_char; 1usize];
pub type TypeUint64WrongSize = [::std::os::raw::c_char; 1usize];
pub type Typeint8WrongSize = [::std::os::raw::c_char; 1usize];
pub type Typeint16WrongSize = [::std::os::raw::c_char; 1usize];
pub type Typeint32WrongSize = [::std::os::raw::c_char; 1usize];
pub type Typeint64WrongSize = [::std::os::raw::c_char; 1usize];
pub type TypePtrWrongSize = [::std::os::raw::c_char; 1usize];
/**********************************************************************
** Structure definitions for CCSDS headers.  All items in the structure
** must be aligned on 16-bit words.  Bitfields must be avoided since
** some compilers (such as gcc) force them into 32-bit alignment.
**********************************************************************/
#[repr(C)]
#[derive(Debug, Copy)]
pub struct CCSDS_PriHdr_t {
    pub StreamId: [uint8; 2usize],
    pub Sequence: [uint8; 2usize],
    pub Length: [uint8; 2usize],
}
#[test]
fn bindgen_test_layout_CCSDS_PriHdr_t() {
    assert_eq!(::std::mem::size_of::<CCSDS_PriHdr_t>() , 6usize , concat ! (
               "Size of: " , stringify ! ( CCSDS_PriHdr_t ) ));
    assert_eq! (::std::mem::align_of::<CCSDS_PriHdr_t>() , 1usize , concat ! (
                "Alignment of " , stringify ! ( CCSDS_PriHdr_t ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const CCSDS_PriHdr_t ) ) . StreamId as * const
                _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( CCSDS_PriHdr_t ) , "::"
                , stringify ! ( StreamId ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const CCSDS_PriHdr_t ) ) . Sequence as * const
                _ as usize } , 2usize , concat ! (
                "Alignment of field: " , stringify ! ( CCSDS_PriHdr_t ) , "::"
                , stringify ! ( Sequence ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const CCSDS_PriHdr_t ) ) . Length as * const _
                as usize } , 4usize , concat ! (
                "Alignment of field: " , stringify ! ( CCSDS_PriHdr_t ) , "::"
                , stringify ! ( Length ) ));
}
impl Clone for CCSDS_PriHdr_t {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct CCSDS_CmdSecHdr_t {
    pub Command: uint16,
}
#[test]
fn bindgen_test_layout_CCSDS_CmdSecHdr_t() {
    assert_eq!(::std::mem::size_of::<CCSDS_CmdSecHdr_t>() , 2usize , concat !
               ( "Size of: " , stringify ! ( CCSDS_CmdSecHdr_t ) ));
    assert_eq! (::std::mem::align_of::<CCSDS_CmdSecHdr_t>() , 2usize , concat
                ! ( "Alignment of " , stringify ! ( CCSDS_CmdSecHdr_t ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const CCSDS_CmdSecHdr_t ) ) . Command as *
                const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( CCSDS_CmdSecHdr_t ) ,
                "::" , stringify ! ( Command ) ));
}
impl Clone for CCSDS_CmdSecHdr_t {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct CCSDS_TlmSecHdr_t {
    pub Time: [uint8; 6usize],
}
#[test]
fn bindgen_test_layout_CCSDS_TlmSecHdr_t() {
    assert_eq!(::std::mem::size_of::<CCSDS_TlmSecHdr_t>() , 6usize , concat !
               ( "Size of: " , stringify ! ( CCSDS_TlmSecHdr_t ) ));
    assert_eq! (::std::mem::align_of::<CCSDS_TlmSecHdr_t>() , 1usize , concat
                ! ( "Alignment of " , stringify ! ( CCSDS_TlmSecHdr_t ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const CCSDS_TlmSecHdr_t ) ) . Time as * const _
                as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( CCSDS_TlmSecHdr_t ) ,
                "::" , stringify ! ( Time ) ));
}
impl Clone for CCSDS_TlmSecHdr_t {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct CCSDS_CmdPkt_t {
    pub PriHdr: CCSDS_PriHdr_t,
    pub SecHdr: CCSDS_CmdSecHdr_t,
}
#[test]
fn bindgen_test_layout_CCSDS_CmdPkt_t() {
    assert_eq!(::std::mem::size_of::<CCSDS_CmdPkt_t>() , 8usize , concat ! (
               "Size of: " , stringify ! ( CCSDS_CmdPkt_t ) ));
    assert_eq! (::std::mem::align_of::<CCSDS_CmdPkt_t>() , 2usize , concat ! (
                "Alignment of " , stringify ! ( CCSDS_CmdPkt_t ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const CCSDS_CmdPkt_t ) ) . PriHdr as * const _
                as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( CCSDS_CmdPkt_t ) , "::"
                , stringify ! ( PriHdr ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const CCSDS_CmdPkt_t ) ) . SecHdr as * const _
                as usize } , 6usize , concat ! (
                "Alignment of field: " , stringify ! ( CCSDS_CmdPkt_t ) , "::"
                , stringify ! ( SecHdr ) ));
}
impl Clone for CCSDS_CmdPkt_t {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct CCSDS_TlmPkt_t {
    pub PriHdr: CCSDS_PriHdr_t,
    pub SecHdr: CCSDS_TlmSecHdr_t,
}
#[test]
fn bindgen_test_layout_CCSDS_TlmPkt_t() {
    assert_eq!(::std::mem::size_of::<CCSDS_TlmPkt_t>() , 12usize , concat ! (
               "Size of: " , stringify ! ( CCSDS_TlmPkt_t ) ));
    assert_eq! (::std::mem::align_of::<CCSDS_TlmPkt_t>() , 1usize , concat ! (
                "Alignment of " , stringify ! ( CCSDS_TlmPkt_t ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const CCSDS_TlmPkt_t ) ) . PriHdr as * const _
                as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( CCSDS_TlmPkt_t ) , "::"
                , stringify ! ( PriHdr ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const CCSDS_TlmPkt_t ) ) . SecHdr as * const _
                as usize } , 6usize , concat ! (
                "Alignment of field: " , stringify ! ( CCSDS_TlmPkt_t ) , "::"
                , stringify ! ( SecHdr ) ));
}
impl Clone for CCSDS_TlmPkt_t {
    fn clone(&self) -> Self { *self }
}
extern "C" {
    /******************************************************************************
**  Function:  CCSDS_InitPkt()
**
**  Purpose:
**    Initialize a CCSDS packet.  The primary header is initialized with
**    specified values, and if the Clear flag is set, the rest of the packet
**    is filled with zeros.
**
**  Arguments:
**    PktPtr   : Pointer to primary header of packet.
**    StreamId : Stream ID to use for the packet.
**    Length   : Length of the packet in bytes.
**    Clear    : Indicates whether to clear the entire packet:
**                TRUE = fill sequence count and packet data with zeros
**                       (used after a cold restart)
**                FALSE = leave sequence count and packet data unchanged
**                       (used after a warm restart if data must be preserved)
**
**  Return:
**    (none)
*/
    pub fn CCSDS_InitPkt(PktPtr: *mut CCSDS_PriHdr_t, StreamId: uint16,
                         Length: uint16, Clear: boolean);
}
extern "C" {
    /******************************************************************************
**  Function:  CCSDS_LoadCheckSum()
**
**  Purpose:
**    Compute and load a checksum for a CCSDS command packet that has a
**    secondary header.
**
**  Arguments:
**    PktPtr   : Pointer to header of command packet.  The packet must
**               have a secondary header and the length in the primary
**               header must be correct.  The checksum field in the packet
**               will be modified.
**
**  Return:
**    (none)
*/
    pub fn CCSDS_LoadCheckSum(PktPtr: *mut CCSDS_CmdPkt_t);
}
extern "C" {
    /******************************************************************************
**  Function:  CCSDS_ValidCheckSum()
**
**  Purpose:
**    Determine whether a checksum in a command packet is valid.
**
**  Arguments:
**    PktPtr   : Pointer to header of command packet.  The packet must
**               have a secondary header and the length in the primary
**               header must be correct.
**
**  Return:
**    TRUE if checksum of packet is valid; FALSE if not.
**    A valid checksum is 0.
*/
    pub fn CCSDS_ValidCheckSum(PktPtr: *mut CCSDS_CmdPkt_t) -> boolean;
}
extern "C" {
    /******************************************************************************
**  Function:  CCSDS_ComputeCheckSum()
**
**  Purpose:
**    Compute the checksum for a command packet.  The checksum is the XOR of
**    all bytes in the packet; a valid checksum is zero.
**
**  Arguments:
**    PktPtr   : Pointer to header of command packet.  The packet must
**               have a secondary header and the length in the primary
**               header must be correct.
**
**  Return:
**    TRUE if checksum of packet is valid; FALSE if not.
*/
    pub fn CCSDS_ComputeCheckSum(PktPtr: *mut CCSDS_CmdPkt_t) -> uint8;
}
pub type va_list = __builtin_va_list;
pub type __gnuc_va_list = __builtin_va_list;
#[repr(C)]
#[derive(Debug, Copy)]
pub struct OS_task_prop_t {
    pub name: [::std::os::raw::c_char; 20usize],
    pub creator: uint32,
    pub stack_size: uint32,
    pub priority: uint32,
    pub OStask_id: uint32,
}
#[test]
fn bindgen_test_layout_OS_task_prop_t() {
    assert_eq!(::std::mem::size_of::<OS_task_prop_t>() , 36usize , concat ! (
               "Size of: " , stringify ! ( OS_task_prop_t ) ));
    assert_eq! (::std::mem::align_of::<OS_task_prop_t>() , 4usize , concat ! (
                "Alignment of " , stringify ! ( OS_task_prop_t ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const OS_task_prop_t ) ) . name as * const _ as
                usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( OS_task_prop_t ) , "::"
                , stringify ! ( name ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const OS_task_prop_t ) ) . creator as * const _
                as usize } , 20usize , concat ! (
                "Alignment of field: " , stringify ! ( OS_task_prop_t ) , "::"
                , stringify ! ( creator ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const OS_task_prop_t ) ) . stack_size as *
                const _ as usize } , 24usize , concat ! (
                "Alignment of field: " , stringify ! ( OS_task_prop_t ) , "::"
                , stringify ! ( stack_size ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const OS_task_prop_t ) ) . priority as * const
                _ as usize } , 28usize , concat ! (
                "Alignment of field: " , stringify ! ( OS_task_prop_t ) , "::"
                , stringify ! ( priority ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const OS_task_prop_t ) ) . OStask_id as * const
                _ as usize } , 32usize , concat ! (
                "Alignment of field: " , stringify ! ( OS_task_prop_t ) , "::"
                , stringify ! ( OStask_id ) ));
}
impl Clone for OS_task_prop_t {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct OS_queue_prop_t {
    pub name: [::std::os::raw::c_char; 20usize],
    pub creator: uint32,
}
#[test]
fn bindgen_test_layout_OS_queue_prop_t() {
    assert_eq!(::std::mem::size_of::<OS_queue_prop_t>() , 24usize , concat ! (
               "Size of: " , stringify ! ( OS_queue_prop_t ) ));
    assert_eq! (::std::mem::align_of::<OS_queue_prop_t>() , 4usize , concat !
                ( "Alignment of " , stringify ! ( OS_queue_prop_t ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const OS_queue_prop_t ) ) . name as * const _
                as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( OS_queue_prop_t ) ,
                "::" , stringify ! ( name ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const OS_queue_prop_t ) ) . creator as * const
                _ as usize } , 20usize , concat ! (
                "Alignment of field: " , stringify ! ( OS_queue_prop_t ) ,
                "::" , stringify ! ( creator ) ));
}
impl Clone for OS_queue_prop_t {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct OS_bin_sem_prop_t {
    pub name: [::std::os::raw::c_char; 20usize],
    pub creator: uint32,
    pub value: int32,
}
#[test]
fn bindgen_test_layout_OS_bin_sem_prop_t() {
    assert_eq!(::std::mem::size_of::<OS_bin_sem_prop_t>() , 28usize , concat !
               ( "Size of: " , stringify ! ( OS_bin_sem_prop_t ) ));
    assert_eq! (::std::mem::align_of::<OS_bin_sem_prop_t>() , 4usize , concat
                ! ( "Alignment of " , stringify ! ( OS_bin_sem_prop_t ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const OS_bin_sem_prop_t ) ) . name as * const _
                as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( OS_bin_sem_prop_t ) ,
                "::" , stringify ! ( name ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const OS_bin_sem_prop_t ) ) . creator as *
                const _ as usize } , 20usize , concat ! (
                "Alignment of field: " , stringify ! ( OS_bin_sem_prop_t ) ,
                "::" , stringify ! ( creator ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const OS_bin_sem_prop_t ) ) . value as * const
                _ as usize } , 24usize , concat ! (
                "Alignment of field: " , stringify ! ( OS_bin_sem_prop_t ) ,
                "::" , stringify ! ( value ) ));
}
impl Clone for OS_bin_sem_prop_t {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct OS_count_sem_prop_t {
    pub name: [::std::os::raw::c_char; 20usize],
    pub creator: uint32,
    pub value: int32,
}
#[test]
fn bindgen_test_layout_OS_count_sem_prop_t() {
    assert_eq!(::std::mem::size_of::<OS_count_sem_prop_t>() , 28usize , concat
               ! ( "Size of: " , stringify ! ( OS_count_sem_prop_t ) ));
    assert_eq! (::std::mem::align_of::<OS_count_sem_prop_t>() , 4usize ,
                concat ! (
                "Alignment of " , stringify ! ( OS_count_sem_prop_t ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const OS_count_sem_prop_t ) ) . name as * const
                _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( OS_count_sem_prop_t ) ,
                "::" , stringify ! ( name ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const OS_count_sem_prop_t ) ) . creator as *
                const _ as usize } , 20usize , concat ! (
                "Alignment of field: " , stringify ! ( OS_count_sem_prop_t ) ,
                "::" , stringify ! ( creator ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const OS_count_sem_prop_t ) ) . value as *
                const _ as usize } , 24usize , concat ! (
                "Alignment of field: " , stringify ! ( OS_count_sem_prop_t ) ,
                "::" , stringify ! ( value ) ));
}
impl Clone for OS_count_sem_prop_t {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct OS_mut_sem_prop_t {
    pub name: [::std::os::raw::c_char; 20usize],
    pub creator: uint32,
}
#[test]
fn bindgen_test_layout_OS_mut_sem_prop_t() {
    assert_eq!(::std::mem::size_of::<OS_mut_sem_prop_t>() , 24usize , concat !
               ( "Size of: " , stringify ! ( OS_mut_sem_prop_t ) ));
    assert_eq! (::std::mem::align_of::<OS_mut_sem_prop_t>() , 4usize , concat
                ! ( "Alignment of " , stringify ! ( OS_mut_sem_prop_t ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const OS_mut_sem_prop_t ) ) . name as * const _
                as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( OS_mut_sem_prop_t ) ,
                "::" , stringify ! ( name ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const OS_mut_sem_prop_t ) ) . creator as *
                const _ as usize } , 20usize , concat ! (
                "Alignment of field: " , stringify ! ( OS_mut_sem_prop_t ) ,
                "::" , stringify ! ( creator ) ));
}
impl Clone for OS_mut_sem_prop_t {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct OS_time_t {
    pub seconds: uint32,
    pub microsecs: uint32,
}
#[test]
fn bindgen_test_layout_OS_time_t() {
    assert_eq!(::std::mem::size_of::<OS_time_t>() , 8usize , concat ! (
               "Size of: " , stringify ! ( OS_time_t ) ));
    assert_eq! (::std::mem::align_of::<OS_time_t>() , 4usize , concat ! (
                "Alignment of " , stringify ! ( OS_time_t ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const OS_time_t ) ) . seconds as * const _ as
                usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( OS_time_t ) , "::" ,
                stringify ! ( seconds ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const OS_time_t ) ) . microsecs as * const _ as
                usize } , 4usize , concat ! (
                "Alignment of field: " , stringify ! ( OS_time_t ) , "::" ,
                stringify ! ( microsecs ) ));
}
impl Clone for OS_time_t {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct OS_heap_prop_t {
    pub free_bytes: uint32,
    pub free_blocks: uint32,
    pub largest_free_block: uint32,
}
#[test]
fn bindgen_test_layout_OS_heap_prop_t() {
    assert_eq!(::std::mem::size_of::<OS_heap_prop_t>() , 12usize , concat ! (
               "Size of: " , stringify ! ( OS_heap_prop_t ) ));
    assert_eq! (::std::mem::align_of::<OS_heap_prop_t>() , 4usize , concat ! (
                "Alignment of " , stringify ! ( OS_heap_prop_t ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const OS_heap_prop_t ) ) . free_bytes as *
                const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( OS_heap_prop_t ) , "::"
                , stringify ! ( free_bytes ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const OS_heap_prop_t ) ) . free_blocks as *
                const _ as usize } , 4usize , concat ! (
                "Alignment of field: " , stringify ! ( OS_heap_prop_t ) , "::"
                , stringify ! ( free_blocks ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const OS_heap_prop_t ) ) . largest_free_block
                as * const _ as usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( OS_heap_prop_t ) , "::"
                , stringify ! ( largest_free_block ) ));
}
impl Clone for OS_heap_prop_t {
    fn clone(&self) -> Self { *self }
}
pub type os_err_name_t = [::std::os::raw::c_char; 35usize];
pub type osal_task = ::std::os::raw::c_void;
pub type osal_task_entry = ::std::option::Option<unsafe extern "C" fn()>;
pub type OS_ArgCallback_t =
    ::std::option::Option<unsafe extern "C" fn(object_id: uint32,
                                               arg:
                                                   *mut ::std::os::raw::c_void)>;
extern "C" {
    pub fn OS_Application_Startup();
}
extern "C" {
    pub fn OS_API_Init() -> int32;
}
extern "C" {
    pub fn OS_IdleLoop();
}
extern "C" {
    pub fn OS_DeleteAllObjects();
}
extern "C" {
    pub fn OS_ApplicationShutdown(flag: uint8);
}
extern "C" {
    pub fn OS_TaskCreate(task_id: *mut uint32,
                         task_name: *const ::std::os::raw::c_char,
                         function_pointer: osal_task_entry,
                         stack_pointer: *mut uint32, stack_size: uint32,
                         priority: uint32, flags: uint32) -> int32;
}
extern "C" {
    pub fn OS_TaskDelete(task_id: uint32) -> int32;
}
extern "C" {
    pub fn OS_TaskExit();
}
extern "C" {
    pub fn OS_TaskInstallDeleteHandler(function_pointer: osal_task_entry)
     -> int32;
}
extern "C" {
    pub fn OS_TaskDelay(millisecond: uint32) -> int32;
}
extern "C" {
    pub fn OS_TaskSetPriority(task_id: uint32, new_priority: uint32) -> int32;
}
extern "C" {
    pub fn OS_TaskRegister() -> int32;
}
extern "C" {
    pub fn OS_TaskGetId() -> uint32;
}
extern "C" {
    pub fn OS_TaskGetIdByName(task_id: *mut uint32,
                              task_name: *const ::std::os::raw::c_char)
     -> int32;
}
extern "C" {
    pub fn OS_TaskGetInfo(task_id: uint32, task_prop: *mut OS_task_prop_t)
     -> int32;
}
extern "C" {
    pub fn OS_QueueCreate(queue_id: *mut uint32,
                          queue_name: *const ::std::os::raw::c_char,
                          queue_depth: uint32, data_size: uint32,
                          flags: uint32) -> int32;
}
extern "C" {
    pub fn OS_QueueDelete(queue_id: uint32) -> int32;
}
extern "C" {
    pub fn OS_QueueGet(queue_id: uint32, data: *mut ::std::os::raw::c_void,
                       size: uint32, size_copied: *mut uint32, timeout: int32)
     -> int32;
}
extern "C" {
    pub fn OS_QueuePut(queue_id: uint32, data: *const ::std::os::raw::c_void,
                       size: uint32, flags: uint32) -> int32;
}
extern "C" {
    pub fn OS_QueueGetIdByName(queue_id: *mut uint32,
                               queue_name: *const ::std::os::raw::c_char)
     -> int32;
}
extern "C" {
    pub fn OS_QueueGetInfo(queue_id: uint32, queue_prop: *mut OS_queue_prop_t)
     -> int32;
}
extern "C" {
    pub fn OS_BinSemCreate(sem_id: *mut uint32,
                           sem_name: *const ::std::os::raw::c_char,
                           sem_initial_value: uint32, options: uint32)
     -> int32;
}
extern "C" {
    pub fn OS_BinSemFlush(sem_id: uint32) -> int32;
}
extern "C" {
    pub fn OS_BinSemGive(sem_id: uint32) -> int32;
}
extern "C" {
    pub fn OS_BinSemTake(sem_id: uint32) -> int32;
}
extern "C" {
    pub fn OS_BinSemTimedWait(sem_id: uint32, msecs: uint32) -> int32;
}
extern "C" {
    pub fn OS_BinSemDelete(sem_id: uint32) -> int32;
}
extern "C" {
    pub fn OS_BinSemGetIdByName(sem_id: *mut uint32,
                                sem_name: *const ::std::os::raw::c_char)
     -> int32;
}
extern "C" {
    pub fn OS_BinSemGetInfo(sem_id: uint32, bin_prop: *mut OS_bin_sem_prop_t)
     -> int32;
}
extern "C" {
    pub fn OS_CountSemCreate(sem_id: *mut uint32,
                             sem_name: *const ::std::os::raw::c_char,
                             sem_initial_value: uint32, options: uint32)
     -> int32;
}
extern "C" {
    pub fn OS_CountSemGive(sem_id: uint32) -> int32;
}
extern "C" {
    pub fn OS_CountSemTake(sem_id: uint32) -> int32;
}
extern "C" {
    pub fn OS_CountSemTimedWait(sem_id: uint32, msecs: uint32) -> int32;
}
extern "C" {
    pub fn OS_CountSemDelete(sem_id: uint32) -> int32;
}
extern "C" {
    pub fn OS_CountSemGetIdByName(sem_id: *mut uint32,
                                  sem_name: *const ::std::os::raw::c_char)
     -> int32;
}
extern "C" {
    pub fn OS_CountSemGetInfo(sem_id: uint32,
                              count_prop: *mut OS_count_sem_prop_t) -> int32;
}
extern "C" {
    pub fn OS_MutSemCreate(sem_id: *mut uint32,
                           sem_name: *const ::std::os::raw::c_char,
                           options: uint32) -> int32;
}
extern "C" {
    pub fn OS_MutSemGive(sem_id: uint32) -> int32;
}
extern "C" {
    pub fn OS_MutSemTake(sem_id: uint32) -> int32;
}
extern "C" {
    pub fn OS_MutSemDelete(sem_id: uint32) -> int32;
}
extern "C" {
    pub fn OS_MutSemGetIdByName(sem_id: *mut uint32,
                                sem_name: *const ::std::os::raw::c_char)
     -> int32;
}
extern "C" {
    pub fn OS_MutSemGetInfo(sem_id: uint32, mut_prop: *mut OS_mut_sem_prop_t)
     -> int32;
}
extern "C" {
    pub fn OS_Milli2Ticks(milli_seconds: uint32) -> int32;
}
extern "C" {
    pub fn OS_Tick2Micros() -> int32;
}
extern "C" {
    pub fn OS_GetLocalTime(time_struct: *mut OS_time_t) -> int32;
}
extern "C" {
    pub fn OS_SetLocalTime(time_struct: *mut OS_time_t) -> int32;
}
extern "C" {
    pub fn OS_ExcAttachHandler(ExceptionNumber: uint32,
                               ExceptionHandler:
                                   ::std::option::Option<unsafe extern "C" fn(arg1:
                                                                                  uint32,
                                                                              arg2:
                                                                                  *const ::std::os::raw::c_void,
                                                                              arg3:
                                                                                  uint32)>,
                               parameter: int32) -> int32;
}
extern "C" {
    pub fn OS_ExcEnable(ExceptionNumber: int32) -> int32;
}
extern "C" {
    pub fn OS_ExcDisable(ExceptionNumber: int32) -> int32;
}
extern "C" {
    pub fn OS_FPUExcAttachHandler(ExceptionNumber: uint32,
                                  ExceptionHandler:
                                      *mut ::std::os::raw::c_void,
                                  parameter: int32) -> int32;
}
extern "C" {
    pub fn OS_FPUExcEnable(ExceptionNumber: int32) -> int32;
}
extern "C" {
    pub fn OS_FPUExcDisable(ExceptionNumber: int32) -> int32;
}
extern "C" {
    pub fn OS_FPUExcSetMask(mask: uint32) -> int32;
}
extern "C" {
    pub fn OS_FPUExcGetMask(mask: *mut uint32) -> int32;
}
extern "C" {
    pub fn OS_IntAttachHandler(InterruptNumber: uint32,
                               InterruptHandler: osal_task_entry,
                               parameter: int32) -> int32;
}
extern "C" {
    pub fn OS_IntUnlock(IntLevel: int32) -> int32;
}
extern "C" {
    pub fn OS_IntLock() -> int32;
}
extern "C" {
    pub fn OS_IntEnable(Level: int32) -> int32;
}
extern "C" {
    pub fn OS_IntDisable(Level: int32) -> int32;
}
extern "C" {
    pub fn OS_IntSetMask(mask: uint32) -> int32;
}
extern "C" {
    pub fn OS_IntGetMask(mask: *mut uint32) -> int32;
}
extern "C" {
    pub fn OS_IntAck(InterruptNumber: int32) -> int32;
}
extern "C" {
    pub fn OS_ShMemInit() -> int32;
}
extern "C" {
    pub fn OS_ShMemCreate(Id: *mut uint32, NBytes: uint32,
                          SegName: *const ::std::os::raw::c_char) -> int32;
}
extern "C" {
    pub fn OS_ShMemSemTake(Id: uint32) -> int32;
}
extern "C" {
    pub fn OS_ShMemSemGive(Id: uint32) -> int32;
}
extern "C" {
    pub fn OS_ShMemAttach(Address: *mut cpuaddr, Id: uint32) -> int32;
}
extern "C" {
    pub fn OS_ShMemGetIdByName(ShMemId: *mut uint32,
                               SegName: *const ::std::os::raw::c_char)
     -> int32;
}
extern "C" {
    pub fn OS_HeapGetInfo(heap_prop: *mut OS_heap_prop_t) -> int32;
}
extern "C" {
    pub fn OS_GetErrorName(error_num: int32, err_name: *mut os_err_name_t)
     -> int32;
}
extern "C" {
    pub fn OS_printf(string: *const ::std::os::raw::c_char, ...);
}
extern "C" {
    pub fn OS_printf_disable();
}
extern "C" {
    pub fn OS_printf_enable();
}
extern "C" {
    pub fn OS_ApplicationExit(Status: int32);
}
pub type __u_char = ::std::os::raw::c_uchar;
pub type __u_short = ::std::os::raw::c_ushort;
pub type __u_int = ::std::os::raw::c_uint;
pub type __u_long = ::std::os::raw::c_ulong;
pub type __int8_t = ::std::os::raw::c_schar;
pub type __uint8_t = ::std::os::raw::c_uchar;
pub type __int16_t = ::std::os::raw::c_short;
pub type __uint16_t = ::std::os::raw::c_ushort;
pub type __int32_t = ::std::os::raw::c_int;
pub type __uint32_t = ::std::os::raw::c_uint;
pub type __int64_t = ::std::os::raw::c_long;
pub type __uint64_t = ::std::os::raw::c_ulong;
pub type __quad_t = ::std::os::raw::c_long;
pub type __u_quad_t = ::std::os::raw::c_ulong;
pub type __dev_t = ::std::os::raw::c_ulong;
pub type __uid_t = ::std::os::raw::c_uint;
pub type __gid_t = ::std::os::raw::c_uint;
pub type __ino_t = ::std::os::raw::c_ulong;
pub type __ino64_t = ::std::os::raw::c_ulong;
pub type __mode_t = ::std::os::raw::c_uint;
pub type __nlink_t = ::std::os::raw::c_ulong;
pub type __off_t = ::std::os::raw::c_long;
pub type __off64_t = ::std::os::raw::c_long;
pub type __pid_t = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Debug, Copy)]
pub struct __fsid_t {
    pub __val: [::std::os::raw::c_int; 2usize],
}
#[test]
fn bindgen_test_layout___fsid_t() {
    assert_eq!(::std::mem::size_of::<__fsid_t>() , 8usize , concat ! (
               "Size of: " , stringify ! ( __fsid_t ) ));
    assert_eq! (::std::mem::align_of::<__fsid_t>() , 4usize , concat ! (
                "Alignment of " , stringify ! ( __fsid_t ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const __fsid_t ) ) . __val as * const _ as
                usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( __fsid_t ) , "::" ,
                stringify ! ( __val ) ));
}
impl Clone for __fsid_t {
    fn clone(&self) -> Self { *self }
}
pub type __clock_t = ::std::os::raw::c_long;
pub type __rlim_t = ::std::os::raw::c_ulong;
pub type __rlim64_t = ::std::os::raw::c_ulong;
pub type __id_t = ::std::os::raw::c_uint;
pub type __time_t = ::std::os::raw::c_long;
pub type __useconds_t = ::std::os::raw::c_uint;
pub type __suseconds_t = ::std::os::raw::c_long;
pub type __daddr_t = ::std::os::raw::c_int;
pub type __key_t = ::std::os::raw::c_int;
pub type __clockid_t = ::std::os::raw::c_int;
pub type __timer_t = *mut ::std::os::raw::c_void;
pub type __blksize_t = ::std::os::raw::c_long;
pub type __blkcnt_t = ::std::os::raw::c_long;
pub type __blkcnt64_t = ::std::os::raw::c_long;
pub type __fsblkcnt_t = ::std::os::raw::c_ulong;
pub type __fsblkcnt64_t = ::std::os::raw::c_ulong;
pub type __fsfilcnt_t = ::std::os::raw::c_ulong;
pub type __fsfilcnt64_t = ::std::os::raw::c_ulong;
pub type __fsword_t = ::std::os::raw::c_long;
pub type __ssize_t = ::std::os::raw::c_long;
pub type __syscall_slong_t = ::std::os::raw::c_long;
pub type __syscall_ulong_t = ::std::os::raw::c_ulong;
pub type __loff_t = __off64_t;
pub type __qaddr_t = *mut __quad_t;
pub type __caddr_t = *mut ::std::os::raw::c_char;
pub type __intptr_t = ::std::os::raw::c_long;
pub type __socklen_t = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy)]
pub struct _IO_FILE {
    pub _flags: ::std::os::raw::c_int,
    pub _IO_read_ptr: *mut ::std::os::raw::c_char,
    pub _IO_read_end: *mut ::std::os::raw::c_char,
    pub _IO_read_base: *mut ::std::os::raw::c_char,
    pub _IO_write_base: *mut ::std::os::raw::c_char,
    pub _IO_write_ptr: *mut ::std::os::raw::c_char,
    pub _IO_write_end: *mut ::std::os::raw::c_char,
    pub _IO_buf_base: *mut ::std::os::raw::c_char,
    pub _IO_buf_end: *mut ::std::os::raw::c_char,
    pub _IO_save_base: *mut ::std::os::raw::c_char,
    pub _IO_backup_base: *mut ::std::os::raw::c_char,
    pub _IO_save_end: *mut ::std::os::raw::c_char,
    pub _markers: *mut _IO_marker,
    pub _chain: *mut _IO_FILE,
    pub _fileno: ::std::os::raw::c_int,
    pub _flags2: ::std::os::raw::c_int,
    pub _old_offset: __off_t,
    pub _cur_column: ::std::os::raw::c_ushort,
    pub _vtable_offset: ::std::os::raw::c_schar,
    pub _shortbuf: [::std::os::raw::c_char; 1usize],
    pub _lock: *mut _IO_lock_t,
    pub _offset: __off64_t,
    pub __pad1: *mut ::std::os::raw::c_void,
    pub __pad2: *mut ::std::os::raw::c_void,
    pub __pad3: *mut ::std::os::raw::c_void,
    pub __pad4: *mut ::std::os::raw::c_void,
    pub __pad5: usize,
    pub _mode: ::std::os::raw::c_int,
    pub _unused2: [::std::os::raw::c_char; 20usize],
}
#[test]
fn bindgen_test_layout__IO_FILE() {
    assert_eq!(::std::mem::size_of::<_IO_FILE>() , 216usize , concat ! (
               "Size of: " , stringify ! ( _IO_FILE ) ));
    assert_eq! (::std::mem::align_of::<_IO_FILE>() , 8usize , concat ! (
                "Alignment of " , stringify ! ( _IO_FILE ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _IO_FILE ) ) . _flags as * const _ as
                usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( _IO_FILE ) , "::" ,
                stringify ! ( _flags ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _IO_FILE ) ) . _IO_read_ptr as * const _
                as usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( _IO_FILE ) , "::" ,
                stringify ! ( _IO_read_ptr ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _IO_FILE ) ) . _IO_read_end as * const _
                as usize } , 16usize , concat ! (
                "Alignment of field: " , stringify ! ( _IO_FILE ) , "::" ,
                stringify ! ( _IO_read_end ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _IO_FILE ) ) . _IO_read_base as * const _
                as usize } , 24usize , concat ! (
                "Alignment of field: " , stringify ! ( _IO_FILE ) , "::" ,
                stringify ! ( _IO_read_base ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _IO_FILE ) ) . _IO_write_base as * const
                _ as usize } , 32usize , concat ! (
                "Alignment of field: " , stringify ! ( _IO_FILE ) , "::" ,
                stringify ! ( _IO_write_base ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _IO_FILE ) ) . _IO_write_ptr as * const _
                as usize } , 40usize , concat ! (
                "Alignment of field: " , stringify ! ( _IO_FILE ) , "::" ,
                stringify ! ( _IO_write_ptr ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _IO_FILE ) ) . _IO_write_end as * const _
                as usize } , 48usize , concat ! (
                "Alignment of field: " , stringify ! ( _IO_FILE ) , "::" ,
                stringify ! ( _IO_write_end ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _IO_FILE ) ) . _IO_buf_base as * const _
                as usize } , 56usize , concat ! (
                "Alignment of field: " , stringify ! ( _IO_FILE ) , "::" ,
                stringify ! ( _IO_buf_base ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _IO_FILE ) ) . _IO_buf_end as * const _
                as usize } , 64usize , concat ! (
                "Alignment of field: " , stringify ! ( _IO_FILE ) , "::" ,
                stringify ! ( _IO_buf_end ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _IO_FILE ) ) . _IO_save_base as * const _
                as usize } , 72usize , concat ! (
                "Alignment of field: " , stringify ! ( _IO_FILE ) , "::" ,
                stringify ! ( _IO_save_base ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _IO_FILE ) ) . _IO_backup_base as * const
                _ as usize } , 80usize , concat ! (
                "Alignment of field: " , stringify ! ( _IO_FILE ) , "::" ,
                stringify ! ( _IO_backup_base ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _IO_FILE ) ) . _IO_save_end as * const _
                as usize } , 88usize , concat ! (
                "Alignment of field: " , stringify ! ( _IO_FILE ) , "::" ,
                stringify ! ( _IO_save_end ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _IO_FILE ) ) . _markers as * const _ as
                usize } , 96usize , concat ! (
                "Alignment of field: " , stringify ! ( _IO_FILE ) , "::" ,
                stringify ! ( _markers ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _IO_FILE ) ) . _chain as * const _ as
                usize } , 104usize , concat ! (
                "Alignment of field: " , stringify ! ( _IO_FILE ) , "::" ,
                stringify ! ( _chain ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _IO_FILE ) ) . _fileno as * const _ as
                usize } , 112usize , concat ! (
                "Alignment of field: " , stringify ! ( _IO_FILE ) , "::" ,
                stringify ! ( _fileno ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _IO_FILE ) ) . _flags2 as * const _ as
                usize } , 116usize , concat ! (
                "Alignment of field: " , stringify ! ( _IO_FILE ) , "::" ,
                stringify ! ( _flags2 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _IO_FILE ) ) . _old_offset as * const _
                as usize } , 120usize , concat ! (
                "Alignment of field: " , stringify ! ( _IO_FILE ) , "::" ,
                stringify ! ( _old_offset ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _IO_FILE ) ) . _cur_column as * const _
                as usize } , 128usize , concat ! (
                "Alignment of field: " , stringify ! ( _IO_FILE ) , "::" ,
                stringify ! ( _cur_column ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _IO_FILE ) ) . _vtable_offset as * const
                _ as usize } , 130usize , concat ! (
                "Alignment of field: " , stringify ! ( _IO_FILE ) , "::" ,
                stringify ! ( _vtable_offset ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _IO_FILE ) ) . _shortbuf as * const _ as
                usize } , 131usize , concat ! (
                "Alignment of field: " , stringify ! ( _IO_FILE ) , "::" ,
                stringify ! ( _shortbuf ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _IO_FILE ) ) . _lock as * const _ as
                usize } , 136usize , concat ! (
                "Alignment of field: " , stringify ! ( _IO_FILE ) , "::" ,
                stringify ! ( _lock ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _IO_FILE ) ) . _offset as * const _ as
                usize } , 144usize , concat ! (
                "Alignment of field: " , stringify ! ( _IO_FILE ) , "::" ,
                stringify ! ( _offset ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _IO_FILE ) ) . __pad1 as * const _ as
                usize } , 152usize , concat ! (
                "Alignment of field: " , stringify ! ( _IO_FILE ) , "::" ,
                stringify ! ( __pad1 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _IO_FILE ) ) . __pad2 as * const _ as
                usize } , 160usize , concat ! (
                "Alignment of field: " , stringify ! ( _IO_FILE ) , "::" ,
                stringify ! ( __pad2 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _IO_FILE ) ) . __pad3 as * const _ as
                usize } , 168usize , concat ! (
                "Alignment of field: " , stringify ! ( _IO_FILE ) , "::" ,
                stringify ! ( __pad3 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _IO_FILE ) ) . __pad4 as * const _ as
                usize } , 176usize , concat ! (
                "Alignment of field: " , stringify ! ( _IO_FILE ) , "::" ,
                stringify ! ( __pad4 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _IO_FILE ) ) . __pad5 as * const _ as
                usize } , 184usize , concat ! (
                "Alignment of field: " , stringify ! ( _IO_FILE ) , "::" ,
                stringify ! ( __pad5 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _IO_FILE ) ) . _mode as * const _ as
                usize } , 192usize , concat ! (
                "Alignment of field: " , stringify ! ( _IO_FILE ) , "::" ,
                stringify ! ( _mode ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _IO_FILE ) ) . _unused2 as * const _ as
                usize } , 196usize , concat ! (
                "Alignment of field: " , stringify ! ( _IO_FILE ) , "::" ,
                stringify ! ( _unused2 ) ));
}
impl Clone for _IO_FILE {
    fn clone(&self) -> Self { *self }
}
pub type FILE = _IO_FILE;
pub type __FILE = _IO_FILE;
#[repr(C)]
#[derive(Debug, Copy)]
pub struct __mbstate_t {
    pub __count: ::std::os::raw::c_int,
    pub __value: __mbstate_t__bindgen_ty_1,
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct __mbstate_t__bindgen_ty_1 {
    pub __wch: __BindgenUnionField<::std::os::raw::c_uint>,
    pub __wchb: __BindgenUnionField<[::std::os::raw::c_char; 4usize]>,
    pub bindgen_union_field: u32,
}
#[test]
fn bindgen_test_layout___mbstate_t__bindgen_ty_1() {
    assert_eq!(::std::mem::size_of::<__mbstate_t__bindgen_ty_1>() , 4usize ,
               concat ! (
               "Size of: " , stringify ! ( __mbstate_t__bindgen_ty_1 ) ));
    assert_eq! (::std::mem::align_of::<__mbstate_t__bindgen_ty_1>() , 4usize ,
                concat ! (
                "Alignment of " , stringify ! ( __mbstate_t__bindgen_ty_1 )
                ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const __mbstate_t__bindgen_ty_1 ) ) . __wch as
                * const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! (
                __mbstate_t__bindgen_ty_1 ) , "::" , stringify ! ( __wch ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const __mbstate_t__bindgen_ty_1 ) ) . __wchb as
                * const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! (
                __mbstate_t__bindgen_ty_1 ) , "::" , stringify ! ( __wchb )
                ));
}
impl Clone for __mbstate_t__bindgen_ty_1 {
    fn clone(&self) -> Self { *self }
}
#[test]
fn bindgen_test_layout___mbstate_t() {
    assert_eq!(::std::mem::size_of::<__mbstate_t>() , 8usize , concat ! (
               "Size of: " , stringify ! ( __mbstate_t ) ));
    assert_eq! (::std::mem::align_of::<__mbstate_t>() , 4usize , concat ! (
                "Alignment of " , stringify ! ( __mbstate_t ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const __mbstate_t ) ) . __count as * const _ as
                usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( __mbstate_t ) , "::" ,
                stringify ! ( __count ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const __mbstate_t ) ) . __value as * const _ as
                usize } , 4usize , concat ! (
                "Alignment of field: " , stringify ! ( __mbstate_t ) , "::" ,
                stringify ! ( __value ) ));
}
impl Clone for __mbstate_t {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct _G_fpos_t {
    pub __pos: __off_t,
    pub __state: __mbstate_t,
}
#[test]
fn bindgen_test_layout__G_fpos_t() {
    assert_eq!(::std::mem::size_of::<_G_fpos_t>() , 16usize , concat ! (
               "Size of: " , stringify ! ( _G_fpos_t ) ));
    assert_eq! (::std::mem::align_of::<_G_fpos_t>() , 8usize , concat ! (
                "Alignment of " , stringify ! ( _G_fpos_t ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _G_fpos_t ) ) . __pos as * const _ as
                usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( _G_fpos_t ) , "::" ,
                stringify ! ( __pos ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _G_fpos_t ) ) . __state as * const _ as
                usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( _G_fpos_t ) , "::" ,
                stringify ! ( __state ) ));
}
impl Clone for _G_fpos_t {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct _G_fpos64_t {
    pub __pos: __off64_t,
    pub __state: __mbstate_t,
}
#[test]
fn bindgen_test_layout__G_fpos64_t() {
    assert_eq!(::std::mem::size_of::<_G_fpos64_t>() , 16usize , concat ! (
               "Size of: " , stringify ! ( _G_fpos64_t ) ));
    assert_eq! (::std::mem::align_of::<_G_fpos64_t>() , 8usize , concat ! (
                "Alignment of " , stringify ! ( _G_fpos64_t ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _G_fpos64_t ) ) . __pos as * const _ as
                usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( _G_fpos64_t ) , "::" ,
                stringify ! ( __pos ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _G_fpos64_t ) ) . __state as * const _ as
                usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( _G_fpos64_t ) , "::" ,
                stringify ! ( __state ) ));
}
impl Clone for _G_fpos64_t {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _IO_jump_t {
    _unused: [u8; 0],
}
pub type _IO_lock_t = ::std::os::raw::c_void;
#[repr(C)]
#[derive(Debug, Copy)]
pub struct _IO_marker {
    pub _next: *mut _IO_marker,
    pub _sbuf: *mut _IO_FILE,
    pub _pos: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout__IO_marker() {
    assert_eq!(::std::mem::size_of::<_IO_marker>() , 24usize , concat ! (
               "Size of: " , stringify ! ( _IO_marker ) ));
    assert_eq! (::std::mem::align_of::<_IO_marker>() , 8usize , concat ! (
                "Alignment of " , stringify ! ( _IO_marker ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _IO_marker ) ) . _next as * const _ as
                usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( _IO_marker ) , "::" ,
                stringify ! ( _next ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _IO_marker ) ) . _sbuf as * const _ as
                usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( _IO_marker ) , "::" ,
                stringify ! ( _sbuf ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _IO_marker ) ) . _pos as * const _ as
                usize } , 16usize , concat ! (
                "Alignment of field: " , stringify ! ( _IO_marker ) , "::" ,
                stringify ! ( _pos ) ));
}
impl Clone for _IO_marker {
    fn clone(&self) -> Self { *self }
}
#[repr(u32)]
#[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
pub enum __codecvt_result {
    __codecvt_ok = 0,
    __codecvt_partial = 1,
    __codecvt_error = 2,
    __codecvt_noconv = 3,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _IO_FILE_plus {
    _unused: [u8; 0],
}
extern "C" {
    #[link_name = "_IO_2_1_stdin_"]
    pub static mut _IO_2_1_stdin_: _IO_FILE_plus;
}
extern "C" {
    #[link_name = "_IO_2_1_stdout_"]
    pub static mut _IO_2_1_stdout_: _IO_FILE_plus;
}
extern "C" {
    #[link_name = "_IO_2_1_stderr_"]
    pub static mut _IO_2_1_stderr_: _IO_FILE_plus;
}
pub type __io_read_fn =
    ::std::option::Option<unsafe extern "C" fn(__cookie:
                                                   *mut ::std::os::raw::c_void,
                                               __buf:
                                                   *mut ::std::os::raw::c_char,
                                               __nbytes: usize) -> __ssize_t>;
pub type __io_write_fn =
    ::std::option::Option<unsafe extern "C" fn(__cookie:
                                                   *mut ::std::os::raw::c_void,
                                               __buf:
                                                   *const ::std::os::raw::c_char,
                                               __n: usize) -> __ssize_t>;
pub type __io_seek_fn =
    ::std::option::Option<unsafe extern "C" fn(__cookie:
                                                   *mut ::std::os::raw::c_void,
                                               __pos: *mut __off64_t,
                                               __w: ::std::os::raw::c_int)
                              -> ::std::os::raw::c_int>;
pub type __io_close_fn =
    ::std::option::Option<unsafe extern "C" fn(__cookie:
                                                   *mut ::std::os::raw::c_void)
                              -> ::std::os::raw::c_int>;
extern "C" {
    pub fn __underflow(arg1: *mut _IO_FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn __uflow(arg1: *mut _IO_FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn __overflow(arg1: *mut _IO_FILE, arg2: ::std::os::raw::c_int)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _IO_getc(__fp: *mut _IO_FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _IO_putc(__c: ::std::os::raw::c_int, __fp: *mut _IO_FILE)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _IO_feof(__fp: *mut _IO_FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _IO_ferror(__fp: *mut _IO_FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _IO_peekc_locked(__fp: *mut _IO_FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _IO_flockfile(arg1: *mut _IO_FILE);
}
extern "C" {
    pub fn _IO_funlockfile(arg1: *mut _IO_FILE);
}
extern "C" {
    pub fn _IO_ftrylockfile(arg1: *mut _IO_FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _IO_vfscanf(arg1: *mut _IO_FILE,
                       arg2: *const ::std::os::raw::c_char,
                       arg3: *mut __va_list_tag,
                       arg4: *mut ::std::os::raw::c_int)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _IO_vfprintf(arg1: *mut _IO_FILE,
                        arg2: *const ::std::os::raw::c_char,
                        arg3: *mut __va_list_tag) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _IO_padn(arg1: *mut _IO_FILE, arg2: ::std::os::raw::c_int,
                    arg3: __ssize_t) -> __ssize_t;
}
extern "C" {
    pub fn _IO_sgetn(arg1: *mut _IO_FILE, arg2: *mut ::std::os::raw::c_void,
                     arg3: usize) -> usize;
}
extern "C" {
    pub fn _IO_seekoff(arg1: *mut _IO_FILE, arg2: __off64_t,
                       arg3: ::std::os::raw::c_int,
                       arg4: ::std::os::raw::c_int) -> __off64_t;
}
extern "C" {
    pub fn _IO_seekpos(arg1: *mut _IO_FILE, arg2: __off64_t,
                       arg3: ::std::os::raw::c_int) -> __off64_t;
}
extern "C" {
    pub fn _IO_free_backup_area(arg1: *mut _IO_FILE);
}
pub type off_t = __off_t;
pub type fpos_t = _G_fpos_t;
extern "C" {
    #[link_name = "stdin"]
    pub static mut stdin: *mut _IO_FILE;
}
extern "C" {
    #[link_name = "stdout"]
    pub static mut stdout: *mut _IO_FILE;
}
extern "C" {
    #[link_name = "stderr"]
    pub static mut stderr: *mut _IO_FILE;
}
extern "C" {
    pub fn remove(__filename: *const ::std::os::raw::c_char)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn rename(__old: *const ::std::os::raw::c_char,
                  __new: *const ::std::os::raw::c_char)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn renameat(__oldfd: ::std::os::raw::c_int,
                    __old: *const ::std::os::raw::c_char,
                    __newfd: ::std::os::raw::c_int,
                    __new: *const ::std::os::raw::c_char)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn tmpfile() -> *mut FILE;
}
extern "C" {
    pub fn tmpnam(__s: *mut ::std::os::raw::c_char)
     -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn tmpnam_r(__s: *mut ::std::os::raw::c_char)
     -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn tempnam(__dir: *const ::std::os::raw::c_char,
                   __pfx: *const ::std::os::raw::c_char)
     -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn fclose(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fflush(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fflush_unlocked(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fopen(__filename: *const ::std::os::raw::c_char,
                 __modes: *const ::std::os::raw::c_char) -> *mut FILE;
}
extern "C" {
    pub fn freopen(__filename: *const ::std::os::raw::c_char,
                   __modes: *const ::std::os::raw::c_char,
                   __stream: *mut FILE) -> *mut FILE;
}
extern "C" {
    pub fn fdopen(__fd: ::std::os::raw::c_int,
                  __modes: *const ::std::os::raw::c_char) -> *mut FILE;
}
extern "C" {
    pub fn fmemopen(__s: *mut ::std::os::raw::c_void, __len: usize,
                    __modes: *const ::std::os::raw::c_char) -> *mut FILE;
}
extern "C" {
    pub fn open_memstream(__bufloc: *mut *mut ::std::os::raw::c_char,
                          __sizeloc: *mut usize) -> *mut FILE;
}
extern "C" {
    pub fn setbuf(__stream: *mut FILE, __buf: *mut ::std::os::raw::c_char);
}
extern "C" {
    pub fn setvbuf(__stream: *mut FILE, __buf: *mut ::std::os::raw::c_char,
                   __modes: ::std::os::raw::c_int, __n: usize)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn setbuffer(__stream: *mut FILE, __buf: *mut ::std::os::raw::c_char,
                     __size: usize);
}
extern "C" {
    pub fn setlinebuf(__stream: *mut FILE);
}
extern "C" {
    pub fn fprintf(__stream: *mut FILE,
                   __format: *const ::std::os::raw::c_char, ...)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn printf(__format: *const ::std::os::raw::c_char, ...)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn sprintf(__s: *mut ::std::os::raw::c_char,
                   __format: *const ::std::os::raw::c_char, ...)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn vfprintf(__s: *mut FILE, __format: *const ::std::os::raw::c_char,
                    __arg: *mut __va_list_tag) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn vprintf(__format: *const ::std::os::raw::c_char,
                   __arg: *mut __va_list_tag) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn vsprintf(__s: *mut ::std::os::raw::c_char,
                    __format: *const ::std::os::raw::c_char,
                    __arg: *mut __va_list_tag) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn snprintf(__s: *mut ::std::os::raw::c_char, __maxlen: usize,
                    __format: *const ::std::os::raw::c_char, ...)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn vsnprintf(__s: *mut ::std::os::raw::c_char, __maxlen: usize,
                     __format: *const ::std::os::raw::c_char,
                     __arg: *mut __va_list_tag) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn vdprintf(__fd: ::std::os::raw::c_int,
                    __fmt: *const ::std::os::raw::c_char,
                    __arg: *mut __va_list_tag) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn dprintf(__fd: ::std::os::raw::c_int,
                   __fmt: *const ::std::os::raw::c_char, ...)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fscanf(__stream: *mut FILE,
                  __format: *const ::std::os::raw::c_char, ...)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn scanf(__format: *const ::std::os::raw::c_char, ...)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn sscanf(__s: *const ::std::os::raw::c_char,
                  __format: *const ::std::os::raw::c_char, ...)
     -> ::std::os::raw::c_int;
}
extern "C" {
    #[link_name = "__isoc99_fscanf"]
    pub fn fscanf1(__stream: *mut FILE,
                   __format: *const ::std::os::raw::c_char, ...)
     -> ::std::os::raw::c_int;
}
extern "C" {
    #[link_name = "__isoc99_scanf"]
    pub fn scanf1(__format: *const ::std::os::raw::c_char, ...)
     -> ::std::os::raw::c_int;
}
extern "C" {
    #[link_name = "__isoc99_sscanf"]
    pub fn sscanf1(__s: *const ::std::os::raw::c_char,
                   __format: *const ::std::os::raw::c_char, ...)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn vfscanf(__s: *mut FILE, __format: *const ::std::os::raw::c_char,
                   __arg: *mut __va_list_tag) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn vscanf(__format: *const ::std::os::raw::c_char,
                  __arg: *mut __va_list_tag) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn vsscanf(__s: *const ::std::os::raw::c_char,
                   __format: *const ::std::os::raw::c_char,
                   __arg: *mut __va_list_tag) -> ::std::os::raw::c_int;
}
extern "C" {
    #[link_name = "__isoc99_vfscanf"]
    pub fn vfscanf1(__s: *mut FILE, __format: *const ::std::os::raw::c_char,
                    __arg: *mut __va_list_tag) -> ::std::os::raw::c_int;
}
extern "C" {
    #[link_name = "__isoc99_vscanf"]
    pub fn vscanf1(__format: *const ::std::os::raw::c_char,
                   __arg: *mut __va_list_tag) -> ::std::os::raw::c_int;
}
extern "C" {
    #[link_name = "__isoc99_vsscanf"]
    pub fn vsscanf1(__s: *const ::std::os::raw::c_char,
                    __format: *const ::std::os::raw::c_char,
                    __arg: *mut __va_list_tag) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fgetc(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn getc(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn getchar() -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn getc_unlocked(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn getchar_unlocked() -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fgetc_unlocked(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fputc(__c: ::std::os::raw::c_int, __stream: *mut FILE)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn putc(__c: ::std::os::raw::c_int, __stream: *mut FILE)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn putchar(__c: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fputc_unlocked(__c: ::std::os::raw::c_int, __stream: *mut FILE)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn putc_unlocked(__c: ::std::os::raw::c_int, __stream: *mut FILE)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn putchar_unlocked(__c: ::std::os::raw::c_int)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn getw(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn putw(__w: ::std::os::raw::c_int, __stream: *mut FILE)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fgets(__s: *mut ::std::os::raw::c_char, __n: ::std::os::raw::c_int,
                 __stream: *mut FILE) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn __getdelim(__lineptr: *mut *mut ::std::os::raw::c_char,
                      __n: *mut usize, __delimiter: ::std::os::raw::c_int,
                      __stream: *mut FILE) -> __ssize_t;
}
extern "C" {
    pub fn getdelim(__lineptr: *mut *mut ::std::os::raw::c_char,
                    __n: *mut usize, __delimiter: ::std::os::raw::c_int,
                    __stream: *mut FILE) -> __ssize_t;
}
extern "C" {
    pub fn getline(__lineptr: *mut *mut ::std::os::raw::c_char,
                   __n: *mut usize, __stream: *mut FILE) -> __ssize_t;
}
extern "C" {
    pub fn fputs(__s: *const ::std::os::raw::c_char, __stream: *mut FILE)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn puts(__s: *const ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ungetc(__c: ::std::os::raw::c_int, __stream: *mut FILE)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fread(__ptr: *mut ::std::os::raw::c_void, __size: usize,
                 __n: usize, __stream: *mut FILE) -> usize;
}
extern "C" {
    pub fn fwrite(__ptr: *const ::std::os::raw::c_void, __size: usize,
                  __n: usize, __s: *mut FILE) -> usize;
}
extern "C" {
    pub fn fread_unlocked(__ptr: *mut ::std::os::raw::c_void, __size: usize,
                          __n: usize, __stream: *mut FILE) -> usize;
}
extern "C" {
    pub fn fwrite_unlocked(__ptr: *const ::std::os::raw::c_void,
                           __size: usize, __n: usize, __stream: *mut FILE)
     -> usize;
}
extern "C" {
    pub fn fseek(__stream: *mut FILE, __off: ::std::os::raw::c_long,
                 __whence: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ftell(__stream: *mut FILE) -> ::std::os::raw::c_long;
}
extern "C" {
    pub fn rewind(__stream: *mut FILE);
}
extern "C" {
    pub fn fseeko(__stream: *mut FILE, __off: __off_t,
                  __whence: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ftello(__stream: *mut FILE) -> __off_t;
}
extern "C" {
    pub fn fgetpos(__stream: *mut FILE, __pos: *mut fpos_t)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fsetpos(__stream: *mut FILE, __pos: *const fpos_t)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn clearerr(__stream: *mut FILE);
}
extern "C" {
    pub fn feof(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ferror(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn clearerr_unlocked(__stream: *mut FILE);
}
extern "C" {
    pub fn feof_unlocked(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ferror_unlocked(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn perror(__s: *const ::std::os::raw::c_char);
}
extern "C" {
    #[link_name = "sys_nerr"]
    pub static mut sys_nerr: ::std::os::raw::c_int;
}
extern "C" {
    #[link_name = "sys_errlist"]
    pub static mut sys_errlist: [*const ::std::os::raw::c_char; 0usize];
}
extern "C" {
    pub fn fileno(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fileno_unlocked(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn popen(__command: *const ::std::os::raw::c_char,
                 __modes: *const ::std::os::raw::c_char) -> *mut FILE;
}
extern "C" {
    pub fn pclose(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ctermid(__s: *mut ::std::os::raw::c_char)
     -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn flockfile(__stream: *mut FILE);
}
extern "C" {
    pub fn ftrylockfile(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn funlockfile(__stream: *mut FILE);
}
pub type wchar_t = ::std::os::raw::c_int;
#[repr(u32)]
#[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
pub enum idtype_t { P_ALL = 0, P_PID = 1, P_PGID = 2, }
#[repr(C)]
#[derive(Debug, Copy)]
pub struct wait {
    pub w_status: __BindgenUnionField<::std::os::raw::c_int>,
    pub __wait_terminated: __BindgenUnionField<wait__bindgen_ty_1>,
    pub __wait_stopped: __BindgenUnionField<wait__bindgen_ty_2>,
    pub bindgen_union_field: u32,
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct wait__bindgen_ty_1 {
    pub _bitfield_1: [u16; 2usize],
    pub __bindgen_align: [u32; 0usize],
}
#[test]
fn bindgen_test_layout_wait__bindgen_ty_1() {
    assert_eq!(::std::mem::size_of::<wait__bindgen_ty_1>() , 4usize , concat !
               ( "Size of: " , stringify ! ( wait__bindgen_ty_1 ) ));
    assert_eq! (::std::mem::align_of::<wait__bindgen_ty_1>() , 4usize , concat
                ! ( "Alignment of " , stringify ! ( wait__bindgen_ty_1 ) ));
}
impl Clone for wait__bindgen_ty_1 {
    fn clone(&self) -> Self { *self }
}
impl wait__bindgen_ty_1 {
    #[inline]
    pub fn __w_termsig(&self) -> ::std::os::raw::c_uint {
        let mut unit_field_val: u32 = unsafe { ::std::mem::uninitialized() };
        unsafe {
            ::std::ptr::copy_nonoverlapping(&self._bitfield_1 as *const _ as
                                                *const u8,
                                            &mut unit_field_val as *mut u32 as
                                                *mut u8,
                                            ::std::mem::size_of::<u32>())
        };
        let mask = 127u64 as u32;
        let val = (unit_field_val & mask) >> 0usize;
        unsafe { ::std::mem::transmute(val as u32) }
    }
    #[inline]
    pub fn set___w_termsig(&mut self, val: ::std::os::raw::c_uint) {
        let mask = 127u64 as u32;
        let val = val as u32 as u32;
        let mut unit_field_val: u32 = unsafe { ::std::mem::uninitialized() };
        unsafe {
            ::std::ptr::copy_nonoverlapping(&self._bitfield_1 as *const _ as
                                                *const u8,
                                            &mut unit_field_val as *mut u32 as
                                                *mut u8,
                                            ::std::mem::size_of::<u32>())
        };
        unit_field_val &= !mask;
        unit_field_val |= (val << 0usize) & mask;
        unsafe {
            ::std::ptr::copy_nonoverlapping(&unit_field_val as *const _ as
                                                *const u8,
                                            &mut self._bitfield_1 as *mut _ as
                                                *mut u8,
                                            ::std::mem::size_of::<u32>());
        }
    }
    #[inline]
    pub fn __w_coredump(&self) -> ::std::os::raw::c_uint {
        let mut unit_field_val: u32 = unsafe { ::std::mem::uninitialized() };
        unsafe {
            ::std::ptr::copy_nonoverlapping(&self._bitfield_1 as *const _ as
                                                *const u8,
                                            &mut unit_field_val as *mut u32 as
                                                *mut u8,
                                            ::std::mem::size_of::<u32>())
        };
        let mask = 128u64 as u32;
        let val = (unit_field_val & mask) >> 7usize;
        unsafe { ::std::mem::transmute(val as u32) }
    }
    #[inline]
    pub fn set___w_coredump(&mut self, val: ::std::os::raw::c_uint) {
        let mask = 128u64 as u32;
        let val = val as u32 as u32;
        let mut unit_field_val: u32 = unsafe { ::std::mem::uninitialized() };
        unsafe {
            ::std::ptr::copy_nonoverlapping(&self._bitfield_1 as *const _ as
                                                *const u8,
                                            &mut unit_field_val as *mut u32 as
                                                *mut u8,
                                            ::std::mem::size_of::<u32>())
        };
        unit_field_val &= !mask;
        unit_field_val |= (val << 7usize) & mask;
        unsafe {
            ::std::ptr::copy_nonoverlapping(&unit_field_val as *const _ as
                                                *const u8,
                                            &mut self._bitfield_1 as *mut _ as
                                                *mut u8,
                                            ::std::mem::size_of::<u32>());
        }
    }
    #[inline]
    pub fn __w_retcode(&self) -> ::std::os::raw::c_uint {
        let mut unit_field_val: u32 = unsafe { ::std::mem::uninitialized() };
        unsafe {
            ::std::ptr::copy_nonoverlapping(&self._bitfield_1 as *const _ as
                                                *const u8,
                                            &mut unit_field_val as *mut u32 as
                                                *mut u8,
                                            ::std::mem::size_of::<u32>())
        };
        let mask = 65280u64 as u32;
        let val = (unit_field_val & mask) >> 8usize;
        unsafe { ::std::mem::transmute(val as u32) }
    }
    #[inline]
    pub fn set___w_retcode(&mut self, val: ::std::os::raw::c_uint) {
        let mask = 65280u64 as u32;
        let val = val as u32 as u32;
        let mut unit_field_val: u32 = unsafe { ::std::mem::uninitialized() };
        unsafe {
            ::std::ptr::copy_nonoverlapping(&self._bitfield_1 as *const _ as
                                                *const u8,
                                            &mut unit_field_val as *mut u32 as
                                                *mut u8,
                                            ::std::mem::size_of::<u32>())
        };
        unit_field_val &= !mask;
        unit_field_val |= (val << 8usize) & mask;
        unsafe {
            ::std::ptr::copy_nonoverlapping(&unit_field_val as *const _ as
                                                *const u8,
                                            &mut self._bitfield_1 as *mut _ as
                                                *mut u8,
                                            ::std::mem::size_of::<u32>());
        }
    }
    #[inline]
    pub fn new_bitfield_1(__w_termsig: ::std::os::raw::c_uint,
                          __w_coredump: ::std::os::raw::c_uint,
                          __w_retcode: ::std::os::raw::c_uint) -> u32 {
        ({
             ({
                  ({ 0 } |
                       ((__w_termsig as u32 as u32) << 0usize) &
                           (127u64 as u32))
              } | ((__w_coredump as u32 as u32) << 7usize) & (128u64 as u32))
         } | ((__w_retcode as u32 as u32) << 8usize) & (65280u64 as u32))
    }
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct wait__bindgen_ty_2 {
    pub _bitfield_1: [u16; 2usize],
    pub __bindgen_align: [u32; 0usize],
}
#[test]
fn bindgen_test_layout_wait__bindgen_ty_2() {
    assert_eq!(::std::mem::size_of::<wait__bindgen_ty_2>() , 4usize , concat !
               ( "Size of: " , stringify ! ( wait__bindgen_ty_2 ) ));
    assert_eq! (::std::mem::align_of::<wait__bindgen_ty_2>() , 4usize , concat
                ! ( "Alignment of " , stringify ! ( wait__bindgen_ty_2 ) ));
}
impl Clone for wait__bindgen_ty_2 {
    fn clone(&self) -> Self { *self }
}
impl wait__bindgen_ty_2 {
    #[inline]
    pub fn __w_stopval(&self) -> ::std::os::raw::c_uint {
        let mut unit_field_val: u32 = unsafe { ::std::mem::uninitialized() };
        unsafe {
            ::std::ptr::copy_nonoverlapping(&self._bitfield_1 as *const _ as
                                                *const u8,
                                            &mut unit_field_val as *mut u32 as
                                                *mut u8,
                                            ::std::mem::size_of::<u32>())
        };
        let mask = 255u64 as u32;
        let val = (unit_field_val & mask) >> 0usize;
        unsafe { ::std::mem::transmute(val as u32) }
    }
    #[inline]
    pub fn set___w_stopval(&mut self, val: ::std::os::raw::c_uint) {
        let mask = 255u64 as u32;
        let val = val as u32 as u32;
        let mut unit_field_val: u32 = unsafe { ::std::mem::uninitialized() };
        unsafe {
            ::std::ptr::copy_nonoverlapping(&self._bitfield_1 as *const _ as
                                                *const u8,
                                            &mut unit_field_val as *mut u32 as
                                                *mut u8,
                                            ::std::mem::size_of::<u32>())
        };
        unit_field_val &= !mask;
        unit_field_val |= (val << 0usize) & mask;
        unsafe {
            ::std::ptr::copy_nonoverlapping(&unit_field_val as *const _ as
                                                *const u8,
                                            &mut self._bitfield_1 as *mut _ as
                                                *mut u8,
                                            ::std::mem::size_of::<u32>());
        }
    }
    #[inline]
    pub fn __w_stopsig(&self) -> ::std::os::raw::c_uint {
        let mut unit_field_val: u32 = unsafe { ::std::mem::uninitialized() };
        unsafe {
            ::std::ptr::copy_nonoverlapping(&self._bitfield_1 as *const _ as
                                                *const u8,
                                            &mut unit_field_val as *mut u32 as
                                                *mut u8,
                                            ::std::mem::size_of::<u32>())
        };
        let mask = 65280u64 as u32;
        let val = (unit_field_val & mask) >> 8usize;
        unsafe { ::std::mem::transmute(val as u32) }
    }
    #[inline]
    pub fn set___w_stopsig(&mut self, val: ::std::os::raw::c_uint) {
        let mask = 65280u64 as u32;
        let val = val as u32 as u32;
        let mut unit_field_val: u32 = unsafe { ::std::mem::uninitialized() };
        unsafe {
            ::std::ptr::copy_nonoverlapping(&self._bitfield_1 as *const _ as
                                                *const u8,
                                            &mut unit_field_val as *mut u32 as
                                                *mut u8,
                                            ::std::mem::size_of::<u32>())
        };
        unit_field_val &= !mask;
        unit_field_val |= (val << 8usize) & mask;
        unsafe {
            ::std::ptr::copy_nonoverlapping(&unit_field_val as *const _ as
                                                *const u8,
                                            &mut self._bitfield_1 as *mut _ as
                                                *mut u8,
                                            ::std::mem::size_of::<u32>());
        }
    }
    #[inline]
    pub fn new_bitfield_1(__w_stopval: ::std::os::raw::c_uint,
                          __w_stopsig: ::std::os::raw::c_uint) -> u32 {
        ({
             ({ 0 } |
                  ((__w_stopval as u32 as u32) << 0usize) & (255u64 as u32))
         } | ((__w_stopsig as u32 as u32) << 8usize) & (65280u64 as u32))
    }
}
#[test]
fn bindgen_test_layout_wait() {
    assert_eq!(::std::mem::size_of::<wait>() , 4usize , concat ! (
               "Size of: " , stringify ! ( wait ) ));
    assert_eq! (::std::mem::align_of::<wait>() , 4usize , concat ! (
                "Alignment of " , stringify ! ( wait ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const wait ) ) . w_status as * const _ as usize
                } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( wait ) , "::" ,
                stringify ! ( w_status ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const wait ) ) . __wait_terminated as * const _
                as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( wait ) , "::" ,
                stringify ! ( __wait_terminated ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const wait ) ) . __wait_stopped as * const _ as
                usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( wait ) , "::" ,
                stringify ! ( __wait_stopped ) ));
}
impl Clone for wait {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct __WAIT_STATUS {
    pub __uptr: __BindgenUnionField<*mut wait>,
    pub __iptr: __BindgenUnionField<*mut ::std::os::raw::c_int>,
    pub bindgen_union_field: u64,
}
#[test]
fn bindgen_test_layout___WAIT_STATUS() {
    assert_eq!(::std::mem::size_of::<__WAIT_STATUS>() , 8usize , concat ! (
               "Size of: " , stringify ! ( __WAIT_STATUS ) ));
    assert_eq! (::std::mem::align_of::<__WAIT_STATUS>() , 8usize , concat ! (
                "Alignment of " , stringify ! ( __WAIT_STATUS ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const __WAIT_STATUS ) ) . __uptr as * const _
                as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( __WAIT_STATUS ) , "::"
                , stringify ! ( __uptr ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const __WAIT_STATUS ) ) . __iptr as * const _
                as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( __WAIT_STATUS ) , "::"
                , stringify ! ( __iptr ) ));
}
impl Clone for __WAIT_STATUS {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct div_t {
    pub quot: ::std::os::raw::c_int,
    pub rem: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_div_t() {
    assert_eq!(::std::mem::size_of::<div_t>() , 8usize , concat ! (
               "Size of: " , stringify ! ( div_t ) ));
    assert_eq! (::std::mem::align_of::<div_t>() , 4usize , concat ! (
                "Alignment of " , stringify ! ( div_t ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const div_t ) ) . quot as * const _ as usize }
                , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( div_t ) , "::" ,
                stringify ! ( quot ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const div_t ) ) . rem as * const _ as usize } ,
                4usize , concat ! (
                "Alignment of field: " , stringify ! ( div_t ) , "::" ,
                stringify ! ( rem ) ));
}
impl Clone for div_t {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct ldiv_t {
    pub quot: ::std::os::raw::c_long,
    pub rem: ::std::os::raw::c_long,
}
#[test]
fn bindgen_test_layout_ldiv_t() {
    assert_eq!(::std::mem::size_of::<ldiv_t>() , 16usize , concat ! (
               "Size of: " , stringify ! ( ldiv_t ) ));
    assert_eq! (::std::mem::align_of::<ldiv_t>() , 8usize , concat ! (
                "Alignment of " , stringify ! ( ldiv_t ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const ldiv_t ) ) . quot as * const _ as usize }
                , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( ldiv_t ) , "::" ,
                stringify ! ( quot ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const ldiv_t ) ) . rem as * const _ as usize }
                , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( ldiv_t ) , "::" ,
                stringify ! ( rem ) ));
}
impl Clone for ldiv_t {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct lldiv_t {
    pub quot: ::std::os::raw::c_longlong,
    pub rem: ::std::os::raw::c_longlong,
}
#[test]
fn bindgen_test_layout_lldiv_t() {
    assert_eq!(::std::mem::size_of::<lldiv_t>() , 16usize , concat ! (
               "Size of: " , stringify ! ( lldiv_t ) ));
    assert_eq! (::std::mem::align_of::<lldiv_t>() , 8usize , concat ! (
                "Alignment of " , stringify ! ( lldiv_t ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const lldiv_t ) ) . quot as * const _ as usize
                } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( lldiv_t ) , "::" ,
                stringify ! ( quot ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const lldiv_t ) ) . rem as * const _ as usize }
                , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( lldiv_t ) , "::" ,
                stringify ! ( rem ) ));
}
impl Clone for lldiv_t {
    fn clone(&self) -> Self { *self }
}
extern "C" {
    pub fn __ctype_get_mb_cur_max() -> usize;
}
extern "C" {
    pub fn atof(__nptr: *const ::std::os::raw::c_char) -> f64;
}
extern "C" {
    pub fn atoi(__nptr: *const ::std::os::raw::c_char)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn atol(__nptr: *const ::std::os::raw::c_char)
     -> ::std::os::raw::c_long;
}
extern "C" {
    pub fn atoll(__nptr: *const ::std::os::raw::c_char)
     -> ::std::os::raw::c_longlong;
}
extern "C" {
    pub fn strtod(__nptr: *const ::std::os::raw::c_char,
                  __endptr: *mut *mut ::std::os::raw::c_char) -> f64;
}
extern "C" {
    pub fn strtof(__nptr: *const ::std::os::raw::c_char,
                  __endptr: *mut *mut ::std::os::raw::c_char) -> f32;
}
extern "C" {
    pub fn strtold(__nptr: *const ::std::os::raw::c_char,
                   __endptr: *mut *mut ::std::os::raw::c_char) -> f64;
}
extern "C" {
    pub fn strtol(__nptr: *const ::std::os::raw::c_char,
                  __endptr: *mut *mut ::std::os::raw::c_char,
                  __base: ::std::os::raw::c_int) -> ::std::os::raw::c_long;
}
extern "C" {
    pub fn strtoul(__nptr: *const ::std::os::raw::c_char,
                   __endptr: *mut *mut ::std::os::raw::c_char,
                   __base: ::std::os::raw::c_int) -> ::std::os::raw::c_ulong;
}
extern "C" {
    pub fn strtoq(__nptr: *const ::std::os::raw::c_char,
                  __endptr: *mut *mut ::std::os::raw::c_char,
                  __base: ::std::os::raw::c_int)
     -> ::std::os::raw::c_longlong;
}
extern "C" {
    pub fn strtouq(__nptr: *const ::std::os::raw::c_char,
                   __endptr: *mut *mut ::std::os::raw::c_char,
                   __base: ::std::os::raw::c_int)
     -> ::std::os::raw::c_ulonglong;
}
extern "C" {
    pub fn strtoll(__nptr: *const ::std::os::raw::c_char,
                   __endptr: *mut *mut ::std::os::raw::c_char,
                   __base: ::std::os::raw::c_int)
     -> ::std::os::raw::c_longlong;
}
extern "C" {
    pub fn strtoull(__nptr: *const ::std::os::raw::c_char,
                    __endptr: *mut *mut ::std::os::raw::c_char,
                    __base: ::std::os::raw::c_int)
     -> ::std::os::raw::c_ulonglong;
}
extern "C" {
    pub fn l64a(__n: ::std::os::raw::c_long) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn a64l(__s: *const ::std::os::raw::c_char) -> ::std::os::raw::c_long;
}
pub type u_char = __u_char;
pub type u_short = __u_short;
pub type u_int = __u_int;
pub type u_long = __u_long;
pub type quad_t = __quad_t;
pub type u_quad_t = __u_quad_t;
pub type fsid_t = __fsid_t;
pub type loff_t = __loff_t;
pub type ino_t = __ino_t;
pub type dev_t = __dev_t;
pub type gid_t = __gid_t;
pub type mode_t = __mode_t;
pub type nlink_t = __nlink_t;
pub type uid_t = __uid_t;
pub type pid_t = __pid_t;
pub type id_t = __id_t;
pub type daddr_t = __daddr_t;
pub type caddr_t = __caddr_t;
pub type key_t = __key_t;
pub type clock_t = __clock_t;
pub type time_t = __time_t;
pub type clockid_t = __clockid_t;
pub type timer_t = __timer_t;
pub type ulong = ::std::os::raw::c_ulong;
pub type ushort = ::std::os::raw::c_ushort;
pub type uint = ::std::os::raw::c_uint;
pub type u_int8_t = ::std::os::raw::c_uchar;
pub type u_int16_t = ::std::os::raw::c_ushort;
pub type u_int32_t = ::std::os::raw::c_uint;
pub type u_int64_t = ::std::os::raw::c_ulong;
pub type register_t = ::std::os::raw::c_long;
pub type __sig_atomic_t = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Debug, Copy)]
pub struct __sigset_t {
    pub __val: [::std::os::raw::c_ulong; 16usize],
}
#[test]
fn bindgen_test_layout___sigset_t() {
    assert_eq!(::std::mem::size_of::<__sigset_t>() , 128usize , concat ! (
               "Size of: " , stringify ! ( __sigset_t ) ));
    assert_eq! (::std::mem::align_of::<__sigset_t>() , 8usize , concat ! (
                "Alignment of " , stringify ! ( __sigset_t ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const __sigset_t ) ) . __val as * const _ as
                usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( __sigset_t ) , "::" ,
                stringify ! ( __val ) ));
}
impl Clone for __sigset_t {
    fn clone(&self) -> Self { *self }
}
pub type sigset_t = __sigset_t;
#[repr(C)]
#[derive(Debug, Copy)]
pub struct timespec {
    pub tv_sec: __time_t,
    pub tv_nsec: __syscall_slong_t,
}
#[test]
fn bindgen_test_layout_timespec() {
    assert_eq!(::std::mem::size_of::<timespec>() , 16usize , concat ! (
               "Size of: " , stringify ! ( timespec ) ));
    assert_eq! (::std::mem::align_of::<timespec>() , 8usize , concat ! (
                "Alignment of " , stringify ! ( timespec ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const timespec ) ) . tv_sec as * const _ as
                usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( timespec ) , "::" ,
                stringify ! ( tv_sec ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const timespec ) ) . tv_nsec as * const _ as
                usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( timespec ) , "::" ,
                stringify ! ( tv_nsec ) ));
}
impl Clone for timespec {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct timeval {
    pub tv_sec: __time_t,
    pub tv_usec: __suseconds_t,
}
#[test]
fn bindgen_test_layout_timeval() {
    assert_eq!(::std::mem::size_of::<timeval>() , 16usize , concat ! (
               "Size of: " , stringify ! ( timeval ) ));
    assert_eq! (::std::mem::align_of::<timeval>() , 8usize , concat ! (
                "Alignment of " , stringify ! ( timeval ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const timeval ) ) . tv_sec as * const _ as
                usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( timeval ) , "::" ,
                stringify ! ( tv_sec ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const timeval ) ) . tv_usec as * const _ as
                usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( timeval ) , "::" ,
                stringify ! ( tv_usec ) ));
}
impl Clone for timeval {
    fn clone(&self) -> Self { *self }
}
pub type suseconds_t = __suseconds_t;
pub type __fd_mask = ::std::os::raw::c_long;
#[repr(C)]
#[derive(Debug, Copy)]
pub struct fd_set {
    pub __fds_bits: [__fd_mask; 16usize],
}
#[test]
fn bindgen_test_layout_fd_set() {
    assert_eq!(::std::mem::size_of::<fd_set>() , 128usize , concat ! (
               "Size of: " , stringify ! ( fd_set ) ));
    assert_eq! (::std::mem::align_of::<fd_set>() , 8usize , concat ! (
                "Alignment of " , stringify ! ( fd_set ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const fd_set ) ) . __fds_bits as * const _ as
                usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( fd_set ) , "::" ,
                stringify ! ( __fds_bits ) ));
}
impl Clone for fd_set {
    fn clone(&self) -> Self { *self }
}
pub type fd_mask = __fd_mask;
extern "C" {
    pub fn select(__nfds: ::std::os::raw::c_int, __readfds: *mut fd_set,
                  __writefds: *mut fd_set, __exceptfds: *mut fd_set,
                  __timeout: *mut timeval) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn pselect(__nfds: ::std::os::raw::c_int, __readfds: *mut fd_set,
                   __writefds: *mut fd_set, __exceptfds: *mut fd_set,
                   __timeout: *const timespec, __sigmask: *const __sigset_t)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gnu_dev_major(__dev: ::std::os::raw::c_ulonglong)
     -> ::std::os::raw::c_uint;
}
extern "C" {
    pub fn gnu_dev_minor(__dev: ::std::os::raw::c_ulonglong)
     -> ::std::os::raw::c_uint;
}
extern "C" {
    pub fn gnu_dev_makedev(__major: ::std::os::raw::c_uint,
                           __minor: ::std::os::raw::c_uint)
     -> ::std::os::raw::c_ulonglong;
}
pub type blksize_t = __blksize_t;
pub type blkcnt_t = __blkcnt_t;
pub type fsblkcnt_t = __fsblkcnt_t;
pub type fsfilcnt_t = __fsfilcnt_t;
pub type pthread_t = ::std::os::raw::c_ulong;
#[repr(C)]
#[derive(Debug, Copy)]
pub struct pthread_attr_t {
    pub __size: __BindgenUnionField<[::std::os::raw::c_char; 56usize]>,
    pub __align: __BindgenUnionField<::std::os::raw::c_long>,
    pub bindgen_union_field: [u64; 7usize],
}
#[test]
fn bindgen_test_layout_pthread_attr_t() {
    assert_eq!(::std::mem::size_of::<pthread_attr_t>() , 56usize , concat ! (
               "Size of: " , stringify ! ( pthread_attr_t ) ));
    assert_eq! (::std::mem::align_of::<pthread_attr_t>() , 8usize , concat ! (
                "Alignment of " , stringify ! ( pthread_attr_t ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const pthread_attr_t ) ) . __size as * const _
                as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( pthread_attr_t ) , "::"
                , stringify ! ( __size ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const pthread_attr_t ) ) . __align as * const _
                as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( pthread_attr_t ) , "::"
                , stringify ! ( __align ) ));
}
impl Clone for pthread_attr_t {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct __pthread_internal_list {
    pub __prev: *mut __pthread_internal_list,
    pub __next: *mut __pthread_internal_list,
}
#[test]
fn bindgen_test_layout___pthread_internal_list() {
    assert_eq!(::std::mem::size_of::<__pthread_internal_list>() , 16usize ,
               concat ! (
               "Size of: " , stringify ! ( __pthread_internal_list ) ));
    assert_eq! (::std::mem::align_of::<__pthread_internal_list>() , 8usize ,
                concat ! (
                "Alignment of " , stringify ! ( __pthread_internal_list ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const __pthread_internal_list ) ) . __prev as *
                const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( __pthread_internal_list
                ) , "::" , stringify ! ( __prev ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const __pthread_internal_list ) ) . __next as *
                const _ as usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( __pthread_internal_list
                ) , "::" , stringify ! ( __next ) ));
}
impl Clone for __pthread_internal_list {
    fn clone(&self) -> Self { *self }
}
pub type __pthread_list_t = __pthread_internal_list;
#[repr(C)]
#[derive(Debug, Copy)]
pub struct pthread_mutex_t {
    pub __data: __BindgenUnionField<pthread_mutex_t___pthread_mutex_s>,
    pub __size: __BindgenUnionField<[::std::os::raw::c_char; 40usize]>,
    pub __align: __BindgenUnionField<::std::os::raw::c_long>,
    pub bindgen_union_field: [u64; 5usize],
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct pthread_mutex_t___pthread_mutex_s {
    pub __lock: ::std::os::raw::c_int,
    pub __count: ::std::os::raw::c_uint,
    pub __owner: ::std::os::raw::c_int,
    pub __nusers: ::std::os::raw::c_uint,
    pub __kind: ::std::os::raw::c_int,
    pub __spins: ::std::os::raw::c_short,
    pub __elision: ::std::os::raw::c_short,
    pub __list: __pthread_list_t,
}
#[test]
fn bindgen_test_layout_pthread_mutex_t___pthread_mutex_s() {
    assert_eq!(::std::mem::size_of::<pthread_mutex_t___pthread_mutex_s>() ,
               40usize , concat ! (
               "Size of: " , stringify ! ( pthread_mutex_t___pthread_mutex_s )
               ));
    assert_eq! (::std::mem::align_of::<pthread_mutex_t___pthread_mutex_s>() ,
                8usize , concat ! (
                "Alignment of " , stringify ! (
                pthread_mutex_t___pthread_mutex_s ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const pthread_mutex_t___pthread_mutex_s ) ) .
                __lock as * const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! (
                pthread_mutex_t___pthread_mutex_s ) , "::" , stringify ! (
                __lock ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const pthread_mutex_t___pthread_mutex_s ) ) .
                __count as * const _ as usize } , 4usize , concat ! (
                "Alignment of field: " , stringify ! (
                pthread_mutex_t___pthread_mutex_s ) , "::" , stringify ! (
                __count ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const pthread_mutex_t___pthread_mutex_s ) ) .
                __owner as * const _ as usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! (
                pthread_mutex_t___pthread_mutex_s ) , "::" , stringify ! (
                __owner ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const pthread_mutex_t___pthread_mutex_s ) ) .
                __nusers as * const _ as usize } , 12usize , concat ! (
                "Alignment of field: " , stringify ! (
                pthread_mutex_t___pthread_mutex_s ) , "::" , stringify ! (
                __nusers ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const pthread_mutex_t___pthread_mutex_s ) ) .
                __kind as * const _ as usize } , 16usize , concat ! (
                "Alignment of field: " , stringify ! (
                pthread_mutex_t___pthread_mutex_s ) , "::" , stringify ! (
                __kind ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const pthread_mutex_t___pthread_mutex_s ) ) .
                __spins as * const _ as usize } , 20usize , concat ! (
                "Alignment of field: " , stringify ! (
                pthread_mutex_t___pthread_mutex_s ) , "::" , stringify ! (
                __spins ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const pthread_mutex_t___pthread_mutex_s ) ) .
                __elision as * const _ as usize } , 22usize , concat ! (
                "Alignment of field: " , stringify ! (
                pthread_mutex_t___pthread_mutex_s ) , "::" , stringify ! (
                __elision ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const pthread_mutex_t___pthread_mutex_s ) ) .
                __list as * const _ as usize } , 24usize , concat ! (
                "Alignment of field: " , stringify ! (
                pthread_mutex_t___pthread_mutex_s ) , "::" , stringify ! (
                __list ) ));
}
impl Clone for pthread_mutex_t___pthread_mutex_s {
    fn clone(&self) -> Self { *self }
}
#[test]
fn bindgen_test_layout_pthread_mutex_t() {
    assert_eq!(::std::mem::size_of::<pthread_mutex_t>() , 40usize , concat ! (
               "Size of: " , stringify ! ( pthread_mutex_t ) ));
    assert_eq! (::std::mem::align_of::<pthread_mutex_t>() , 8usize , concat !
                ( "Alignment of " , stringify ! ( pthread_mutex_t ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const pthread_mutex_t ) ) . __data as * const _
                as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( pthread_mutex_t ) ,
                "::" , stringify ! ( __data ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const pthread_mutex_t ) ) . __size as * const _
                as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( pthread_mutex_t ) ,
                "::" , stringify ! ( __size ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const pthread_mutex_t ) ) . __align as * const
                _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( pthread_mutex_t ) ,
                "::" , stringify ! ( __align ) ));
}
impl Clone for pthread_mutex_t {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct pthread_mutexattr_t {
    pub __size: __BindgenUnionField<[::std::os::raw::c_char; 4usize]>,
    pub __align: __BindgenUnionField<::std::os::raw::c_int>,
    pub bindgen_union_field: u32,
}
#[test]
fn bindgen_test_layout_pthread_mutexattr_t() {
    assert_eq!(::std::mem::size_of::<pthread_mutexattr_t>() , 4usize , concat
               ! ( "Size of: " , stringify ! ( pthread_mutexattr_t ) ));
    assert_eq! (::std::mem::align_of::<pthread_mutexattr_t>() , 4usize ,
                concat ! (
                "Alignment of " , stringify ! ( pthread_mutexattr_t ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const pthread_mutexattr_t ) ) . __size as *
                const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( pthread_mutexattr_t ) ,
                "::" , stringify ! ( __size ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const pthread_mutexattr_t ) ) . __align as *
                const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( pthread_mutexattr_t ) ,
                "::" , stringify ! ( __align ) ));
}
impl Clone for pthread_mutexattr_t {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct pthread_cond_t {
    pub __data: __BindgenUnionField<pthread_cond_t__bindgen_ty_1>,
    pub __size: __BindgenUnionField<[::std::os::raw::c_char; 48usize]>,
    pub __align: __BindgenUnionField<::std::os::raw::c_longlong>,
    pub bindgen_union_field: [u64; 6usize],
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct pthread_cond_t__bindgen_ty_1 {
    pub __lock: ::std::os::raw::c_int,
    pub __futex: ::std::os::raw::c_uint,
    pub __total_seq: ::std::os::raw::c_ulonglong,
    pub __wakeup_seq: ::std::os::raw::c_ulonglong,
    pub __woken_seq: ::std::os::raw::c_ulonglong,
    pub __mutex: *mut ::std::os::raw::c_void,
    pub __nwaiters: ::std::os::raw::c_uint,
    pub __broadcast_seq: ::std::os::raw::c_uint,
}
#[test]
fn bindgen_test_layout_pthread_cond_t__bindgen_ty_1() {
    assert_eq!(::std::mem::size_of::<pthread_cond_t__bindgen_ty_1>() , 48usize
               , concat ! (
               "Size of: " , stringify ! ( pthread_cond_t__bindgen_ty_1 ) ));
    assert_eq! (::std::mem::align_of::<pthread_cond_t__bindgen_ty_1>() ,
                8usize , concat ! (
                "Alignment of " , stringify ! ( pthread_cond_t__bindgen_ty_1 )
                ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const pthread_cond_t__bindgen_ty_1 ) ) . __lock
                as * const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! (
                pthread_cond_t__bindgen_ty_1 ) , "::" , stringify ! ( __lock )
                ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const pthread_cond_t__bindgen_ty_1 ) ) .
                __futex as * const _ as usize } , 4usize , concat ! (
                "Alignment of field: " , stringify ! (
                pthread_cond_t__bindgen_ty_1 ) , "::" , stringify ! ( __futex
                ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const pthread_cond_t__bindgen_ty_1 ) ) .
                __total_seq as * const _ as usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! (
                pthread_cond_t__bindgen_ty_1 ) , "::" , stringify ! (
                __total_seq ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const pthread_cond_t__bindgen_ty_1 ) ) .
                __wakeup_seq as * const _ as usize } , 16usize , concat ! (
                "Alignment of field: " , stringify ! (
                pthread_cond_t__bindgen_ty_1 ) , "::" , stringify ! (
                __wakeup_seq ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const pthread_cond_t__bindgen_ty_1 ) ) .
                __woken_seq as * const _ as usize } , 24usize , concat ! (
                "Alignment of field: " , stringify ! (
                pthread_cond_t__bindgen_ty_1 ) , "::" , stringify ! (
                __woken_seq ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const pthread_cond_t__bindgen_ty_1 ) ) .
                __mutex as * const _ as usize } , 32usize , concat ! (
                "Alignment of field: " , stringify ! (
                pthread_cond_t__bindgen_ty_1 ) , "::" , stringify ! ( __mutex
                ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const pthread_cond_t__bindgen_ty_1 ) ) .
                __nwaiters as * const _ as usize } , 40usize , concat ! (
                "Alignment of field: " , stringify ! (
                pthread_cond_t__bindgen_ty_1 ) , "::" , stringify ! (
                __nwaiters ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const pthread_cond_t__bindgen_ty_1 ) ) .
                __broadcast_seq as * const _ as usize } , 44usize , concat ! (
                "Alignment of field: " , stringify ! (
                pthread_cond_t__bindgen_ty_1 ) , "::" , stringify ! (
                __broadcast_seq ) ));
}
impl Clone for pthread_cond_t__bindgen_ty_1 {
    fn clone(&self) -> Self { *self }
}
#[test]
fn bindgen_test_layout_pthread_cond_t() {
    assert_eq!(::std::mem::size_of::<pthread_cond_t>() , 48usize , concat ! (
               "Size of: " , stringify ! ( pthread_cond_t ) ));
    assert_eq! (::std::mem::align_of::<pthread_cond_t>() , 8usize , concat ! (
                "Alignment of " , stringify ! ( pthread_cond_t ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const pthread_cond_t ) ) . __data as * const _
                as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( pthread_cond_t ) , "::"
                , stringify ! ( __data ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const pthread_cond_t ) ) . __size as * const _
                as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( pthread_cond_t ) , "::"
                , stringify ! ( __size ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const pthread_cond_t ) ) . __align as * const _
                as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( pthread_cond_t ) , "::"
                , stringify ! ( __align ) ));
}
impl Clone for pthread_cond_t {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct pthread_condattr_t {
    pub __size: __BindgenUnionField<[::std::os::raw::c_char; 4usize]>,
    pub __align: __BindgenUnionField<::std::os::raw::c_int>,
    pub bindgen_union_field: u32,
}
#[test]
fn bindgen_test_layout_pthread_condattr_t() {
    assert_eq!(::std::mem::size_of::<pthread_condattr_t>() , 4usize , concat !
               ( "Size of: " , stringify ! ( pthread_condattr_t ) ));
    assert_eq! (::std::mem::align_of::<pthread_condattr_t>() , 4usize , concat
                ! ( "Alignment of " , stringify ! ( pthread_condattr_t ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const pthread_condattr_t ) ) . __size as *
                const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( pthread_condattr_t ) ,
                "::" , stringify ! ( __size ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const pthread_condattr_t ) ) . __align as *
                const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( pthread_condattr_t ) ,
                "::" , stringify ! ( __align ) ));
}
impl Clone for pthread_condattr_t {
    fn clone(&self) -> Self { *self }
}
pub type pthread_key_t = ::std::os::raw::c_uint;
pub type pthread_once_t = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Debug, Copy)]
pub struct pthread_rwlock_t {
    pub __data: __BindgenUnionField<pthread_rwlock_t__bindgen_ty_1>,
    pub __size: __BindgenUnionField<[::std::os::raw::c_char; 56usize]>,
    pub __align: __BindgenUnionField<::std::os::raw::c_long>,
    pub bindgen_union_field: [u64; 7usize],
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct pthread_rwlock_t__bindgen_ty_1 {
    pub __lock: ::std::os::raw::c_int,
    pub __nr_readers: ::std::os::raw::c_uint,
    pub __readers_wakeup: ::std::os::raw::c_uint,
    pub __writer_wakeup: ::std::os::raw::c_uint,
    pub __nr_readers_queued: ::std::os::raw::c_uint,
    pub __nr_writers_queued: ::std::os::raw::c_uint,
    pub __writer: ::std::os::raw::c_int,
    pub __shared: ::std::os::raw::c_int,
    pub __rwelision: ::std::os::raw::c_schar,
    pub __pad1: [::std::os::raw::c_uchar; 7usize],
    pub __pad2: ::std::os::raw::c_ulong,
    pub __flags: ::std::os::raw::c_uint,
}
#[test]
fn bindgen_test_layout_pthread_rwlock_t__bindgen_ty_1() {
    assert_eq!(::std::mem::size_of::<pthread_rwlock_t__bindgen_ty_1>() ,
               56usize , concat ! (
               "Size of: " , stringify ! ( pthread_rwlock_t__bindgen_ty_1 )
               ));
    assert_eq! (::std::mem::align_of::<pthread_rwlock_t__bindgen_ty_1>() ,
                8usize , concat ! (
                "Alignment of " , stringify ! ( pthread_rwlock_t__bindgen_ty_1
                ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const pthread_rwlock_t__bindgen_ty_1 ) ) .
                __lock as * const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! (
                pthread_rwlock_t__bindgen_ty_1 ) , "::" , stringify ! ( __lock
                ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const pthread_rwlock_t__bindgen_ty_1 ) ) .
                __nr_readers as * const _ as usize } , 4usize , concat ! (
                "Alignment of field: " , stringify ! (
                pthread_rwlock_t__bindgen_ty_1 ) , "::" , stringify ! (
                __nr_readers ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const pthread_rwlock_t__bindgen_ty_1 ) ) .
                __readers_wakeup as * const _ as usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! (
                pthread_rwlock_t__bindgen_ty_1 ) , "::" , stringify ! (
                __readers_wakeup ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const pthread_rwlock_t__bindgen_ty_1 ) ) .
                __writer_wakeup as * const _ as usize } , 12usize , concat ! (
                "Alignment of field: " , stringify ! (
                pthread_rwlock_t__bindgen_ty_1 ) , "::" , stringify ! (
                __writer_wakeup ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const pthread_rwlock_t__bindgen_ty_1 ) ) .
                __nr_readers_queued as * const _ as usize } , 16usize , concat
                ! (
                "Alignment of field: " , stringify ! (
                pthread_rwlock_t__bindgen_ty_1 ) , "::" , stringify ! (
                __nr_readers_queued ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const pthread_rwlock_t__bindgen_ty_1 ) ) .
                __nr_writers_queued as * const _ as usize } , 20usize , concat
                ! (
                "Alignment of field: " , stringify ! (
                pthread_rwlock_t__bindgen_ty_1 ) , "::" , stringify ! (
                __nr_writers_queued ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const pthread_rwlock_t__bindgen_ty_1 ) ) .
                __writer as * const _ as usize } , 24usize , concat ! (
                "Alignment of field: " , stringify ! (
                pthread_rwlock_t__bindgen_ty_1 ) , "::" , stringify ! (
                __writer ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const pthread_rwlock_t__bindgen_ty_1 ) ) .
                __shared as * const _ as usize } , 28usize , concat ! (
                "Alignment of field: " , stringify ! (
                pthread_rwlock_t__bindgen_ty_1 ) , "::" , stringify ! (
                __shared ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const pthread_rwlock_t__bindgen_ty_1 ) ) .
                __rwelision as * const _ as usize } , 32usize , concat ! (
                "Alignment of field: " , stringify ! (
                pthread_rwlock_t__bindgen_ty_1 ) , "::" , stringify ! (
                __rwelision ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const pthread_rwlock_t__bindgen_ty_1 ) ) .
                __pad1 as * const _ as usize } , 33usize , concat ! (
                "Alignment of field: " , stringify ! (
                pthread_rwlock_t__bindgen_ty_1 ) , "::" , stringify ! ( __pad1
                ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const pthread_rwlock_t__bindgen_ty_1 ) ) .
                __pad2 as * const _ as usize } , 40usize , concat ! (
                "Alignment of field: " , stringify ! (
                pthread_rwlock_t__bindgen_ty_1 ) , "::" , stringify ! ( __pad2
                ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const pthread_rwlock_t__bindgen_ty_1 ) ) .
                __flags as * const _ as usize } , 48usize , concat ! (
                "Alignment of field: " , stringify ! (
                pthread_rwlock_t__bindgen_ty_1 ) , "::" , stringify ! (
                __flags ) ));
}
impl Clone for pthread_rwlock_t__bindgen_ty_1 {
    fn clone(&self) -> Self { *self }
}
#[test]
fn bindgen_test_layout_pthread_rwlock_t() {
    assert_eq!(::std::mem::size_of::<pthread_rwlock_t>() , 56usize , concat !
               ( "Size of: " , stringify ! ( pthread_rwlock_t ) ));
    assert_eq! (::std::mem::align_of::<pthread_rwlock_t>() , 8usize , concat !
                ( "Alignment of " , stringify ! ( pthread_rwlock_t ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const pthread_rwlock_t ) ) . __data as * const
                _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( pthread_rwlock_t ) ,
                "::" , stringify ! ( __data ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const pthread_rwlock_t ) ) . __size as * const
                _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( pthread_rwlock_t ) ,
                "::" , stringify ! ( __size ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const pthread_rwlock_t ) ) . __align as * const
                _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( pthread_rwlock_t ) ,
                "::" , stringify ! ( __align ) ));
}
impl Clone for pthread_rwlock_t {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct pthread_rwlockattr_t {
    pub __size: __BindgenUnionField<[::std::os::raw::c_char; 8usize]>,
    pub __align: __BindgenUnionField<::std::os::raw::c_long>,
    pub bindgen_union_field: u64,
}
#[test]
fn bindgen_test_layout_pthread_rwlockattr_t() {
    assert_eq!(::std::mem::size_of::<pthread_rwlockattr_t>() , 8usize , concat
               ! ( "Size of: " , stringify ! ( pthread_rwlockattr_t ) ));
    assert_eq! (::std::mem::align_of::<pthread_rwlockattr_t>() , 8usize ,
                concat ! (
                "Alignment of " , stringify ! ( pthread_rwlockattr_t ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const pthread_rwlockattr_t ) ) . __size as *
                const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( pthread_rwlockattr_t )
                , "::" , stringify ! ( __size ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const pthread_rwlockattr_t ) ) . __align as *
                const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( pthread_rwlockattr_t )
                , "::" , stringify ! ( __align ) ));
}
impl Clone for pthread_rwlockattr_t {
    fn clone(&self) -> Self { *self }
}
pub type pthread_spinlock_t = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Debug, Copy)]
pub struct pthread_barrier_t {
    pub __size: __BindgenUnionField<[::std::os::raw::c_char; 32usize]>,
    pub __align: __BindgenUnionField<::std::os::raw::c_long>,
    pub bindgen_union_field: [u64; 4usize],
}
#[test]
fn bindgen_test_layout_pthread_barrier_t() {
    assert_eq!(::std::mem::size_of::<pthread_barrier_t>() , 32usize , concat !
               ( "Size of: " , stringify ! ( pthread_barrier_t ) ));
    assert_eq! (::std::mem::align_of::<pthread_barrier_t>() , 8usize , concat
                ! ( "Alignment of " , stringify ! ( pthread_barrier_t ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const pthread_barrier_t ) ) . __size as * const
                _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( pthread_barrier_t ) ,
                "::" , stringify ! ( __size ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const pthread_barrier_t ) ) . __align as *
                const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( pthread_barrier_t ) ,
                "::" , stringify ! ( __align ) ));
}
impl Clone for pthread_barrier_t {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct pthread_barrierattr_t {
    pub __size: __BindgenUnionField<[::std::os::raw::c_char; 4usize]>,
    pub __align: __BindgenUnionField<::std::os::raw::c_int>,
    pub bindgen_union_field: u32,
}
#[test]
fn bindgen_test_layout_pthread_barrierattr_t() {
    assert_eq!(::std::mem::size_of::<pthread_barrierattr_t>() , 4usize ,
               concat ! ( "Size of: " , stringify ! ( pthread_barrierattr_t )
               ));
    assert_eq! (::std::mem::align_of::<pthread_barrierattr_t>() , 4usize ,
                concat ! (
                "Alignment of " , stringify ! ( pthread_barrierattr_t ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const pthread_barrierattr_t ) ) . __size as *
                const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( pthread_barrierattr_t )
                , "::" , stringify ! ( __size ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const pthread_barrierattr_t ) ) . __align as *
                const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( pthread_barrierattr_t )
                , "::" , stringify ! ( __align ) ));
}
impl Clone for pthread_barrierattr_t {
    fn clone(&self) -> Self { *self }
}
extern "C" {
    pub fn random() -> ::std::os::raw::c_long;
}
extern "C" {
    pub fn srandom(__seed: ::std::os::raw::c_uint);
}
extern "C" {
    pub fn initstate(__seed: ::std::os::raw::c_uint,
                     __statebuf: *mut ::std::os::raw::c_char,
                     __statelen: usize) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn setstate(__statebuf: *mut ::std::os::raw::c_char)
     -> *mut ::std::os::raw::c_char;
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct random_data {
    pub fptr: *mut i32,
    pub rptr: *mut i32,
    pub state: *mut i32,
    pub rand_type: ::std::os::raw::c_int,
    pub rand_deg: ::std::os::raw::c_int,
    pub rand_sep: ::std::os::raw::c_int,
    pub end_ptr: *mut i32,
}
#[test]
fn bindgen_test_layout_random_data() {
    assert_eq!(::std::mem::size_of::<random_data>() , 48usize , concat ! (
               "Size of: " , stringify ! ( random_data ) ));
    assert_eq! (::std::mem::align_of::<random_data>() , 8usize , concat ! (
                "Alignment of " , stringify ! ( random_data ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const random_data ) ) . fptr as * const _ as
                usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( random_data ) , "::" ,
                stringify ! ( fptr ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const random_data ) ) . rptr as * const _ as
                usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( random_data ) , "::" ,
                stringify ! ( rptr ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const random_data ) ) . state as * const _ as
                usize } , 16usize , concat ! (
                "Alignment of field: " , stringify ! ( random_data ) , "::" ,
                stringify ! ( state ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const random_data ) ) . rand_type as * const _
                as usize } , 24usize , concat ! (
                "Alignment of field: " , stringify ! ( random_data ) , "::" ,
                stringify ! ( rand_type ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const random_data ) ) . rand_deg as * const _
                as usize } , 28usize , concat ! (
                "Alignment of field: " , stringify ! ( random_data ) , "::" ,
                stringify ! ( rand_deg ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const random_data ) ) . rand_sep as * const _
                as usize } , 32usize , concat ! (
                "Alignment of field: " , stringify ! ( random_data ) , "::" ,
                stringify ! ( rand_sep ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const random_data ) ) . end_ptr as * const _ as
                usize } , 40usize , concat ! (
                "Alignment of field: " , stringify ! ( random_data ) , "::" ,
                stringify ! ( end_ptr ) ));
}
impl Clone for random_data {
    fn clone(&self) -> Self { *self }
}
extern "C" {
    pub fn random_r(__buf: *mut random_data, __result: *mut i32)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn srandom_r(__seed: ::std::os::raw::c_uint, __buf: *mut random_data)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn initstate_r(__seed: ::std::os::raw::c_uint,
                       __statebuf: *mut ::std::os::raw::c_char,
                       __statelen: usize, __buf: *mut random_data)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn setstate_r(__statebuf: *mut ::std::os::raw::c_char,
                      __buf: *mut random_data) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn rand() -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn srand(__seed: ::std::os::raw::c_uint);
}
extern "C" {
    pub fn rand_r(__seed: *mut ::std::os::raw::c_uint)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn drand48() -> f64;
}
extern "C" {
    pub fn erand48(__xsubi: *mut ::std::os::raw::c_ushort) -> f64;
}
extern "C" {
    pub fn lrand48() -> ::std::os::raw::c_long;
}
extern "C" {
    pub fn nrand48(__xsubi: *mut ::std::os::raw::c_ushort)
     -> ::std::os::raw::c_long;
}
extern "C" {
    pub fn mrand48() -> ::std::os::raw::c_long;
}
extern "C" {
    pub fn jrand48(__xsubi: *mut ::std::os::raw::c_ushort)
     -> ::std::os::raw::c_long;
}
extern "C" {
    pub fn srand48(__seedval: ::std::os::raw::c_long);
}
extern "C" {
    pub fn seed48(__seed16v: *mut ::std::os::raw::c_ushort)
     -> *mut ::std::os::raw::c_ushort;
}
extern "C" {
    pub fn lcong48(__param: *mut ::std::os::raw::c_ushort);
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct drand48_data {
    pub __x: [::std::os::raw::c_ushort; 3usize],
    pub __old_x: [::std::os::raw::c_ushort; 3usize],
    pub __c: ::std::os::raw::c_ushort,
    pub __init: ::std::os::raw::c_ushort,
    pub __a: ::std::os::raw::c_ulonglong,
}
#[test]
fn bindgen_test_layout_drand48_data() {
    assert_eq!(::std::mem::size_of::<drand48_data>() , 24usize , concat ! (
               "Size of: " , stringify ! ( drand48_data ) ));
    assert_eq! (::std::mem::align_of::<drand48_data>() , 8usize , concat ! (
                "Alignment of " , stringify ! ( drand48_data ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const drand48_data ) ) . __x as * const _ as
                usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( drand48_data ) , "::" ,
                stringify ! ( __x ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const drand48_data ) ) . __old_x as * const _
                as usize } , 6usize , concat ! (
                "Alignment of field: " , stringify ! ( drand48_data ) , "::" ,
                stringify ! ( __old_x ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const drand48_data ) ) . __c as * const _ as
                usize } , 12usize , concat ! (
                "Alignment of field: " , stringify ! ( drand48_data ) , "::" ,
                stringify ! ( __c ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const drand48_data ) ) . __init as * const _ as
                usize } , 14usize , concat ! (
                "Alignment of field: " , stringify ! ( drand48_data ) , "::" ,
                stringify ! ( __init ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const drand48_data ) ) . __a as * const _ as
                usize } , 16usize , concat ! (
                "Alignment of field: " , stringify ! ( drand48_data ) , "::" ,
                stringify ! ( __a ) ));
}
impl Clone for drand48_data {
    fn clone(&self) -> Self { *self }
}
extern "C" {
    pub fn drand48_r(__buffer: *mut drand48_data, __result: *mut f64)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn erand48_r(__xsubi: *mut ::std::os::raw::c_ushort,
                     __buffer: *mut drand48_data, __result: *mut f64)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn lrand48_r(__buffer: *mut drand48_data,
                     __result: *mut ::std::os::raw::c_long)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn nrand48_r(__xsubi: *mut ::std::os::raw::c_ushort,
                     __buffer: *mut drand48_data,
                     __result: *mut ::std::os::raw::c_long)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn mrand48_r(__buffer: *mut drand48_data,
                     __result: *mut ::std::os::raw::c_long)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn jrand48_r(__xsubi: *mut ::std::os::raw::c_ushort,
                     __buffer: *mut drand48_data,
                     __result: *mut ::std::os::raw::c_long)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn srand48_r(__seedval: ::std::os::raw::c_long,
                     __buffer: *mut drand48_data) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn seed48_r(__seed16v: *mut ::std::os::raw::c_ushort,
                    __buffer: *mut drand48_data) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn lcong48_r(__param: *mut ::std::os::raw::c_ushort,
                     __buffer: *mut drand48_data) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn malloc(__size: usize) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn calloc(__nmemb: usize, __size: usize)
     -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn realloc(__ptr: *mut ::std::os::raw::c_void, __size: usize)
     -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn free(__ptr: *mut ::std::os::raw::c_void);
}
extern "C" {
    pub fn cfree(__ptr: *mut ::std::os::raw::c_void);
}
extern "C" {
    pub fn alloca(__size: usize) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn valloc(__size: usize) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn posix_memalign(__memptr: *mut *mut ::std::os::raw::c_void,
                          __alignment: usize, __size: usize)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn aligned_alloc(__alignment: usize, __size: usize)
     -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn abort();
}
extern "C" {
    pub fn atexit(__func: ::std::option::Option<unsafe extern "C" fn()>)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn at_quick_exit(__func:
                             ::std::option::Option<unsafe extern "C" fn()>)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn on_exit(__func:
                       ::std::option::Option<unsafe extern "C" fn(__status:
                                                                      ::std::os::raw::c_int,
                                                                  __arg:
                                                                      *mut ::std::os::raw::c_void)>,
                   __arg: *mut ::std::os::raw::c_void)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn exit(__status: ::std::os::raw::c_int);
}
extern "C" {
    pub fn quick_exit(__status: ::std::os::raw::c_int);
}
extern "C" {
    pub fn _Exit(__status: ::std::os::raw::c_int);
}
extern "C" {
    pub fn getenv(__name: *const ::std::os::raw::c_char)
     -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn putenv(__string: *mut ::std::os::raw::c_char)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn setenv(__name: *const ::std::os::raw::c_char,
                  __value: *const ::std::os::raw::c_char,
                  __replace: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn unsetenv(__name: *const ::std::os::raw::c_char)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn clearenv() -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn mktemp(__template: *mut ::std::os::raw::c_char)
     -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn mkstemp(__template: *mut ::std::os::raw::c_char)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn mkstemps(__template: *mut ::std::os::raw::c_char,
                    __suffixlen: ::std::os::raw::c_int)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn mkdtemp(__template: *mut ::std::os::raw::c_char)
     -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn system(__command: *const ::std::os::raw::c_char)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn realpath(__name: *const ::std::os::raw::c_char,
                    __resolved: *mut ::std::os::raw::c_char)
     -> *mut ::std::os::raw::c_char;
}
pub type __compar_fn_t =
    ::std::option::Option<unsafe extern "C" fn(arg1:
                                                   *const ::std::os::raw::c_void,
                                               arg2:
                                                   *const ::std::os::raw::c_void)
                              -> ::std::os::raw::c_int>;
extern "C" {
    pub fn bsearch(__key: *const ::std::os::raw::c_void,
                   __base: *const ::std::os::raw::c_void, __nmemb: usize,
                   __size: usize, __compar: __compar_fn_t)
     -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn qsort(__base: *mut ::std::os::raw::c_void, __nmemb: usize,
                 __size: usize, __compar: __compar_fn_t);
}
extern "C" {
    pub fn abs(__x: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn labs(__x: ::std::os::raw::c_long) -> ::std::os::raw::c_long;
}
extern "C" {
    pub fn llabs(__x: ::std::os::raw::c_longlong)
     -> ::std::os::raw::c_longlong;
}
extern "C" {
    pub fn div(__numer: ::std::os::raw::c_int, __denom: ::std::os::raw::c_int)
     -> div_t;
}
extern "C" {
    pub fn ldiv(__numer: ::std::os::raw::c_long,
                __denom: ::std::os::raw::c_long) -> ldiv_t;
}
extern "C" {
    pub fn lldiv(__numer: ::std::os::raw::c_longlong,
                 __denom: ::std::os::raw::c_longlong) -> lldiv_t;
}
extern "C" {
    pub fn ecvt(__value: f64, __ndigit: ::std::os::raw::c_int,
                __decpt: *mut ::std::os::raw::c_int,
                __sign: *mut ::std::os::raw::c_int)
     -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn fcvt(__value: f64, __ndigit: ::std::os::raw::c_int,
                __decpt: *mut ::std::os::raw::c_int,
                __sign: *mut ::std::os::raw::c_int)
     -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn gcvt(__value: f64, __ndigit: ::std::os::raw::c_int,
                __buf: *mut ::std::os::raw::c_char)
     -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn qecvt(__value: f64, __ndigit: ::std::os::raw::c_int,
                 __decpt: *mut ::std::os::raw::c_int,
                 __sign: *mut ::std::os::raw::c_int)
     -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn qfcvt(__value: f64, __ndigit: ::std::os::raw::c_int,
                 __decpt: *mut ::std::os::raw::c_int,
                 __sign: *mut ::std::os::raw::c_int)
     -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn qgcvt(__value: f64, __ndigit: ::std::os::raw::c_int,
                 __buf: *mut ::std::os::raw::c_char)
     -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn ecvt_r(__value: f64, __ndigit: ::std::os::raw::c_int,
                  __decpt: *mut ::std::os::raw::c_int,
                  __sign: *mut ::std::os::raw::c_int,
                  __buf: *mut ::std::os::raw::c_char, __len: usize)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fcvt_r(__value: f64, __ndigit: ::std::os::raw::c_int,
                  __decpt: *mut ::std::os::raw::c_int,
                  __sign: *mut ::std::os::raw::c_int,
                  __buf: *mut ::std::os::raw::c_char, __len: usize)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn qecvt_r(__value: f64, __ndigit: ::std::os::raw::c_int,
                   __decpt: *mut ::std::os::raw::c_int,
                   __sign: *mut ::std::os::raw::c_int,
                   __buf: *mut ::std::os::raw::c_char, __len: usize)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn qfcvt_r(__value: f64, __ndigit: ::std::os::raw::c_int,
                   __decpt: *mut ::std::os::raw::c_int,
                   __sign: *mut ::std::os::raw::c_int,
                   __buf: *mut ::std::os::raw::c_char, __len: usize)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn mblen(__s: *const ::std::os::raw::c_char, __n: usize)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn mbtowc(__pwc: *mut wchar_t, __s: *const ::std::os::raw::c_char,
                  __n: usize) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn wctomb(__s: *mut ::std::os::raw::c_char, __wchar: wchar_t)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn mbstowcs(__pwcs: *mut wchar_t, __s: *const ::std::os::raw::c_char,
                    __n: usize) -> usize;
}
extern "C" {
    pub fn wcstombs(__s: *mut ::std::os::raw::c_char, __pwcs: *const wchar_t,
                    __n: usize) -> usize;
}
extern "C" {
    pub fn rpmatch(__response: *const ::std::os::raw::c_char)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn getsubopt(__optionp: *mut *mut ::std::os::raw::c_char,
                     __tokens: *const *const ::std::os::raw::c_char,
                     __valuep: *mut *mut ::std::os::raw::c_char)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn getloadavg(__loadavg: *mut f64, __nelem: ::std::os::raw::c_int)
     -> ::std::os::raw::c_int;
}
#[repr(C)]
pub struct dirent {
    pub d_ino: __ino_t,
    pub d_off: __off_t,
    pub d_reclen: ::std::os::raw::c_ushort,
    pub d_type: ::std::os::raw::c_uchar,
    pub d_name: [::std::os::raw::c_char; 256usize],
}
#[test]
fn bindgen_test_layout_dirent() {
    assert_eq!(::std::mem::size_of::<dirent>() , 280usize , concat ! (
               "Size of: " , stringify ! ( dirent ) ));
    assert_eq! (::std::mem::align_of::<dirent>() , 8usize , concat ! (
                "Alignment of " , stringify ! ( dirent ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const dirent ) ) . d_ino as * const _ as usize
                } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( dirent ) , "::" ,
                stringify ! ( d_ino ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const dirent ) ) . d_off as * const _ as usize
                } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( dirent ) , "::" ,
                stringify ! ( d_off ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const dirent ) ) . d_reclen as * const _ as
                usize } , 16usize , concat ! (
                "Alignment of field: " , stringify ! ( dirent ) , "::" ,
                stringify ! ( d_reclen ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const dirent ) ) . d_type as * const _ as usize
                } , 18usize , concat ! (
                "Alignment of field: " , stringify ! ( dirent ) , "::" ,
                stringify ! ( d_type ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const dirent ) ) . d_name as * const _ as usize
                } , 19usize , concat ! (
                "Alignment of field: " , stringify ! ( dirent ) , "::" ,
                stringify ! ( d_name ) ));
}
pub const DT_UNKNOWN: _bindgen_ty_1 = _bindgen_ty_1::DT_UNKNOWN;
pub const DT_FIFO: _bindgen_ty_1 = _bindgen_ty_1::DT_FIFO;
pub const DT_CHR: _bindgen_ty_1 = _bindgen_ty_1::DT_CHR;
pub const DT_DIR: _bindgen_ty_1 = _bindgen_ty_1::DT_DIR;
pub const DT_BLK: _bindgen_ty_1 = _bindgen_ty_1::DT_BLK;
pub const DT_REG: _bindgen_ty_1 = _bindgen_ty_1::DT_REG;
pub const DT_LNK: _bindgen_ty_1 = _bindgen_ty_1::DT_LNK;
pub const DT_SOCK: _bindgen_ty_1 = _bindgen_ty_1::DT_SOCK;
pub const DT_WHT: _bindgen_ty_1 = _bindgen_ty_1::DT_WHT;
#[repr(u32)]
#[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
pub enum _bindgen_ty_1 {
    DT_UNKNOWN = 0,
    DT_FIFO = 1,
    DT_CHR = 2,
    DT_DIR = 4,
    DT_BLK = 6,
    DT_REG = 8,
    DT_LNK = 10,
    DT_SOCK = 12,
    DT_WHT = 14,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __dirstream {
    _unused: [u8; 0],
}
pub type DIR = __dirstream;
extern "C" {
    pub fn opendir(__name: *const ::std::os::raw::c_char) -> *mut DIR;
}
extern "C" {
    pub fn fdopendir(__fd: ::std::os::raw::c_int) -> *mut DIR;
}
extern "C" {
    pub fn closedir(__dirp: *mut DIR) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn readdir(__dirp: *mut DIR) -> *mut dirent;
}
extern "C" {
    pub fn readdir_r(__dirp: *mut DIR, __entry: *mut dirent,
                     __result: *mut *mut dirent) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn rewinddir(__dirp: *mut DIR);
}
extern "C" {
    pub fn seekdir(__dirp: *mut DIR, __pos: ::std::os::raw::c_long);
}
extern "C" {
    pub fn telldir(__dirp: *mut DIR) -> ::std::os::raw::c_long;
}
extern "C" {
    pub fn dirfd(__dirp: *mut DIR) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn scandir(__dir: *const ::std::os::raw::c_char,
                   __namelist: *mut *mut *mut dirent,
                   __selector:
                       ::std::option::Option<unsafe extern "C" fn(arg1:
                                                                      *const dirent)
                                                 -> ::std::os::raw::c_int>,
                   __cmp:
                       ::std::option::Option<unsafe extern "C" fn(arg1:
                                                                      *mut *const dirent,
                                                                  arg2:
                                                                      *mut *const dirent)
                                                 -> ::std::os::raw::c_int>)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn alphasort(__e1: *mut *const dirent, __e2: *mut *const dirent)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn getdirentries(__fd: ::std::os::raw::c_int,
                         __buf: *mut ::std::os::raw::c_char, __nbytes: usize,
                         __basep: *mut __off_t) -> __ssize_t;
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct stat {
    pub st_dev: __dev_t,
    pub st_ino: __ino_t,
    pub st_nlink: __nlink_t,
    pub st_mode: __mode_t,
    pub st_uid: __uid_t,
    pub st_gid: __gid_t,
    pub __pad0: ::std::os::raw::c_int,
    pub st_rdev: __dev_t,
    pub st_size: __off_t,
    pub st_blksize: __blksize_t,
    pub st_blocks: __blkcnt_t,
    pub st_atim: timespec,
    pub st_mtim: timespec,
    pub st_ctim: timespec,
    pub __glibc_reserved: [__syscall_slong_t; 3usize],
}
#[test]
fn bindgen_test_layout_stat() {
    assert_eq!(::std::mem::size_of::<stat>() , 144usize , concat ! (
               "Size of: " , stringify ! ( stat ) ));
    assert_eq! (::std::mem::align_of::<stat>() , 8usize , concat ! (
                "Alignment of " , stringify ! ( stat ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const stat ) ) . st_dev as * const _ as usize }
                , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( stat ) , "::" ,
                stringify ! ( st_dev ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const stat ) ) . st_ino as * const _ as usize }
                , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( stat ) , "::" ,
                stringify ! ( st_ino ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const stat ) ) . st_nlink as * const _ as usize
                } , 16usize , concat ! (
                "Alignment of field: " , stringify ! ( stat ) , "::" ,
                stringify ! ( st_nlink ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const stat ) ) . st_mode as * const _ as usize
                } , 24usize , concat ! (
                "Alignment of field: " , stringify ! ( stat ) , "::" ,
                stringify ! ( st_mode ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const stat ) ) . st_uid as * const _ as usize }
                , 28usize , concat ! (
                "Alignment of field: " , stringify ! ( stat ) , "::" ,
                stringify ! ( st_uid ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const stat ) ) . st_gid as * const _ as usize }
                , 32usize , concat ! (
                "Alignment of field: " , stringify ! ( stat ) , "::" ,
                stringify ! ( st_gid ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const stat ) ) . __pad0 as * const _ as usize }
                , 36usize , concat ! (
                "Alignment of field: " , stringify ! ( stat ) , "::" ,
                stringify ! ( __pad0 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const stat ) ) . st_rdev as * const _ as usize
                } , 40usize , concat ! (
                "Alignment of field: " , stringify ! ( stat ) , "::" ,
                stringify ! ( st_rdev ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const stat ) ) . st_size as * const _ as usize
                } , 48usize , concat ! (
                "Alignment of field: " , stringify ! ( stat ) , "::" ,
                stringify ! ( st_size ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const stat ) ) . st_blksize as * const _ as
                usize } , 56usize , concat ! (
                "Alignment of field: " , stringify ! ( stat ) , "::" ,
                stringify ! ( st_blksize ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const stat ) ) . st_blocks as * const _ as
                usize } , 64usize , concat ! (
                "Alignment of field: " , stringify ! ( stat ) , "::" ,
                stringify ! ( st_blocks ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const stat ) ) . st_atim as * const _ as usize
                } , 72usize , concat ! (
                "Alignment of field: " , stringify ! ( stat ) , "::" ,
                stringify ! ( st_atim ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const stat ) ) . st_mtim as * const _ as usize
                } , 88usize , concat ! (
                "Alignment of field: " , stringify ! ( stat ) , "::" ,
                stringify ! ( st_mtim ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const stat ) ) . st_ctim as * const _ as usize
                } , 104usize , concat ! (
                "Alignment of field: " , stringify ! ( stat ) , "::" ,
                stringify ! ( st_ctim ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const stat ) ) . __glibc_reserved as * const _
                as usize } , 120usize , concat ! (
                "Alignment of field: " , stringify ! ( stat ) , "::" ,
                stringify ! ( __glibc_reserved ) ));
}
impl Clone for stat {
    fn clone(&self) -> Self { *self }
}
extern "C" {
    pub fn stat(__file: *const ::std::os::raw::c_char, __buf: *mut stat)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fstat(__fd: ::std::os::raw::c_int, __buf: *mut stat)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fstatat(__fd: ::std::os::raw::c_int,
                   __file: *const ::std::os::raw::c_char, __buf: *mut stat,
                   __flag: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn lstat(__file: *const ::std::os::raw::c_char, __buf: *mut stat)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn chmod(__file: *const ::std::os::raw::c_char, __mode: __mode_t)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn lchmod(__file: *const ::std::os::raw::c_char, __mode: __mode_t)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fchmod(__fd: ::std::os::raw::c_int, __mode: __mode_t)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fchmodat(__fd: ::std::os::raw::c_int,
                    __file: *const ::std::os::raw::c_char, __mode: __mode_t,
                    __flag: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn umask(__mask: __mode_t) -> __mode_t;
}
extern "C" {
    pub fn mkdir(__path: *const ::std::os::raw::c_char, __mode: __mode_t)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn mkdirat(__fd: ::std::os::raw::c_int,
                   __path: *const ::std::os::raw::c_char, __mode: __mode_t)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn mknod(__path: *const ::std::os::raw::c_char, __mode: __mode_t,
                 __dev: __dev_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn mknodat(__fd: ::std::os::raw::c_int,
                   __path: *const ::std::os::raw::c_char, __mode: __mode_t,
                   __dev: __dev_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn mkfifo(__path: *const ::std::os::raw::c_char, __mode: __mode_t)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn mkfifoat(__fd: ::std::os::raw::c_int,
                    __path: *const ::std::os::raw::c_char, __mode: __mode_t)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn utimensat(__fd: ::std::os::raw::c_int,
                     __path: *const ::std::os::raw::c_char,
                     __times: *const timespec, __flags: ::std::os::raw::c_int)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn futimens(__fd: ::std::os::raw::c_int, __times: *const timespec)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn __fxstat(__ver: ::std::os::raw::c_int,
                    __fildes: ::std::os::raw::c_int, __stat_buf: *mut stat)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn __xstat(__ver: ::std::os::raw::c_int,
                   __filename: *const ::std::os::raw::c_char,
                   __stat_buf: *mut stat) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn __lxstat(__ver: ::std::os::raw::c_int,
                    __filename: *const ::std::os::raw::c_char,
                    __stat_buf: *mut stat) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn __fxstatat(__ver: ::std::os::raw::c_int,
                      __fildes: ::std::os::raw::c_int,
                      __filename: *const ::std::os::raw::c_char,
                      __stat_buf: *mut stat, __flag: ::std::os::raw::c_int)
     -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn __xmknod(__ver: ::std::os::raw::c_int,
                    __path: *const ::std::os::raw::c_char, __mode: __mode_t,
                    __dev: *mut __dev_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn __xmknodat(__ver: ::std::os::raw::c_int,
                      __fd: ::std::os::raw::c_int,
                      __path: *const ::std::os::raw::c_char, __mode: __mode_t,
                      __dev: *mut __dev_t) -> ::std::os::raw::c_int;
}
pub type os_fs_err_name_t = os_err_name_t;
#[repr(C)]
pub struct OS_VolumeInfo_t {
    pub DeviceName: [::std::os::raw::c_char; 32usize],
    pub PhysDevName: [::std::os::raw::c_char; 64usize],
    pub VolumeType: uint32,
    pub VolatileFlag: uint8,
    pub FreeFlag: uint8,
    pub IsMounted: uint8,
    pub VolumeName: [::std::os::raw::c_char; 32usize],
    pub MountPoint: [::std::os::raw::c_char; 64usize],
    pub BlockSize: uint32,
}
#[test]
fn bindgen_test_layout_OS_VolumeInfo_t() {
    assert_eq!(::std::mem::size_of::<OS_VolumeInfo_t>() , 204usize , concat !
               ( "Size of: " , stringify ! ( OS_VolumeInfo_t ) ));
    assert_eq! (::std::mem::align_of::<OS_VolumeInfo_t>() , 4usize , concat !
                ( "Alignment of " , stringify ! ( OS_VolumeInfo_t ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const OS_VolumeInfo_t ) ) . DeviceName as *
                const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( OS_VolumeInfo_t ) ,
                "::" , stringify ! ( DeviceName ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const OS_VolumeInfo_t ) ) . PhysDevName as *
                const _ as usize } , 32usize , concat ! (
                "Alignment of field: " , stringify ! ( OS_VolumeInfo_t ) ,
                "::" , stringify ! ( PhysDevName ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const OS_VolumeInfo_t ) ) . VolumeType as *
                const _ as usize } , 96usize , concat ! (
                "Alignment of field: " , stringify ! ( OS_VolumeInfo_t ) ,
                "::" , stringify ! ( VolumeType ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const OS_VolumeInfo_t ) ) . VolatileFlag as *
                const _ as usize } , 100usize , concat ! (
                "Alignment of field: " , stringify ! ( OS_VolumeInfo_t ) ,
                "::" , stringify ! ( VolatileFlag ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const OS_VolumeInfo_t ) ) . FreeFlag as * const
                _ as usize } , 101usize , concat ! (
                "Alignment of field: " , stringify ! ( OS_VolumeInfo_t ) ,
                "::" , stringify ! ( FreeFlag ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const OS_VolumeInfo_t ) ) . IsMounted as *
                const _ as usize } , 102usize , concat ! (
                "Alignment of field: " , stringify ! ( OS_VolumeInfo_t ) ,
                "::" , stringify ! ( IsMounted ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const OS_VolumeInfo_t ) ) . VolumeName as *
                const _ as usize } , 103usize , concat ! (
                "Alignment of field: " , stringify ! ( OS_VolumeInfo_t ) ,
                "::" , stringify ! ( VolumeName ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const OS_VolumeInfo_t ) ) . MountPoint as *
                const _ as usize } , 135usize , concat ! (
                "Alignment of field: " , stringify ! ( OS_VolumeInfo_t ) ,
                "::" , stringify ! ( MountPoint ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const OS_VolumeInfo_t ) ) . BlockSize as *
                const _ as usize } , 200usize , concat ! (
                "Alignment of field: " , stringify ! ( OS_VolumeInfo_t ) ,
                "::" , stringify ! ( BlockSize ) ));
}
#[repr(C)]
pub struct OS_FDTableEntry {
    pub OSfd: int32,
    pub Path: [::std::os::raw::c_char; 64usize],
    pub User: uint32,
    pub IsValid: uint8,
}
#[test]
fn bindgen_test_layout_OS_FDTableEntry() {
    assert_eq!(::std::mem::size_of::<OS_FDTableEntry>() , 76usize , concat ! (
               "Size of: " , stringify ! ( OS_FDTableEntry ) ));
    assert_eq! (::std::mem::align_of::<OS_FDTableEntry>() , 4usize , concat !
                ( "Alignment of " , stringify ! ( OS_FDTableEntry ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const OS_FDTableEntry ) ) . OSfd as * const _
                as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( OS_FDTableEntry ) ,
                "::" , stringify ! ( OSfd ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const OS_FDTableEntry ) ) . Path as * const _
                as usize } , 4usize , concat ! (
                "Alignment of field: " , stringify ! ( OS_FDTableEntry ) ,
                "::" , stringify ! ( Path ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const OS_FDTableEntry ) ) . User as * const _
                as usize } , 68usize , concat ! (
                "Alignment of field: " , stringify ! ( OS_FDTableEntry ) ,
                "::" , stringify ! ( User ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const OS_FDTableEntry ) ) . IsValid as * const
                _ as usize } , 72usize , concat ! (
                "Alignment of field: " , stringify ! ( OS_FDTableEntry ) ,
                "::" , stringify ! ( IsValid ) ));
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct os_fsinfo_t {
    pub MaxFds: uint32,
    pub FreeFds: uint32,
    pub MaxVolumes: uint32,
    pub FreeVolumes: uint32,
}
#[test]
fn bindgen_test_layout_os_fsinfo_t() {
    assert_eq!(::std::mem::size_of::<os_fsinfo_t>() , 16usize , concat ! (
               "Size of: " , stringify ! ( os_fsinfo_t ) ));
    assert_eq! (::std::mem::align_of::<os_fsinfo_t>() , 4usize , concat ! (
                "Alignment of " , stringify ! ( os_fsinfo_t ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const os_fsinfo_t ) ) . MaxFds as * const _ as
                usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( os_fsinfo_t ) , "::" ,
                stringify ! ( MaxFds ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const os_fsinfo_t ) ) . FreeFds as * const _ as
                usize } , 4usize , concat ! (
                "Alignment of field: " , stringify ! ( os_fsinfo_t ) , "::" ,
                stringify ! ( FreeFds ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const os_fsinfo_t ) ) . MaxVolumes as * const _
                as usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( os_fsinfo_t ) , "::" ,
                stringify ! ( MaxVolumes ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const os_fsinfo_t ) ) . FreeVolumes as * const
                _ as usize } , 12usize , concat ! (
                "Alignment of field: " , stringify ! ( os_fsinfo_t ) , "::" ,
                stringify ! ( FreeVolumes ) ));
}
impl Clone for os_fsinfo_t {
    fn clone(&self) -> Self { *self }
}
pub type os_fstat_t = stat;
pub type os_dirp_t = *mut DIR;
pub type os_dirent_t = dirent;
pub type os_fshealth_t = ::std::os::raw::c_ulong;
extern "C" {
    pub fn OS_FS_Init() -> int32;
}
extern "C" {
    pub fn OS_creat(path: *const ::std::os::raw::c_char, access: int32)
     -> int32;
}
extern "C" {
    pub fn OS_open(path: *const ::std::os::raw::c_char, access: int32,
                   mode: uint32) -> int32;
}
extern "C" {
    pub fn OS_close(filedes: int32) -> int32;
}
extern "C" {
    pub fn OS_read(filedes: int32, buffer: *mut ::std::os::raw::c_void,
                   nbytes: uint32) -> int32;
}
extern "C" {
    pub fn OS_write(filedes: int32, buffer: *mut ::std::os::raw::c_void,
                    nbytes: uint32) -> int32;
}
extern "C" {
    pub fn OS_chmod(path: *const ::std::os::raw::c_char, access: uint32)
     -> int32;
}
extern "C" {
    pub fn OS_stat(path: *const ::std::os::raw::c_char,
                   filestats: *mut os_fstat_t) -> int32;
}
extern "C" {
    pub fn OS_lseek(filedes: int32, offset: int32, whence: uint32) -> int32;
}
extern "C" {
    pub fn OS_remove(path: *const ::std::os::raw::c_char) -> int32;
}
extern "C" {
    pub fn OS_rename(old_filename: *const ::std::os::raw::c_char,
                     new_filename: *const ::std::os::raw::c_char) -> int32;
}
extern "C" {
    pub fn OS_cp(src: *const ::std::os::raw::c_char,
                 dest: *const ::std::os::raw::c_char) -> int32;
}
extern "C" {
    pub fn OS_mv(src: *const ::std::os::raw::c_char,
                 dest: *const ::std::os::raw::c_char) -> int32;
}
extern "C" {
    pub fn OS_FDGetInfo(filedes: int32, fd_prop: *mut OS_FDTableEntry)
     -> int32;
}
extern "C" {
    pub fn OS_FileOpenCheck(Filename: *mut ::std::os::raw::c_char) -> int32;
}
extern "C" {
    pub fn OS_CloseAllFiles() -> int32;
}
extern "C" {
    pub fn OS_CloseFileByName(Filename: *mut ::std::os::raw::c_char) -> int32;
}
extern "C" {
    pub fn OS_mkdir(path: *const ::std::os::raw::c_char, access: uint32)
     -> int32;
}
extern "C" {
    pub fn OS_opendir(path: *const ::std::os::raw::c_char) -> os_dirp_t;
}
extern "C" {
    pub fn OS_closedir(directory: os_dirp_t) -> int32;
}
extern "C" {
    pub fn OS_rewinddir(directory: os_dirp_t);
}
extern "C" {
    pub fn OS_readdir(directory: os_dirp_t) -> *mut os_dirent_t;
}
extern "C" {
    pub fn OS_rmdir(path: *const ::std::os::raw::c_char) -> int32;
}
extern "C" {
    pub fn OS_mkfs(address: *mut ::std::os::raw::c_char,
                   devname: *mut ::std::os::raw::c_char,
                   volname: *mut ::std::os::raw::c_char, blocksize: uint32,
                   numblocks: uint32) -> int32;
}
extern "C" {
    pub fn OS_mount(devname: *const ::std::os::raw::c_char,
                    mountpoint: *mut ::std::os::raw::c_char) -> int32;
}
extern "C" {
    pub fn OS_initfs(address: *mut ::std::os::raw::c_char,
                     devname: *mut ::std::os::raw::c_char,
                     volname: *mut ::std::os::raw::c_char, blocksize: uint32,
                     numblocks: uint32) -> int32;
}
extern "C" {
    pub fn OS_rmfs(devname: *mut ::std::os::raw::c_char) -> int32;
}
extern "C" {
    pub fn OS_unmount(mountpoint: *const ::std::os::raw::c_char) -> int32;
}
extern "C" {
    pub fn OS_fsBlocksFree(name: *const ::std::os::raw::c_char) -> int32;
}
extern "C" {
    pub fn OS_fsBytesFree(name: *const ::std::os::raw::c_char,
                          bytes_free: *mut uint64) -> int32;
}
extern "C" {
    pub fn OS_chkfs(name: *const ::std::os::raw::c_char, repair: boolean)
     -> os_fshealth_t;
}
extern "C" {
    pub fn OS_FS_GetPhysDriveName(PhysDriveName: *mut ::std::os::raw::c_char,
                                  MountPoint: *mut ::std::os::raw::c_char)
     -> int32;
}
extern "C" {
    pub fn OS_TranslatePath(VirtualPath: *const ::std::os::raw::c_char,
                            LocalPath: *mut ::std::os::raw::c_char) -> int32;
}
extern "C" {
    pub fn OS_GetFsInfo(filesys_info: *mut os_fsinfo_t) -> int32;
}
extern "C" {
    pub fn OS_ShellOutputToFile(Cmd: *mut ::std::os::raw::c_char,
                                OS_fd: int32) -> int32;
}
#[repr(u32)]
#[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
pub enum OS_SocketDomain_t {
    OS_SocketDomain_INVALID = 0,
    OS_SocketDomain_INET = 1,
    OS_SocketDomain_INET6 = 2,
    OS_SocketDomain_MAX = 3,
}
#[repr(u32)]
#[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
pub enum OS_SocketType_t {
    OS_SocketType_INVALID = 0,
    OS_SocketType_DATAGRAM = 1,
    OS_SocketType_STREAM = 2,
    OS_SocketType_MAX = 3,
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct OS_SockAddr_t {
    pub ActualLength: uint32,
    pub AddrData: [::std::os::raw::c_char; 32usize],
}
#[test]
fn bindgen_test_layout_OS_SockAddr_t() {
    assert_eq!(::std::mem::size_of::<OS_SockAddr_t>() , 36usize , concat ! (
               "Size of: " , stringify ! ( OS_SockAddr_t ) ));
    assert_eq! (::std::mem::align_of::<OS_SockAddr_t>() , 4usize , concat ! (
                "Alignment of " , stringify ! ( OS_SockAddr_t ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const OS_SockAddr_t ) ) . ActualLength as *
                const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( OS_SockAddr_t ) , "::"
                , stringify ! ( ActualLength ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const OS_SockAddr_t ) ) . AddrData as * const _
                as usize } , 4usize , concat ! (
                "Alignment of field: " , stringify ! ( OS_SockAddr_t ) , "::"
                , stringify ! ( AddrData ) ));
}
impl Clone for OS_SockAddr_t {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct OS_socket_prop_t {
    pub name: [::std::os::raw::c_char; 20usize],
    pub creator: uint32,
}
#[test]
fn bindgen_test_layout_OS_socket_prop_t() {
    assert_eq!(::std::mem::size_of::<OS_socket_prop_t>() , 24usize , concat !
               ( "Size of: " , stringify ! ( OS_socket_prop_t ) ));
    assert_eq! (::std::mem::align_of::<OS_socket_prop_t>() , 4usize , concat !
                ( "Alignment of " , stringify ! ( OS_socket_prop_t ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const OS_socket_prop_t ) ) . name as * const _
                as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( OS_socket_prop_t ) ,
                "::" , stringify ! ( name ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const OS_socket_prop_t ) ) . creator as * const
                _ as usize } , 20usize , concat ! (
                "Alignment of field: " , stringify ! ( OS_socket_prop_t ) ,
                "::" , stringify ! ( creator ) ));
}
impl Clone for OS_socket_prop_t {
    fn clone(&self) -> Self { *self }
}
extern "C" {
    pub fn OS_SocketOpen(sock_id: *mut uint32, Domain: OS_SocketDomain_t,
                         Type: OS_SocketType_t) -> int32;
}
extern "C" {
    pub fn OS_SocketClose(sock_id: uint32) -> int32;
}
extern "C" {
    pub fn OS_SocketBind(sock_id: uint32, Addr: *const OS_SockAddr_t)
     -> int32;
}
extern "C" {
    pub fn OS_SocketConnect(sock_id: uint32, Addr: *const OS_SockAddr_t,
                            timeout: int32) -> int32;
}
extern "C" {
    pub fn OS_SocketAccept(sock_id: uint32, connsock_id: *mut uint32,
                           Addr: *mut OS_SockAddr_t, timeout: int32) -> int32;
}
extern "C" {
    pub fn OS_SocketRecvFrom(sock_id: uint32,
                             buffer: *mut ::std::os::raw::c_void,
                             buflen: uint32, RemoteAddr: *mut OS_SockAddr_t,
                             timeout: int32) -> int32;
}
extern "C" {
    pub fn OS_SocketSendTo(sock_id: uint32,
                           buffer: *const ::std::os::raw::c_void,
                           buflen: uint32, RemoteAddr: *const OS_SockAddr_t)
     -> int32;
}
extern "C" {
    pub fn OS_SocketGetIdByName(sock_id: *mut uint32,
                                sock_name: *const ::std::os::raw::c_char)
     -> int32;
}
extern "C" {
    pub fn OS_SocketGetInfo(sock_id: uint32, sock_prop: *mut OS_socket_prop_t)
     -> int32;
}
extern "C" {
    pub fn OS_SocketAddrInit(Addr: *mut OS_SockAddr_t,
                             Domain: OS_SocketDomain_t) -> int32;
}
extern "C" {
    pub fn OS_SocketAddrToString(buffer: *mut ::std::os::raw::c_char,
                                 buflen: uint32, Addr: *const OS_SockAddr_t)
     -> int32;
}
extern "C" {
    pub fn OS_SocketAddrFromString(Addr: *mut OS_SockAddr_t,
                                   string: *const ::std::os::raw::c_char)
     -> int32;
}
extern "C" {
    pub fn OS_SocketAddrGetPort(PortNum: *mut uint16,
                                Addr: *const OS_SockAddr_t) -> int32;
}
extern "C" {
    pub fn OS_SocketAddrSetPort(Addr: *mut OS_SockAddr_t, PortNum: uint16)
     -> int32;
}
extern "C" {
    pub fn OS_NetworkGetID() -> int32;
}
extern "C" {
    pub fn OS_NetworkGetHostName(host_name: *mut ::std::os::raw::c_char,
                                 name_len: uint32) -> int32;
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct OS_module_address_t {
    pub valid: uint32,
    pub flags: uint32,
    pub code_address: cpuaddr,
    pub code_size: cpuaddr,
    pub data_address: cpuaddr,
    pub data_size: cpuaddr,
    pub bss_address: cpuaddr,
    pub bss_size: cpuaddr,
}
#[test]
fn bindgen_test_layout_OS_module_address_t() {
    assert_eq!(::std::mem::size_of::<OS_module_address_t>() , 56usize , concat
               ! ( "Size of: " , stringify ! ( OS_module_address_t ) ));
    assert_eq! (::std::mem::align_of::<OS_module_address_t>() , 8usize ,
                concat ! (
                "Alignment of " , stringify ! ( OS_module_address_t ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const OS_module_address_t ) ) . valid as *
                const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( OS_module_address_t ) ,
                "::" , stringify ! ( valid ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const OS_module_address_t ) ) . flags as *
                const _ as usize } , 4usize , concat ! (
                "Alignment of field: " , stringify ! ( OS_module_address_t ) ,
                "::" , stringify ! ( flags ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const OS_module_address_t ) ) . code_address as
                * const _ as usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( OS_module_address_t ) ,
                "::" , stringify ! ( code_address ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const OS_module_address_t ) ) . code_size as *
                const _ as usize } , 16usize , concat ! (
                "Alignment of field: " , stringify ! ( OS_module_address_t ) ,
                "::" , stringify ! ( code_size ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const OS_module_address_t ) ) . data_address as
                * const _ as usize } , 24usize , concat ! (
                "Alignment of field: " , stringify ! ( OS_module_address_t ) ,
                "::" , stringify ! ( data_address ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const OS_module_address_t ) ) . data_size as *
                const _ as usize } , 32usize , concat ! (
                "Alignment of field: " , stringify ! ( OS_module_address_t ) ,
                "::" , stringify ! ( data_size ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const OS_module_address_t ) ) . bss_address as
                * const _ as usize } , 40usize , concat ! (
                "Alignment of field: " , stringify ! ( OS_module_address_t ) ,
                "::" , stringify ! ( bss_address ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const OS_module_address_t ) ) . bss_size as *
                const _ as usize } , 48usize , concat ! (
                "Alignment of field: " , stringify ! ( OS_module_address_t ) ,
                "::" , stringify ! ( bss_size ) ));
}
impl Clone for OS_module_address_t {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
pub struct OS_module_prop_t {
    pub entry_point: cpuaddr,
    pub host_module_id: uint32,
    pub filename: [::std::os::raw::c_char; 64usize],
    pub name: [::std::os::raw::c_char; 20usize],
    pub addr: OS_module_address_t,
}
#[test]
fn bindgen_test_layout_OS_module_prop_t() {
    assert_eq!(::std::mem::size_of::<OS_module_prop_t>() , 152usize , concat !
               ( "Size of: " , stringify ! ( OS_module_prop_t ) ));
    assert_eq! (::std::mem::align_of::<OS_module_prop_t>() , 8usize , concat !
                ( "Alignment of " , stringify ! ( OS_module_prop_t ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const OS_module_prop_t ) ) . entry_point as *
                const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( OS_module_prop_t ) ,
                "::" , stringify ! ( entry_point ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const OS_module_prop_t ) ) . host_module_id as
                * const _ as usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( OS_module_prop_t ) ,
                "::" , stringify ! ( host_module_id ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const OS_module_prop_t ) ) . filename as *
                const _ as usize } , 12usize , concat ! (
                "Alignment of field: " , stringify ! ( OS_module_prop_t ) ,
                "::" , stringify ! ( filename ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const OS_module_prop_t ) ) . name as * const _
                as usize } , 76usize , concat ! (
                "Alignment of field: " , stringify ! ( OS_module_prop_t ) ,
                "::" , stringify ! ( name ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const OS_module_prop_t ) ) . addr as * const _
                as usize } , 96usize , concat ! (
                "Alignment of field: " , stringify ! ( OS_module_prop_t ) ,
                "::" , stringify ! ( addr ) ));
}
pub type OS_module_record_t = OS_module_prop_t;
extern "C" {
    pub fn OS_ModuleTableInit() -> int32;
}
extern "C" {
    pub fn OS_SymbolLookup(symbol_address: *mut cpuaddr,
                           symbol_name: *const ::std::os::raw::c_char)
     -> int32;
}
extern "C" {
    pub fn OS_SymbolTableDump(filename: *const ::std::os::raw::c_char,
                              size_limit: uint32) -> int32;
}
extern "C" {
    pub fn OS_ModuleLoad(module_id: *mut uint32,
                         module_name: *const ::std::os::raw::c_char,
                         filename: *const ::std::os::raw::c_char) -> int32;
}
extern "C" {
    pub fn OS_ModuleUnload(module_id: uint32) -> int32;
}
extern "C" {
    pub fn OS_ModuleInfo(module_id: uint32,
                         module_info: *mut OS_module_prop_t) -> int32;
}
pub type OS_TimerCallback_t =
    ::std::option::Option<unsafe extern "C" fn(timer_id: uint32)>;
pub type OS_TimerSync_t =
    ::std::option::Option<unsafe extern "C" fn(timer_id: uint32) -> int32>;
#[repr(C)]
#[derive(Debug, Copy)]
pub struct OS_timer_prop_t {
    pub name: [::std::os::raw::c_char; 20usize],
    pub creator: uint32,
    pub start_time: uint32,
    pub interval_time: uint32,
    pub accuracy: uint32,
}
#[test]
fn bindgen_test_layout_OS_timer_prop_t() {
    assert_eq!(::std::mem::size_of::<OS_timer_prop_t>() , 36usize , concat ! (
               "Size of: " , stringify ! ( OS_timer_prop_t ) ));
    assert_eq! (::std::mem::align_of::<OS_timer_prop_t>() , 4usize , concat !
                ( "Alignment of " , stringify ! ( OS_timer_prop_t ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const OS_timer_prop_t ) ) . name as * const _
                as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( OS_timer_prop_t ) ,
                "::" , stringify ! ( name ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const OS_timer_prop_t ) ) . creator as * const
                _ as usize } , 20usize , concat ! (
                "Alignment of field: " , stringify ! ( OS_timer_prop_t ) ,
                "::" , stringify ! ( creator ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const OS_timer_prop_t ) ) . start_time as *
                const _ as usize } , 24usize , concat ! (
                "Alignment of field: " , stringify ! ( OS_timer_prop_t ) ,
                "::" , stringify ! ( start_time ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const OS_timer_prop_t ) ) . interval_time as *
                const _ as usize } , 28usize , concat ! (
                "Alignment of field: " , stringify ! ( OS_timer_prop_t ) ,
                "::" , stringify ! ( interval_time ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const OS_timer_prop_t ) ) . accuracy as * const
                _ as usize } , 32usize , concat ! (
                "Alignment of field: " , stringify ! ( OS_timer_prop_t ) ,
                "::" , stringify ! ( accuracy ) ));
}
impl Clone for OS_timer_prop_t {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct OS_timebase_prop_t {
    pub name: [::std::os::raw::c_char; 20usize],
    pub creator: uint32,
    pub interval_time: uint32,
    pub accuracy: uint32,
}
#[test]
fn bindgen_test_layout_OS_timebase_prop_t() {
    assert_eq!(::std::mem::size_of::<OS_timebase_prop_t>() , 32usize , concat
               ! ( "Size of: " , stringify ! ( OS_timebase_prop_t ) ));
    assert_eq! (::std::mem::align_of::<OS_timebase_prop_t>() , 4usize , concat
                ! ( "Alignment of " , stringify ! ( OS_timebase_prop_t ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const OS_timebase_prop_t ) ) . name as * const
                _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( OS_timebase_prop_t ) ,
                "::" , stringify ! ( name ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const OS_timebase_prop_t ) ) . creator as *
                const _ as usize } , 20usize , concat ! (
                "Alignment of field: " , stringify ! ( OS_timebase_prop_t ) ,
                "::" , stringify ! ( creator ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const OS_timebase_prop_t ) ) . interval_time as
                * const _ as usize } , 24usize , concat ! (
                "Alignment of field: " , stringify ! ( OS_timebase_prop_t ) ,
                "::" , stringify ! ( interval_time ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const OS_timebase_prop_t ) ) . accuracy as *
                const _ as usize } , 28usize , concat ! (
                "Alignment of field: " , stringify ! ( OS_timebase_prop_t ) ,
                "::" , stringify ! ( accuracy ) ));
}
impl Clone for OS_timebase_prop_t {
    fn clone(&self) -> Self { *self }
}
extern "C" {
    pub fn OS_TimerAPIInit() -> int32;
}
extern "C" {
    pub fn OS_TimeBaseCreate(timer_id: *mut uint32,
                             timebase_name: *const ::std::os::raw::c_char,
                             external_sync: OS_TimerSync_t) -> int32;
}
extern "C" {
    pub fn OS_TimeBaseSet(timer_id: uint32, start_time: uint32,
                          interval_time: uint32) -> int32;
}
extern "C" {
    pub fn OS_TimeBaseDelete(timer_id: uint32) -> int32;
}
extern "C" {
    pub fn OS_TimeBaseGetIdByName(timer_id: *mut uint32,
                                  timebase_name:
                                      *const ::std::os::raw::c_char) -> int32;
}
extern "C" {
    pub fn OS_TimerCreate(timer_id: *mut uint32,
                          timer_name: *const ::std::os::raw::c_char,
                          clock_accuracy: *mut uint32,
                          callback_ptr: OS_TimerCallback_t) -> int32;
}
extern "C" {
    pub fn OS_TimerAdd(timer_id: *mut uint32,
                       timer_name: *const ::std::os::raw::c_char,
                       timebase_id: uint32, callback_ptr: OS_ArgCallback_t,
                       callback_arg: *mut ::std::os::raw::c_void) -> int32;
}
extern "C" {
    pub fn OS_TimerSet(timer_id: uint32, start_time: uint32,
                       interval_time: uint32) -> int32;
}
extern "C" {
    pub fn OS_TimerDelete(timer_id: uint32) -> int32;
}
extern "C" {
    pub fn OS_TimerGetIdByName(timer_id: *mut uint32,
                               timer_name: *const ::std::os::raw::c_char)
     -> int32;
}
extern "C" {
    pub fn OS_TimerGetInfo(timer_id: uint32, timer_prop: *mut OS_timer_prop_t)
     -> int32;
}
/*****************************************************************************/
pub type CFE_ES_MemHandle_t = cpuaddr;
#[repr(C)]
pub struct CFE_ES_AppInfo_t {
    /**< \cfetlmmnemonic \ES_APP_ID
                                                 \brief Application ID for this Application */
    pub AppId: uint32,
    /**< \cfetlmmnemonic \ES_APPTYPE
                                                 \brief The type of App: CORE or EXTERNAL */
    pub Type: uint32,
    /**< \cfetlmmnemonic \ES_APPNAME
                                                 \brief The Registered Name of the Application */
    pub Name: [::std::os::raw::c_char; 20usize],
    /**< \cfetlmmnemonic \ES_APPENTRYPT
                                                 \brief The Entry Point label for the Application */
    pub EntryPoint: [::std::os::raw::c_char; 20usize],
    /**< \cfetlmmnemonic \ES_APPFILENAME
                                                 \brief The Filename of the file containing the Application */
    pub FileName: [::std::os::raw::c_char; 64usize],
    /**< \cfetlmmnemonic \ES_STACKSIZE
                                                 \brief The Stack Size of the Application */
    pub StackSize: uint32,
    /**< \cfetlmmnemonic \ES_MODULEID
                                                 \brief The ID of the Loadable Module for the Application */
    pub ModuleId: uint32,
    /**< \cfetlmmnemonic \ES_ADDRVALID
                                                 \brief Indicates that the Code, Data, and BSS addresses/sizes are valid */
    pub AddressesAreValid: uint32,
    /**< \cfetlmmnemonic \ES_CODEADDR
                                                 \brief The Address of the Application Code Segment*/
    pub CodeAddress: uint32,
    /**< \cfetlmmnemonic \ES_CODESIZE
                                                 \brief The Code Size of the Application */
    pub CodeSize: uint32,
    /**< \cfetlmmnemonic \ES_DATAADDR
                                                 \brief The Address of the Application Data Segment*/
    pub DataAddress: uint32,
    /**< \cfetlmmnemonic \ES_DATASIZE
                                                 \brief The Data Size of the Application */
    pub DataSize: uint32,
    /**< \cfetlmmnemonic \ES_BSSADDR
                                                 \brief The Address of the Application BSS Segment*/
    pub BSSAddress: uint32,
    /**< \cfetlmmnemonic \ES_BSSSIZE
                                                  \brief The BSS Size of the Application */
    pub BSSSize: uint32,
    /**< \cfetlmmnemonic \ES_STARTADDR
                                                 \brief The Start Address of the Application */
    pub StartAddress: uint32,
    /**< \cfetlmmnemonic \ES_EXCEPTNACTN
                                                 \brief What should occur if Application has an exception
                                                 (Restart Application OR Restart Processor) */
    pub ExceptionAction: uint16,
    /**< \cfetlmmnemonic \ES_PRIORITY
                                                 \brief The Priority of the Application */
    pub Priority: uint16,
    /**< \cfetlmmnemonic \ES_MAINTASKID
                                                 \brief The Application's Main Task ID */
    pub MainTaskId: uint32,
    /**< \cfetlmmnemonic \ES_MAINTASKEXECNT
                                                 \brief The Application's Main Task Execution Counter */
    pub ExecutionCounter: uint32,
    /**< \cfetlmmnemonic \ES_MAINTASKNAME
                                                 \brief The Application's Main Task ID */
    pub MainTaskName: [::std::os::raw::c_char; 20usize],
    /**< \cfetlmmnemonic \ES_CHILDTASKS
                                                 \brief Number of Child tasks for an App */
    pub NumOfChildTasks: uint32,
}
#[test]
fn bindgen_test_layout_CFE_ES_AppInfo_t() {
    assert_eq!(::std::mem::size_of::<CFE_ES_AppInfo_t>() , 188usize , concat !
               ( "Size of: " , stringify ! ( CFE_ES_AppInfo_t ) ));
    assert_eq! (::std::mem::align_of::<CFE_ES_AppInfo_t>() , 4usize , concat !
                ( "Alignment of " , stringify ! ( CFE_ES_AppInfo_t ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const CFE_ES_AppInfo_t ) ) . AppId as * const _
                as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( CFE_ES_AppInfo_t ) ,
                "::" , stringify ! ( AppId ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const CFE_ES_AppInfo_t ) ) . Type as * const _
                as usize } , 4usize , concat ! (
                "Alignment of field: " , stringify ! ( CFE_ES_AppInfo_t ) ,
                "::" , stringify ! ( Type ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const CFE_ES_AppInfo_t ) ) . Name as * const _
                as usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( CFE_ES_AppInfo_t ) ,
                "::" , stringify ! ( Name ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const CFE_ES_AppInfo_t ) ) . EntryPoint as *
                const _ as usize } , 28usize , concat ! (
                "Alignment of field: " , stringify ! ( CFE_ES_AppInfo_t ) ,
                "::" , stringify ! ( EntryPoint ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const CFE_ES_AppInfo_t ) ) . FileName as *
                const _ as usize } , 48usize , concat ! (
                "Alignment of field: " , stringify ! ( CFE_ES_AppInfo_t ) ,
                "::" , stringify ! ( FileName ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const CFE_ES_AppInfo_t ) ) . StackSize as *
                const _ as usize } , 112usize , concat ! (
                "Alignment of field: " , stringify ! ( CFE_ES_AppInfo_t ) ,
                "::" , stringify ! ( StackSize ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const CFE_ES_AppInfo_t ) ) . ModuleId as *
                const _ as usize } , 116usize , concat ! (
                "Alignment of field: " , stringify ! ( CFE_ES_AppInfo_t ) ,
                "::" , stringify ! ( ModuleId ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const CFE_ES_AppInfo_t ) ) . AddressesAreValid
                as * const _ as usize } , 120usize , concat ! (
                "Alignment of field: " , stringify ! ( CFE_ES_AppInfo_t ) ,
                "::" , stringify ! ( AddressesAreValid ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const CFE_ES_AppInfo_t ) ) . CodeAddress as *
                const _ as usize } , 124usize , concat ! (
                "Alignment of field: " , stringify ! ( CFE_ES_AppInfo_t ) ,
                "::" , stringify ! ( CodeAddress ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const CFE_ES_AppInfo_t ) ) . CodeSize as *
                const _ as usize } , 128usize , concat ! (
                "Alignment of field: " , stringify ! ( CFE_ES_AppInfo_t ) ,
                "::" , stringify ! ( CodeSize ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const CFE_ES_AppInfo_t ) ) . DataAddress as *
                const _ as usize } , 132usize , concat ! (
                "Alignment of field: " , stringify ! ( CFE_ES_AppInfo_t ) ,
                "::" , stringify ! ( DataAddress ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const CFE_ES_AppInfo_t ) ) . DataSize as *
                const _ as usize } , 136usize , concat ! (
                "Alignment of field: " , stringify ! ( CFE_ES_AppInfo_t ) ,
                "::" , stringify ! ( DataSize ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const CFE_ES_AppInfo_t ) ) . BSSAddress as *
                const _ as usize } , 140usize , concat ! (
                "Alignment of field: " , stringify ! ( CFE_ES_AppInfo_t ) ,
                "::" , stringify ! ( BSSAddress ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const CFE_ES_AppInfo_t ) ) . BSSSize as * const
                _ as usize } , 144usize , concat ! (
                "Alignment of field: " , stringify ! ( CFE_ES_AppInfo_t ) ,
                "::" , stringify ! ( BSSSize ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const CFE_ES_AppInfo_t ) ) . StartAddress as *
                const _ as usize } , 148usize , concat ! (
                "Alignment of field: " , stringify ! ( CFE_ES_AppInfo_t ) ,
                "::" , stringify ! ( StartAddress ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const CFE_ES_AppInfo_t ) ) . ExceptionAction as
                * const _ as usize } , 152usize , concat ! (
                "Alignment of field: " , stringify ! ( CFE_ES_AppInfo_t ) ,
                "::" , stringify ! ( ExceptionAction ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const CFE_ES_AppInfo_t ) ) . Priority as *
                const _ as usize } , 154usize , concat ! (
                "Alignment of field: " , stringify ! ( CFE_ES_AppInfo_t ) ,
                "::" , stringify ! ( Priority ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const CFE_ES_AppInfo_t ) ) . MainTaskId as *
                const _ as usize } , 156usize , concat ! (
                "Alignment of field: " , stringify ! ( CFE_ES_AppInfo_t ) ,
                "::" , stringify ! ( MainTaskId ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const CFE_ES_AppInfo_t ) ) . ExecutionCounter
                as * const _ as usize } , 160usize , concat ! (
                "Alignment of field: " , stringify ! ( CFE_ES_AppInfo_t ) ,
                "::" , stringify ! ( ExecutionCounter ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const CFE_ES_AppInfo_t ) ) . MainTaskName as *
                const _ as usize } , 164usize , concat ! (
                "Alignment of field: " , stringify ! ( CFE_ES_AppInfo_t ) ,
                "::" , stringify ! ( MainTaskName ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const CFE_ES_AppInfo_t ) ) . NumOfChildTasks as
                * const _ as usize } , 184usize , concat ! (
                "Alignment of field: " , stringify ! ( CFE_ES_AppInfo_t ) ,
                "::" , stringify ! ( NumOfChildTasks ) ));
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct CFE_ES_TaskInfo_t {
    /**< \brief Task Id */
    pub TaskId: uint32,
    pub ExecutionCounter: uint32,
    /**< \brief Task Name */
    pub TaskName: [uint8; 20usize],
    /**< \brief Parent Application ID */
    pub AppId: uint32,
    /**< \brief Parent Application Name */
    pub AppName: [uint8; 20usize],
}
#[test]
fn bindgen_test_layout_CFE_ES_TaskInfo_t() {
    assert_eq!(::std::mem::size_of::<CFE_ES_TaskInfo_t>() , 52usize , concat !
               ( "Size of: " , stringify ! ( CFE_ES_TaskInfo_t ) ));
    assert_eq! (::std::mem::align_of::<CFE_ES_TaskInfo_t>() , 4usize , concat
                ! ( "Alignment of " , stringify ! ( CFE_ES_TaskInfo_t ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const CFE_ES_TaskInfo_t ) ) . TaskId as * const
                _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( CFE_ES_TaskInfo_t ) ,
                "::" , stringify ! ( TaskId ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const CFE_ES_TaskInfo_t ) ) . ExecutionCounter
                as * const _ as usize } , 4usize , concat ! (
                "Alignment of field: " , stringify ! ( CFE_ES_TaskInfo_t ) ,
                "::" , stringify ! ( ExecutionCounter ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const CFE_ES_TaskInfo_t ) ) . TaskName as *
                const _ as usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( CFE_ES_TaskInfo_t ) ,
                "::" , stringify ! ( TaskName ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const CFE_ES_TaskInfo_t ) ) . AppId as * const
                _ as usize } , 28usize , concat ! (
                "Alignment of field: " , stringify ! ( CFE_ES_TaskInfo_t ) ,
                "::" , stringify ! ( AppId ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const CFE_ES_TaskInfo_t ) ) . AppName as *
                const _ as usize } , 32usize , concat ! (
                "Alignment of field: " , stringify ! ( CFE_ES_TaskInfo_t ) ,
                "::" , stringify ! ( AppName ) ));
}
impl Clone for CFE_ES_TaskInfo_t {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct CFE_ES_BlockStats_t {
    /**< \brief Number of bytes in each of these blocks */
    pub BlockSize: uint32,
    /**< \brief Number of Memory Blocks of this size created */
    pub NumCreated: uint32,
    /**< \brief Number of Memory Blocks of this size that are free */
    pub NumFree: uint32,
}
#[test]
fn bindgen_test_layout_CFE_ES_BlockStats_t() {
    assert_eq!(::std::mem::size_of::<CFE_ES_BlockStats_t>() , 12usize , concat
               ! ( "Size of: " , stringify ! ( CFE_ES_BlockStats_t ) ));
    assert_eq! (::std::mem::align_of::<CFE_ES_BlockStats_t>() , 4usize ,
                concat ! (
                "Alignment of " , stringify ! ( CFE_ES_BlockStats_t ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const CFE_ES_BlockStats_t ) ) . BlockSize as *
                const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( CFE_ES_BlockStats_t ) ,
                "::" , stringify ! ( BlockSize ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const CFE_ES_BlockStats_t ) ) . NumCreated as *
                const _ as usize } , 4usize , concat ! (
                "Alignment of field: " , stringify ! ( CFE_ES_BlockStats_t ) ,
                "::" , stringify ! ( NumCreated ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const CFE_ES_BlockStats_t ) ) . NumFree as *
                const _ as usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( CFE_ES_BlockStats_t ) ,
                "::" , stringify ! ( NumFree ) ));
}
impl Clone for CFE_ES_BlockStats_t {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct CFE_ES_MemPoolStats_t {
    /**< \cfetlmmnemonic \ES_POOLSIZE
                                                        \brief  Size of Memory Pool (in bytes) */
    pub PoolSize: uint32,
    /**< \cfetlmmnemonic \ES_BLKSREQ
                                                        \brief Number of times a memory block has been allocated */
    pub NumBlocksRequested: uint32,
    /**< \cfetlmmnemonic \ES_BLKERRCTR
                                                        \brief Number of errors detected when freeing a memory block */
    pub CheckErrCtr: uint32,
    /**< \cfetlmmnemonic \ES_FREEBYTES
                                                        \brief Number of bytes never allocated to a block */
    pub NumFreeBytes: uint32,
    /**< \cfetlmmnemonic \ES_BLKSTATS
                                                                           \brief Contains stats on each block size */
    pub BlockStats: [CFE_ES_BlockStats_t; 17usize],
}
#[test]
fn bindgen_test_layout_CFE_ES_MemPoolStats_t() {
    assert_eq!(::std::mem::size_of::<CFE_ES_MemPoolStats_t>() , 220usize ,
               concat ! ( "Size of: " , stringify ! ( CFE_ES_MemPoolStats_t )
               ));
    assert_eq! (::std::mem::align_of::<CFE_ES_MemPoolStats_t>() , 4usize ,
                concat ! (
                "Alignment of " , stringify ! ( CFE_ES_MemPoolStats_t ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const CFE_ES_MemPoolStats_t ) ) . PoolSize as *
                const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( CFE_ES_MemPoolStats_t )
                , "::" , stringify ! ( PoolSize ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const CFE_ES_MemPoolStats_t ) ) .
                NumBlocksRequested as * const _ as usize } , 4usize , concat !
                (
                "Alignment of field: " , stringify ! ( CFE_ES_MemPoolStats_t )
                , "::" , stringify ! ( NumBlocksRequested ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const CFE_ES_MemPoolStats_t ) ) . CheckErrCtr
                as * const _ as usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( CFE_ES_MemPoolStats_t )
                , "::" , stringify ! ( CheckErrCtr ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const CFE_ES_MemPoolStats_t ) ) . NumFreeBytes
                as * const _ as usize } , 12usize , concat ! (
                "Alignment of field: " , stringify ! ( CFE_ES_MemPoolStats_t )
                , "::" , stringify ! ( NumFreeBytes ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const CFE_ES_MemPoolStats_t ) ) . BlockStats as
                * const _ as usize } , 16usize , concat ! (
                "Alignment of field: " , stringify ! ( CFE_ES_MemPoolStats_t )
                , "::" , stringify ! ( BlockStats ) ));
}
impl Clone for CFE_ES_MemPoolStats_t {
    fn clone(&self) -> Self { *self }
}
pub type CFE_ES_CDSHandle_t = cpuaddr;
#[repr(C)]
pub struct CFE_ES_CDSRegDumpRec_t {
    /**< \brief Handle of CDS */
    pub Handle: CFE_ES_CDSHandle_t,
    /**< \brief Size, in bytes, of the CDS memory block */
    pub Size: uint32,
    /**< \brief Flag that indicates whether CDS contains a Critical Table */
    pub Table: boolean,
    /**< \brief Processor Unique Name of CDS */
    pub Name: [::std::os::raw::c_char; 38usize],
    /**< \brief Spare byte to insure structure size is multiple of 4 bytes */
    pub ByteAlignSpare1: uint8,
}
#[test]
fn bindgen_test_layout_CFE_ES_CDSRegDumpRec_t() {
    assert_eq!(::std::mem::size_of::<CFE_ES_CDSRegDumpRec_t>() , 56usize ,
               concat ! ( "Size of: " , stringify ! ( CFE_ES_CDSRegDumpRec_t )
               ));
    assert_eq! (::std::mem::align_of::<CFE_ES_CDSRegDumpRec_t>() , 8usize ,
                concat ! (
                "Alignment of " , stringify ! ( CFE_ES_CDSRegDumpRec_t ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const CFE_ES_CDSRegDumpRec_t ) ) . Handle as *
                const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( CFE_ES_CDSRegDumpRec_t
                ) , "::" , stringify ! ( Handle ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const CFE_ES_CDSRegDumpRec_t ) ) . Size as *
                const _ as usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( CFE_ES_CDSRegDumpRec_t
                ) , "::" , stringify ! ( Size ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const CFE_ES_CDSRegDumpRec_t ) ) . Table as *
                const _ as usize } , 12usize , concat ! (
                "Alignment of field: " , stringify ! ( CFE_ES_CDSRegDumpRec_t
                ) , "::" , stringify ! ( Table ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const CFE_ES_CDSRegDumpRec_t ) ) . Name as *
                const _ as usize } , 13usize , concat ! (
                "Alignment of field: " , stringify ! ( CFE_ES_CDSRegDumpRec_t
                ) , "::" , stringify ! ( Name ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const CFE_ES_CDSRegDumpRec_t ) ) .
                ByteAlignSpare1 as * const _ as usize } , 51usize , concat ! (
                "Alignment of field: " , stringify ! ( CFE_ES_CDSRegDumpRec_t
                ) , "::" , stringify ! ( ByteAlignSpare1 ) ));
}
pub type CFE_ES_ChildTaskMainFuncPtr_t =
    ::std::option::Option<unsafe extern "C" fn()>;
pub type CFE_ES_LibraryEntryFuncPtr_t =
    ::std::option::Option<unsafe extern "C" fn() -> int32>;
#[repr(u32)]
#[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
pub enum CFE_ES_StaticEntryType_t {
    CFE_ES_STATICENTRYTYPE_INVALID = 0,
    CFE_ES_STATICENTRYTYPE_FIRST_VALID = 2000,
    CFE_ES_STATICENTRYTYPE_APPLICATION = 2001,
    CFE_ES_STATICENTRYTYPE_LIBRARY = 2002,
    CFE_ES_STATICENTRYTYPE_MAX = 2003,
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct _bindgen_ty_2 {
    pub EntryType: CFE_ES_StaticEntryType_t,
    pub Ptrs: _bindgen_ty_2__bindgen_ty_1,
    pub Priority: uint32,
    pub StackSize: uint32,
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct _bindgen_ty_2__bindgen_ty_1 {
    /**< \brief Entry point for Application */
    pub AppEntryFunc: __BindgenUnionField<CFE_ES_ChildTaskMainFuncPtr_t>,
    /**< \brief Initialization function for Library */
    pub LibInitFunc: __BindgenUnionField<CFE_ES_LibraryEntryFuncPtr_t>,
    pub EntryFuncAddr: __BindgenUnionField<cpuaddr>,
    pub bindgen_union_field: u64,
}
#[test]
fn bindgen_test_layout__bindgen_ty_2__bindgen_ty_1() {
    assert_eq!(::std::mem::size_of::<_bindgen_ty_2__bindgen_ty_1>() , 8usize ,
               concat ! (
               "Size of: " , stringify ! ( _bindgen_ty_2__bindgen_ty_1 ) ));
    assert_eq! (::std::mem::align_of::<_bindgen_ty_2__bindgen_ty_1>() , 8usize
                , concat ! (
                "Alignment of " , stringify ! ( _bindgen_ty_2__bindgen_ty_1 )
                ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _bindgen_ty_2__bindgen_ty_1 ) ) .
                AppEntryFunc as * const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! (
                _bindgen_ty_2__bindgen_ty_1 ) , "::" , stringify ! (
                AppEntryFunc ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _bindgen_ty_2__bindgen_ty_1 ) ) .
                LibInitFunc as * const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! (
                _bindgen_ty_2__bindgen_ty_1 ) , "::" , stringify ! (
                LibInitFunc ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _bindgen_ty_2__bindgen_ty_1 ) ) .
                EntryFuncAddr as * const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! (
                _bindgen_ty_2__bindgen_ty_1 ) , "::" , stringify ! (
                EntryFuncAddr ) ));
}
impl Clone for _bindgen_ty_2__bindgen_ty_1 {
    fn clone(&self) -> Self { *self }
}
#[test]
fn bindgen_test_layout__bindgen_ty_2() {
    assert_eq!(::std::mem::size_of::<_bindgen_ty_2>() , 24usize , concat ! (
               "Size of: " , stringify ! ( _bindgen_ty_2 ) ));
    assert_eq! (::std::mem::align_of::<_bindgen_ty_2>() , 8usize , concat ! (
                "Alignment of " , stringify ! ( _bindgen_ty_2 ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _bindgen_ty_2 ) ) . EntryType as * const
                _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( _bindgen_ty_2 ) , "::"
                , stringify ! ( EntryType ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _bindgen_ty_2 ) ) . Ptrs as * const _ as
                usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( _bindgen_ty_2 ) , "::"
                , stringify ! ( Ptrs ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _bindgen_ty_2 ) ) . Priority as * const _
                as usize } , 16usize , concat ! (
                "Alignment of field: " , stringify ! ( _bindgen_ty_2 ) , "::"
                , stringify ! ( Priority ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const _bindgen_ty_2 ) ) . StackSize as * const
                _ as usize } , 20usize , concat ! (
                "Alignment of field: " , stringify ! ( _bindgen_ty_2 ) , "::"
                , stringify ! ( StackSize ) ));
}
impl Clone for _bindgen_ty_2 {
    fn clone(&self) -> Self { *self }
}
pub type CFE_ES_AppStaticModuleApi_t = _bindgen_ty_2;
extern "C" {
    /*****************************************************************************/
/**
** \brief cFE Main Entry Point used by Board Support Package to start cFE
**
** \par Description
**        cFE main entry point. This is the entry point into the cFE software.
**        It is called only by the Board Support Package software.
**
** \par Assumptions, External Events, and Notes:
**          None
**
** \param[in]  StartType     Identifies whether this was a #CFE_PSP_RST_TYPE_POWERON or #CFE_PSP_RST_TYPE_PROCESSOR.
**
** \param[in]  StartSubtype  Specifies, in more detail, what caused the \c StartType identified above.
**                           See #CFE_ES_POWER_CYCLE for possible examples.
**
** \param[in]  ModeId        Identifies the source of the Boot as determined by the BSP.
**
** \param[in]  StartFilePath Identifies the startup file to use to initialize the cFE apps.
**
** \sa #CFE_ES_ResetCFE
**
******************************************************************************/
    pub fn CFE_ES_Main(StartType: uint32, StartSubtype: uint32,
                       ModeId: uint32,
                       StartFilePath: *const ::std::os::raw::c_char);
}
extern "C" {
    /*****************************************************************************/
/**
** \brief Return the most recent Reset Type
**
** \par Description
**        Provides the caller with codes that identifies the type of Reset
**        the processor most recently underwent.  The caller can also obtain
**        information on what caused the reset by supplying a pointer to a
**        variable that will be filled with the Reset Sub-Type.
**
** \par Assumptions, External Events, and Notes:
**          None
**
** \param[in]   ResetSubtypePtr    Pointer to \c uint32 type variable in which the Reset Sub-Type will be stored.
**                                 The caller can set this pointer to NULL if the Sub-Type is of no interest.
**
** \param[out]  *ResetSubtypePtr   If the provided pointer was not \c NULL, the Reset Sub-Type is stored at the given address.
**                                 For a list of possible Sub-Type values, see \link #CFE_ES_POWER_CYCLE "Reset Sub-Types" \endlink.
**
** \returns
** \retcode #CFE_PSP_RST_TYPE_POWERON   \retdesc \copydoc CFE_PSP_RST_TYPE_POWERON    \endcode
** \retcode #CFE_PSP_RST_TYPE_PROCESSOR \retdesc \copydoc CFE_PSP_RST_TYPE_PROCESSOR  \endcode
** \endreturns
**
** \sa #CFE_ES_GetAppID, #CFE_ES_GetAppIDByName, #CFE_ES_GetAppName, #CFE_ES_GetTaskInfo
**
******************************************************************************/
    pub fn CFE_ES_GetResetType(ResetSubtypePtr: *mut uint32) -> int32;
}
extern "C" {
    /*****************************************************************************/
/**
** \brief Reset the cFE Core and all cFE Applications
**
** \par Description
**        This API causes an immediate reset of the cFE Kernel and all cFE Applications.
**        The caller can specify whether the reset should clear all memory (#CFE_PSP_RST_TYPE_POWERON)
**        or try to retain volatile memory areas (#CFE_PSP_RST_TYPE_PROCESSOR).
**
** \par Assumptions, External Events, and Notes:
**          None
**
** \param[in]  ResetType    Identifies the type of reset desired.  Allowable settings are:
**                          \arg #CFE_PSP_RST_TYPE_POWERON     - Causes all memory to be cleared 
**                          \arg #CFE_PSP_RST_TYPE_PROCESSOR   - Attempts to retain volatile disk, critical data store and user reserved memory. 
**
** \returns
** \retcode #CFE_ES_BAD_ARGUMENT    \retdesc \copydoc CFE_ES_BAD_ARGUMENT     \endcode
** \retcode #CFE_ES_NOT_IMPLEMENTED \retdesc \copydoc CFE_ES_NOT_IMPLEMENTED  \endcode
** \endreturns
**
** \sa #CFE_ES_Main
**
******************************************************************************/
    pub fn CFE_ES_ResetCFE(ResetType: uint32) -> int32;
}
extern "C" {
    /*****************************************************************************/
/**
** \brief Restart a single cFE Application
**
** \par Description
**        This API causes a cFE Application to be stopped and restarted.
**
** \par Assumptions, External Events, and Notes:
**          None
**
** \param[in]  AppID       Identifies the application to be reset.
**
** \returns
** \retcode #CFE_ES_NOT_IMPLEMENTED \retdesc \copydoc CFE_ES_NOT_IMPLEMENTED  \endcode
** \endreturns
**
** \sa #CFE_ES_ReloadApp, #CFE_ES_DeleteApp
**
******************************************************************************/
    pub fn CFE_ES_RestartApp(AppID: uint32) -> int32;
}
extern "C" {
    /*****************************************************************************/
/**
** \brief Reload a single cFE Application
**
** \par Description
**        This API causes a cFE Application to be stopped and restarted from
**        the specified file.
**
** \par Assumptions, External Events, and Notes:
**          None
**
** \param[in]  AppID       Identifies the application to be reset.
**
** \param[in]  AppFileName Identifies the new file to start.
**
** \returns
** \retcode #CFE_ES_NOT_IMPLEMENTED \retdesc \copydoc CFE_ES_NOT_IMPLEMENTED  \endcode
** \endreturns
**
** \sa #CFE_ES_RestartApp, #CFE_ES_DeleteApp
**
******************************************************************************/
    pub fn CFE_ES_ReloadApp(AppID: uint32,
                            AppFileName: *const ::std::os::raw::c_char)
     -> int32;
}
extern "C" {
    /*****************************************************************************/
/**
** \brief Delete a cFE Application
**
** \par Description
**        This API causes a cFE Application to be stopped deleted.
**
** \par Assumptions, External Events, and Notes:
**          None
**
** \param[in]  AppID       Identifies the application to be reset.
**
** \returns
** \retcode #CFE_ES_NOT_IMPLEMENTED \retdesc \copydoc CFE_ES_NOT_IMPLEMENTED  \endcode
** \endreturns
**
** \sa #CFE_ES_RestartApp, #CFE_ES_ReloadApp
**
******************************************************************************/
    pub fn CFE_ES_DeleteApp(AppID: uint32) -> int32;
}
extern "C" {
    /*****************************************************************************/
/**
** \brief Exit a cFE Application
**
** \par Description
**        This API is the "Exit Point" for the cFE application
**
** \par Assumptions, External Events, and Notes:
**          None
**
** \param[in]  ExitStatus     .
**
** \returns
** \retcode #CFE_ES_NOT_IMPLEMENTED \retdesc \copydoc CFE_ES_NOT_IMPLEMENTED  \endcode
** \endreturns
**
** \sa #CFE_ES_RunLoop, #CFE_ES_RegisterApp
**
******************************************************************************/
    pub fn CFE_ES_ExitApp(ExitStatus: uint32);
}
extern "C" {
    /*****************************************************************************/
/**
** \brief Check for Exit, Restart, or Reload commands
**
** \par Description
**        This is the API that allows an app to check for exit requests from
**         the system.
**
** \par Assumptions, External Events, and Notes:
**          None
**
** \param[in]  ExitStatus   A pointer to a variable containing the Application's
**                          desired run status.  Acceptable values are:
**                          \arg #CFE_ES_APP_RUN - \copydoc CFE_ES_APP_RUN
**                          \arg #CFE_ES_APP_EXIT - \copydoc CFE_ES_APP_EXIT
**                          \arg #CFE_ES_APP_ERROR - \copydoc CFE_ES_APP_ERROR
**
** \returns
** \retcode #TRUE  \retdesc The application should continue executing \endcode
** \retcode #FALSE \retdesc The application should terminate itself \endcode
** \endreturns
**
** \sa #CFE_ES_ExitApp, #CFE_ES_RegisterApp
**
******************************************************************************/
    pub fn CFE_ES_RunLoop(ExitStatus: *mut uint32) -> int32;
}
extern "C" {
    /*****************************************************************************/
/**
** \brief Allow an Application to Wait for others to start up
**
** \par Description
**        This is the API that allows an app to wait for the "rest" of the apps
**        to finish initializing before continuing. It is most useful for 
**        applications such as Health and Safety or the Scheduler that need
**        to wait until applications exist and are running before sending out
**        packets to them.
**
** \par Assumptions, External Events, and Notes:
**          This API should only be called as the last item of an Apps initialization.
**          In addition, this API should only be called by an App that is started
**          from the ES Startup file. It should not be used by an App that is 
**          started after the system is running. ( Although it will cause no harm )
**
** \param[in]  TimeOutMilliseconds   The timeout value in Milliseconds.
**                                   This parameter must be at least 1000. Lower values
**                                   will be rounded up. There is not an option to 
**                                   wait indefinitely to avoid hanging a critical
**                                   application because a non-critical app did not start. 
**
**
** \sa #CFE_ES_RunLoop
**
******************************************************************************/
    pub fn CFE_ES_WaitForStartupSync(TimeOutMilliseconds: uint32);
}
extern "C" {
    /*****************************************************************************/
/**
** \brief Registers a cFE Application with the Executive Services
**
** \par Description
**        This API registers the calling Application with the cFE.
**
** \par Assumptions, External Events, and Notes:
**        NOTE: This function \b MUST be called before any other cFE API functions are called.
**
** \returns
** \retstmt Return codes from #OS_TaskRegister          \endcode
** \retstmt Return codes from #OS_BinSemTake            \endcode
** \retcode #CFE_SUCCESS \retdesc \copydoc CFE_SUCCESS  \endcode
** \endreturns
**
** \sa #CFE_ES_ExitApp, #CFE_ES_RunLoop
**
******************************************************************************/
    pub fn CFE_ES_RegisterApp() -> int32;
}
extern "C" {
    /*****************************************************************************/
/**
** \brief Get an Application ID for the calling Application
**
** \par Description
**        This routine retrieves the cFE Application ID for the calling Application.  
**
** \par Assumptions, External Events, and Notes:
**        NOTE: \b All tasks associated with the Application would return the same Application ID.
**
** \param[in]   AppIdPtr       Pointer to variable that is to receive the Application's ID.
**
** \param[out]  *AppIdPtr      Application ID of the calling Application.
**
** \returns
** \retcode #CFE_SUCCESS       \retdesc \copydoc CFE_SUCCESS        \endcode
** \retcode #CFE_ES_ERR_APPID  \retdesc \copydoc CFE_ES_ERR_APPID   \endcode
** \retcode #CFE_ES_ERR_BUFFER \retdesc \copydoc CFE_ES_ERR_BUFFER  \endcode
** \endreturns
**
** \sa #CFE_ES_GetResetType, #CFE_ES_GetAppIDByName, #CFE_ES_GetAppName, #CFE_ES_GetTaskInfo
**
******************************************************************************/
    pub fn CFE_ES_GetAppID(AppIdPtr: *mut uint32) -> int32;
}
extern "C" {
    /*****************************************************************************/
/**
** \brief Get an Application ID associated with a specified Application name
**
** \par Description
**        This routine retrieves the cFE Application ID associated with a
**        specified Application name.  
**
** \par Assumptions, External Events, and Notes:
**        None
**
** \param[in]   AppIdPtr       Pointer to variable that is to receive the Application's ID.
**
** \param[in]   AppName        Pointer to null terminated character string containing an Application name.
**
** \param[out]  *AppIdPtr      Application ID of the calling Application.
**
** \returns
** \retcode #CFE_SUCCESS         \retdesc \copydoc CFE_SUCCESS         \endcode
** \retcode #CFE_ES_ERR_APPNAME  \retdesc \copydoc CFE_ES_ERR_APPNAME  \endcode
** \retcode #CFE_ES_ERR_BUFFER   \retdesc \copydoc CFE_ES_ERR_BUFFER   \endcode
** \endreturns
**
** \sa #CFE_ES_GetResetType, #CFE_ES_GetAppID, #CFE_ES_GetAppName, #CFE_ES_GetTaskInfo
**
******************************************************************************/
    pub fn CFE_ES_GetAppIDByName(AppIdPtr: *mut uint32,
                                 AppName: *const ::std::os::raw::c_char)
     -> int32;
}
extern "C" {
    /*****************************************************************************/
/**
** \brief Get an Application name for a specified Application ID
**
** \par Description
**        This routine retrieves the cFE Application ID associated with a
**        specified Application name.  
**
** \par Assumptions, External Events, and Notes:
**        None
**
** \param[in]   AppName       Pointer to a character array of at least \c BufferLength in size that will
**                            be filled with the appropriate Application name.
**
** \param[in]   AppId         Application ID of Application whose name is being requested.
**
** \param[in]   BufferLength  The maximum number of characters, including the null terminator, that can be put
**                            into the \c AppName buffer.  This routine will truncate the name to this length,
**                            if necessary.
**
** \param[out]  *AppName      Null terminated Application name of the Application associated with the 
**                            specified Application ID.
**
** \returns
** \retcode #CFE_SUCCESS         \retdesc \copydoc CFE_SUCCESS        \endcode
** \retcode #CFE_ES_ERR_APPID    \retdesc \copydoc CFE_ES_ERR_APPID   \endcode
** \retcode #CFE_ES_ERR_BUFFER   \retdesc \copydoc CFE_ES_ERR_BUFFER  \endcode
** \endreturns
**
** \sa #CFE_ES_GetResetType, #CFE_ES_GetAppID, #CFE_ES_GetAppIDByName, #CFE_ES_GetTaskInfo
**
******************************************************************************/
    pub fn CFE_ES_GetAppName(AppName: *mut ::std::os::raw::c_char,
                             AppId: uint32, BufferLength: uint32) -> int32;
}
extern "C" {
    /*****************************************************************************/
/**
** \brief Get Application Information given a specified App ID
**
** \par Description
**        This routine retrieves the information about an App associated with a
**        specified App ID. The information includes all of the information ES 
**        maintains for an application ( documented in the CFE_ES_AppInfo_t type ) 
**
** \par Assumptions, External Events, and Notes:
**        None
**
** \param[in]   AppInfo      Pointer to a \c CFE_ES_AppInfo_t structure that holds the specific 
**                            Application information.
**
** \param[in]   AppId        Application ID of Application whose name is being requested.
**
** \param[out]  *AppInfo     Filled out \c CFE_ES_AppInfo_t structure containing the 
**                            App Name, and application memory addresses among other fields.
**
** \returns
** \retcode #CFE_SUCCESS         \retdesc \copydoc CFE_SUCCESS         \endcode
** \retcode #CFE_ES_ERR_APPID    \retdesc \copydoc CFE_ES_ERR_APPID    \endcode
** \retcode #CFE_ES_ERR_BUFFER   \retdesc \copydoc CFE_ES_ERR_BUFFER   \endcode
** \endreturns
**
** \sa #CFE_ES_GetResetType, #CFE_ES_GetAppID, #CFE_ES_GetAppIDByName, #CFE_ES_GetAppName
**
******************************************************************************/
    pub fn CFE_ES_GetAppInfo(AppInfo: *mut CFE_ES_AppInfo_t, AppId: uint32)
     -> int32;
}
extern "C" {
    /*****************************************************************************/
/**
** \brief Get Task Information given a specified Task ID
**
** \par Description
**        This routine retrieves the information about a Task associated with a
**        specified Task ID. The information includes Task Name, and Parent/Creator 
**        Application ID.
**
** \par Assumptions, External Events, and Notes:
**        None
**
** \param[in]   TaskInfo      Pointer to a \c CFE_ES_TaskInfo_t structure that holds the specific 
**                            task information.
**
** \param[in]   TaskId        Application ID of Application whose name is being requested.
**
** \param[out]  *TaskInfo     Filled out \c CFE_ES_TaskInfo_t structure containing the 
**                            Task Name, Parent App Name, Parent App ID among other fields.
**
** \returns
** \retcode #CFE_SUCCESS         \retdesc \copydoc CFE_SUCCESS         \endcode
** \retcode #CFE_ES_ERR_TASKID   \retdesc \copydoc CFE_ES_ERR_TASKID   \endcode
** \retcode #CFE_ES_ERR_BUFFER   \retdesc \copydoc CFE_ES_ERR_BUFFER   \endcode
** \endreturns
**
** \sa #CFE_ES_GetResetType, #CFE_ES_GetAppID, #CFE_ES_GetAppIDByName, #CFE_ES_GetAppName
**
******************************************************************************/
    pub fn CFE_ES_GetTaskInfo(TaskInfo: *mut CFE_ES_TaskInfo_t,
                              TaskId: uint32) -> int32;
}
extern "C" {
    /*****************************************************************************/
/**
** \brief Registers a cFE Child task associated with a cFE Application
**
** \par Description
**        This routine registers a cFE Child task and associates it with its parent
**        cFE Application.  
**
** \par Assumptions, External Events, and Notes:
**        NOTE: This API \b MUST be called by the Child Task before any other cFE API calls are made.
**
** \returns
** \retcode #CFE_SUCCESS                       \retdesc \copydoc CFE_SUCCESS                     \endcode
** \retcode #CFE_ES_ERR_CHILD_TASK_REGISTER    \retdesc \copydoc CFE_ES_ERR_CHILD_TASK_REGISTER  \endcode
** \endreturns
**
** \sa #CFE_ES_CreateChildTask, #CFE_ES_DeleteChildTask, #CFE_ES_ExitChildTask
**
******************************************************************************/
    pub fn CFE_ES_RegisterChildTask() -> int32;
}
extern "C" {
    /*****************************************************************************/
/**
** \brief Creates a new task under an existing Application
**
** \par Description
**        This routine creates a new task (a separate execution thread) owned by the calling Application.  
**
** \par Assumptions, External Events, and Notes:
**        None
**
** \param[in]   TaskIdPtr     A pointer to a variable that will be filled in with the new task's ID.
**
** \param[in]   TaskName      A pointer to a string containing the desired name of the new task.  
**                            This can be up to #OS_MAX_API_NAME characters, including the trailing null.
**
** \param[in]   FunctionPtr   A pointer to the function that will be spawned as a new task.  This function 
**                            must have the following signature: uint32 function(void).  Input parameters 
**                            for the new task are not supported.
**
** \param[in]   StackPtr      A pointer to the location where the child task's stack pointer should start.   
**                            NOTE: Not all underlying operating systems support this parameter.
**
** \param[in]   StackSize     The number of bytes to allocate for the new task's stack.
**
** \param[in]   Priority      The priority for the new task.  Lower numbers are higher priority, with 0 being 
**                            the highest priority.  Applications cannot create tasks with a higher priority 
**                            (lower number) than their own priority.
**
** \param[in]   Flags         Reserved for future expansion.
**
** \param[out]  *TaskIdPtr    The Task ID of the newly created child task.
**
** \returns
** \retcode #CFE_SUCCESS                     \retdesc \copydoc CFE_SUCCESS                   \endcode
** \retcode #CFE_ES_ERR_CHILD_TASK_CREATE    \retdesc \copydoc CFE_ES_ERR_CHILD_TASK_CREATE  \endcode
** \endreturns
**
** \sa #CFE_ES_RegisterChildTask, #CFE_ES_DeleteChildTask, #CFE_ES_ExitChildTask
**
******************************************************************************/
    pub fn CFE_ES_CreateChildTask(TaskIdPtr: *mut uint32,
                                  TaskName: *const ::std::os::raw::c_char,
                                  FunctionPtr: CFE_ES_ChildTaskMainFuncPtr_t,
                                  StackPtr: *mut uint32, StackSize: uint32,
                                  Priority: uint32, Flags: uint32) -> int32;
}
extern "C" {
    /*****************************************************************************/
/**
** \brief Deletes a task under an existing Application
**
** \par Description
**        This routine deletes a task under an Application specified by the \c TaskId obtained
**        when the child task was created using the #CFE_ES_CreateChildTask API.
**
** \par Assumptions, External Events, and Notes:
**        None
**
** \param[in]   TaskId     The task ID previously obtained when the Child Task was created with the #CFE_ES_CreateChildTask API.
**
** \returns
** \retcode #CFE_ES_NOT_IMPLEMENTED \retdesc \copydoc CFE_ES_NOT_IMPLEMENTED  \endcode
** \endreturns
**
** \sa #CFE_ES_RegisterChildTask, #CFE_ES_CreateChildTask, #CFE_ES_ExitChildTask
**
******************************************************************************/
    pub fn CFE_ES_DeleteChildTask(TaskId: uint32) -> int32;
}
extern "C" {
    /*****************************************************************************/
/**
** \brief Exits a child task
**
** \par Description
**        This routine allows the current executing child task to exit and 
**        be deleted by ES.
**
** \par Assumptions, External Events, and Notes:
**        This function cannot be called from an Application's Main Task.
**
** \returns
** \retstmt
**        This function does not return a value, but if it does return
**        at all, it is assumed that the Task was either unregistered or
**        this function was called from a cFE Application's main task.   \endcode
** \endreturns
**
** \sa #CFE_ES_RegisterChildTask, #CFE_ES_CreateChildTask, #CFE_ES_DeleteChildTask
**
******************************************************************************/
    pub fn CFE_ES_ExitChildTask();
}
extern "C" {
    /*****************************************************************************/
/**
** \brief Increments the execution counter for the calling task
**
** \par Description
**        This routine increments the execution counter that is stored for
**        the calling task. It can be called from cFE Application main tasks, child
**        tasks, or cFE Core application main tasks. Normally, the call is not 
**        necessary from a cFE Application, since the CFE_ES_RunLoop call increments
**        the counter for the Application. 
**
** \par Assumptions, External Events, and Notes:
**        NOTE: This API is not needed for Appplications that call the CFE_ES_RunLoop call.
**
** \returns
** \retstmt
**        This function does not return a value.   \endcode
** \endreturns
**
** \sa #CFE_ES_RunLoop
**
******************************************************************************/
    pub fn CFE_ES_IncrementTaskCounter();
}
extern "C" {
    /*****************************************************************************/
/**
** \brief Write a string to the cFE System Log
**
** \par Description
**        This routine writes a formatted string to the cFE system log.  This 
**        can be used to record very low-level errors that can't be reported 
**        using the Event Services. This function is used in place of printf 
**        for flight software. It should be used for significant startup events, 
**        critical errors, and conditionally compiled debug software. 
**
** \par Assumptions, External Events, and Notes:
**        None
**
** \param[in]   SpecStringPtr     The format string for the log message.  
**                                This is similar to the format string for a printf() call.
**
** \returns
** \retcode #CFE_SUCCESS             \retdesc \copydoc CFE_SUCCESS             \endcode
** \retcode #CFE_ES_ERR_SYS_LOG_FULL \retdesc \copydoc CFE_ES_ERR_SYS_LOG_FULL \endcode
** \endreturns
**
** \sa
**
******************************************************************************/
    pub fn CFE_ES_WriteToSysLog(SpecStringPtr:
                                    *const ::std::os::raw::c_char, ...)
     -> int32;
}
extern "C" {
    /*****************************************************************************/
/**
** \brief Calculate a CRC on a block of memory
**
** \par Description
**        This routine calculates a cyclic redundancy check (CRC) on a block of memory.  The CRC algorithm
**        used is determined by the last parameter. 
**
** \par Assumptions, External Events, and Notes:
**        None
**
** \param[in]   DataPtr     Pointer to the base of the memory block.
**
** \param[in]   DataLength  The number of bytes in the memory block.
**
** \param[in]   InputCRC    A starting value for use in the CRC calculation.  This parameter
**                          allows the user to calculate the CRC of non-contiguous blocks as
**                          a single value.  Nominally, the user should set this value to zero.
**
** \param[in]   TypeCRC     One of the following CRC algorithm selections:
**
**                          \arg \c CFE_ES_CRC_8 - (Not currently implemented)
**                          \arg \c CFE_ES_CRC_16 - a CRC-16 algorithm
**                          \arg \c CFE_ES_CRC_32 - (not currently implemented)
**
** \returns
** \retstmt The result of the CRC calculation on the specified memory block. \endcode
** \endreturns
**
******************************************************************************/
    pub fn CFE_ES_CalculateCRC(DataPtr: *const ::std::os::raw::c_void,
                               DataLength: uint32, InputCRC: uint32,
                               TypeCRC: uint32) -> uint32;
}
extern "C" {
    /*****************************************************************************/
/**
** \brief Reserve space (or re-obtain previously reserved space) in the Critical Data Store (CDS)
**
** \par Description
**        This routine allocates a block of memory in the Critical Data Store and associates it with
**        the calling Application.  The memory can survive an Application restart as well as a Processor Reset. 
**
** \par Assumptions, External Events, and Notes:
**        None
**
** \param[in]   HandlePtr   Pointer Application's variable that will contain the CDS Memory Block Handle.
**
** \param[in]   BlockSize   The number of bytes needed in the CDS.
**
** \param[in]   Name        A pointer to a character string containing an application 
**                          unique name of #CFE_ES_CDS_MAX_NAME_LENGTH characters or less.
**
** \param[out]  *HandlePtr  The handle of the CDS block that can be used in 
**                          #CFE_ES_CopyToCDS and #CFE_ES_RestoreFromCDS.
**
** \returns
** \retcode #CFE_SUCCESS  \retdesc The memory block was successfully created in the CDS.           \endcode
** \retcode #CFE_ES_NOT_IMPLEMENTED \retdesc The processor does not support a Critical Data Store. \endcode
** \retcode #CFE_ES_CDS_ALREADY_EXISTS \retdesc \copydoc CFE_ES_CDS_ALREADY_EXISTS                 \endcode
** \retcode #CFE_ES_CDS_INVALID_SIZE   \retdesc \copydoc CFE_ES_CDS_INVALID_SIZE                   \endcode
** \retcode #CFE_ES_CDS_INVALID_NAME   \retdesc \copydoc CFE_ES_CDS_INVALID_NAME                   \endcode
** \retcode #CFE_ES_CDS_REGISTRY_FULL  \retdesc \copydoc CFE_ES_CDS_REGISTRY_FULL                  \endcode
** \endreturns
**
** \sa #CFE_ES_CopyToCDS, #CFE_ES_RestoreFromCDS
**
******************************************************************************/
    pub fn CFE_ES_RegisterCDS(HandlePtr: *mut CFE_ES_CDSHandle_t,
                              BlockSize: int32,
                              Name: *const ::std::os::raw::c_char) -> int32;
}
extern "C" {
    /*****************************************************************************/
/**
** \brief Save a block of data in the Critical Data Store (CDS)
**
** \par Description
**        This routine copies a specified block of memory into the Critical Data Store that
**        had been previously registered via #CFE_ES_RegisterCDS.  The block of memory to be
**        copied must be at least as big as the size specified when registering the CDS.
**
** \par Assumptions, External Events, and Notes:
**        None
**
** \param[in]   Handle       The handle of the CDS block that was previously obtained from #CFE_ES_RegisterCDS.
**
** \param[in]   DataToCopy   A Pointer to the block of memory to be copied into the CDS.
**
** \returns
** \retcode #OS_SUCCESS              \retdesc \copydoc OS_SUCCESS              \endcode
** \retcode #CFE_ES_ERR_MEM_HANDLE   \retdesc \copydoc CFE_ES_ERR_MEM_HANDLE   \endcode
** \retcode #OS_ERROR                \retdesc Problem with handle or a size mismatch   \endcode
** \endreturns
**
** \sa #CFE_ES_RegisterCDS, #CFE_ES_RestoreFromCDS
**
*/
    pub fn CFE_ES_CopyToCDS(Handle: CFE_ES_CDSHandle_t,
                            DataToCopy: *mut ::std::os::raw::c_void) -> int32;
}
extern "C" {
    /*****************************************************************************/
/**
** \brief Recover a block of data from the Critical Data Store (CDS)
**
** \par Description
**        This routine copies data from the Critical Data Store identified with the \c Handle into
**        the area of memory pointed to by the \c RestoreToMemory pointer.  The area of memory to
**        be copied into must be at least as big as the size specified when registering the CDS.
**        The recovery will indicate an error if the data integrity check maintained by the CDS 
**        indicates the contents of the CDS have changed.  However, the contents will still be
**        copied into the specified area of memory.
**
** \par Assumptions, External Events, and Notes:
**        None
**
** \param[in]   Handle             The handle of the CDS block that was previously obtained from #CFE_ES_RegisterCDS.
**
** \param[in]   RestoreToMemory    A Pointer to the block of memory that is to be restored with the contents of the CDS.
**
** \param[out]  *RestoreToMemory   The contents of the specified CDS.
**
** \returns
** \retcode #CFE_SUCCESS                \retdesc \copydoc CFE_SUCCESS                     \endcode
** \retcode #CFE_ES_CDS_BLOCK_CRC_ERR   \retdesc \copydoc CFE_ES_CDS_BLOCK_CRC_ERR        \endcode
** \retcode #OS_ERROR                   \retdesc Problem with handle or a size mismatch   \endcode
** \endreturns
**
** \sa #CFE_ES_RegisterCDS, #CFE_ES_CopyToCDS
**
*/
    pub fn CFE_ES_RestoreFromCDS(RestoreToMemory: *mut ::std::os::raw::c_void,
                                 Handle: CFE_ES_CDSHandle_t) -> int32;
}
extern "C" {
    /*****************************************************************************/
/**
** \brief Initializes a memory pool created by an application without using a semaphore during processing.
**
** \par Description
**        This routine initializes a pool of memory supplied by the calling application.  When a memory pool
**        created by this routine is processed, no mutex handling is performed.  
**
** \par Assumptions, External Events, and Notes:
**        -# The size of the pool must be an integral number of 32-bit words
**        -# The start address of the pool must be 32-bit aligned
**        -# 168 bytes are used for internal bookkeeping, therefore, they will not be available for allocation.
**
** \param[in]   HandlePtr   A pointer to the variable the caller wishes to have the memory pool handle kept in.
**
** \param[in]   MemPtr      A Pointer to the pool of memory created by the calling application. This address must
**                          be on a 32-bit boundary.
**
** \param[in]   Size        The size of the pool of memory.  Note that this must be an integral number of 32 bit words.
**
** \param[out]  *HandlePtr  The memory pool handle.
**
** \returns
** \retcode #CFE_SUCCESS           \retdesc \copydoc CFE_SUCCESS           \endcode
** \retcode #CFE_ES_BAD_ARGUMENT   \retdesc \copydoc CFE_ES_BAD_ARGUMENT   \endcode
** \endreturns
**
** \sa #CFE_ES_PoolCreate, #CFE_ES_PoolCreateEx, #CFE_ES_GetPoolBuf, #CFE_ES_PutPoolBuf, #CFE_ES_GetMemPoolStats
**
******************************************************************************/
    pub fn CFE_ES_PoolCreateNoSem(HandlePtr: *mut CFE_ES_MemHandle_t,
                                  MemPtr: *mut uint8, Size: uint32) -> int32;
}
extern "C" {
    /*****************************************************************************/
/**
** \brief Initializes a memory pool created by an application while using a semaphore during processing.
**
** \par Description
**        This routine initializes a pool of memory supplied by the calling application.  When a memory pool
**        created by this routine is processed, mutex handling will be performed.  
**
** \par Assumptions, External Events, and Notes:
**        -# The size of the pool must be an integral number of 32-bit words
**        -# The start address of the pool must be 32-bit aligned
**        -# 168 bytes are used for internal bookkeeping, therefore, they will not be available for allocation.
**
** \param[in]   HandlePtr   A pointer to the variable the caller wishes to have the memory pool handle kept in.
**
** \param[in]   MemPtr      A Pointer to the pool of memory created by the calling application. This address must
**                          be on a 32-bit boundary.
**
** \param[in]   Size        The size of the pool of memory.  Note that this must be an integral number of 32 bit words.
**
** \param[out]  *HandlePtr  The memory pool handle.
**
** \returns
** \retcode #CFE_SUCCESS           \retdesc \copydoc CFE_SUCCESS           \endcode
** \retcode #CFE_ES_BAD_ARGUMENT   \retdesc \copydoc CFE_ES_BAD_ARGUMENT   \endcode
** \endreturns
**
** \sa #CFE_ES_PoolCreateNoSem, #CFE_ES_PoolCreateEx, #CFE_ES_GetPoolBuf, #CFE_ES_PutPoolBuf, #CFE_ES_GetMemPoolStats
**
******************************************************************************/
    pub fn CFE_ES_PoolCreate(HandlePtr: *mut CFE_ES_MemHandle_t,
                             MemPtr: *mut uint8, Size: uint32) -> int32;
}
extern "C" {
    /*****************************************************************************/
/**
** \brief Initializes a memory pool created by an application with application specified block sizes.
**
** \par Description
**        This routine initializes a pool of memory supplied by the calling application.  
**
** \par Assumptions, External Events, and Notes:
**        -# The size of the pool must be an integral number of 32-bit words
**        -# The start address of the pool must be 32-bit aligned
**        -# 168 bytes are used for internal bookkeeping, therefore, they will not be available for allocation.
**
** \param[in]   HandlePtr      A pointer to the variable the caller wishes to have the memory pool handle kept in.
**
** \param[in]   MemPtr         A Pointer to the pool of memory created by the calling application. This address must
**                             be on a 32-bit boundary.
**
** \param[in]   Size           The size of the pool of memory.  Note that this must be an integral number of 32 bit words.
**
** \param[in]   NumBlockSizes  The number of different block sizes specified in the \c BlockSizes array. If set equal to
**                             zero or if greater than 17, then default block sizes are used.
**
** \param[in]   BlockSizes     Pointer to an array of sizes to be used instead of the default block sizes specified by
**                             #CFE_ES_MEM_BLOCK_SIZE_01 through #CFE_ES_MAX_BLOCK_SIZE.  If the pointer is equal to NULL,
**                             the default block sizes are used.
**
** \param[in]   UseMutex       Flag indicating whether the new memory pool will be processing with mutex handling or not.
**                             Valid parameter values are #CFE_ES_USE_MUTEX and #CFE_ES_NO_MUTEX
**
** \param[out]  *HandlePtr     The memory pool handle.
**
** \returns
** \retcode #CFE_SUCCESS           \retdesc \copydoc CFE_SUCCESS          \endcode
** \retcode #CFE_ES_BAD_ARGUMENT   \retdesc \copydoc CFE_ES_BAD_ARGUMENT  \endcode
** \endreturns
**
** \sa #CFE_ES_PoolCreate, #CFE_ES_PoolCreateNoSem, #CFE_ES_GetPoolBuf, #CFE_ES_PutPoolBuf, #CFE_ES_GetMemPoolStats
**
******************************************************************************/
    pub fn CFE_ES_PoolCreateEx(HandlePtr: *mut CFE_ES_MemHandle_t,
                               MemPtr: *mut uint8, Size: uint32,
                               NumBlockSizes: uint32, BlockSizes: *mut uint32,
                               UseMutex: uint16) -> int32;
}
extern "C" {
    /*****************************************************************************/
/**
** \brief Gets a buffer from the memory pool created by #CFE_ES_PoolCreate or #CFE_ES_PoolCreateNoSem
**
** \par Description
**        This routine obtains a block of memory from the memory pool supplied by the calling application.    
**
** \par Assumptions, External Events, and Notes:
**        -# The size allocated from the memory pool is, at a minimum, 12 bytes more than requested.
**
** \param[in]   BufPtr      A pointer to the Application's pointer in which will be stored the address of the allocated memory buffer.
**
** \param[in]   HandlePtr   The handle to the memory pool as returned by #CFE_ES_PoolCreate or #CFE_ES_PoolCreateNoSem.
**
** \param[in]   Size        The size of the buffer requested.  NOTE: The size allocated may be larger.
**
** \param[out]  *BufPtr     The address of the requested buffer.
**
** \returns
** \retstmt When successful, the return value is a positive number and is the number of bytes 
**          actually allocated for the buffer. \endcode
** \retcode #CFE_ES_ERR_MEM_HANDLE      \retdesc \copydoc CFE_ES_ERR_MEM_HANDLE       \endcode
** \retcode #CFE_ES_ERR_MEM_BLOCK_SIZE  \retdesc \copydoc CFE_ES_ERR_MEM_BLOCK_SIZE   \endcode
** \endreturns
**
** \sa #CFE_ES_PoolCreate, #CFE_ES_PoolCreateNoSem, #CFE_ES_PoolCreateEx, #CFE_ES_PutPoolBuf, #CFE_ES_GetMemPoolStats, #CFE_ES_GetPoolBufInfo
**
******************************************************************************/
    pub fn CFE_ES_GetPoolBuf(BufPtr: *mut *mut uint32,
                             HandlePtr: CFE_ES_MemHandle_t, Size: uint32)
     -> int32;
}
extern "C" {
    /*****************************************************************************/
/**
** \brief Gets info on a buffer previously allocated via #CFE_ES_GetPoolBuf
**
** \par Description
**        This routine gets info on a buffer in the memory pool.    
**
** \par Assumptions, External Events, and Notes:
**        None
**
** \param[in]   HandlePtr   The handle to the memory pool as returned by #CFE_ES_PoolCreate or #CFE_ES_PoolCreateNoSem.
**
** \param[in]   BufPtr      A pointer to the memory buffer to provide status for.
**
** \returns
** \retstmt When successful, the return value is a positive number and is the number of bytes actually allocated. \endcode
** \retcode #CFE_ES_ERR_MEM_HANDLE      \retdesc \copydoc CFE_ES_ERR_MEM_HANDLE   \endcode
** \retcode #CFE_ES_BUFFER_NOT_IN_POOL  \retdesc \copydoc CFE_ES_BUFFER_NOT_IN_POOL   \endcode
** \endreturns
**
** \sa #CFE_ES_PoolCreate, #CFE_ES_PoolCreateNoSem, #CFE_ES_PoolCreateEx, #CFE_ES_GetPoolBuf, #CFE_ES_GetMemPoolStats, #CFE_ES_PutPoolBuf
**
******************************************************************************/
    pub fn CFE_ES_GetPoolBufInfo(HandlePtr: CFE_ES_MemHandle_t,
                                 BufPtr: *mut uint32) -> int32;
}
extern "C" {
    /*****************************************************************************/
/**
** \brief Releases a buffer from the memory pool that was previously allocated via #CFE_ES_GetPoolBuf
**
** \par Description
**        This routine releases a buffer back into the memory pool.    
**
** \par Assumptions, External Events, and Notes:
**        None
**
** \param[in]   HandlePtr   The handle to the memory pool as returned by #CFE_ES_PoolCreate or #CFE_ES_PoolCreateNoSem.
**
** \param[in]   BufPtr      A pointer to the memory buffer to be released.
**
** \returns
** \retstmt When successful, the return value is a positive number and is the number of bytes actually released. \endcode
** \retcode #CFE_ES_ERR_MEM_HANDLE      \retdesc \copydoc CFE_ES_ERR_MEM_HANDLE   \endcode
** \endreturns
**
** \sa #CFE_ES_PoolCreate, #CFE_ES_PoolCreateNoSem, #CFE_ES_PoolCreateEx, #CFE_ES_GetPoolBuf, #CFE_ES_GetMemPoolStats, #CFE_ES_GetPoolBufInfo
**
******************************************************************************/
    pub fn CFE_ES_PutPoolBuf(HandlePtr: CFE_ES_MemHandle_t,
                             BufPtr: *mut uint32) -> int32;
}
extern "C" {
    /*****************************************************************************/
/**
** \brief Extracts the statistics maintained by the memory pool software
**
** \par Description
**        This routine fills the #CFE_ES_MemPoolStats_t data structure with the statistics
**        maintained by the memory pool software.  These statistics can then be telemetered
**        by the calling Application.    
**
** \par Assumptions, External Events, and Notes:
**        None
**
** \param[in]   BufPtr      Pointer to #CFE_ES_MemPoolStats_t data structure to be 
**                          filled with memory statistics.
**
** \param[in]   Handle      The handle to the memory pool whose statistics are desired.
**
** \param[out] *BufPtr      Memory Pool Statistics stored in given data structure.
**
** \returns
** \retcode #CFE_SUCCESS                \retdesc \copydoc CFE_SUCCESS            \endcode
** \retcode #CFE_ES_ERR_MEM_HANDLE      \retdesc \copydoc CFE_ES_ERR_MEM_HANDLE  \endcode
** \endreturns
**
** \sa #CFE_ES_PoolCreate, #CFE_ES_PoolCreateNoSem, #CFE_ES_PoolCreateEx, #CFE_ES_GetPoolBuf, #CFE_ES_PutPoolBuf
**
******************************************************************************/
    pub fn CFE_ES_GetMemPoolStats(BufPtr: *mut CFE_ES_MemPoolStats_t,
                                  Handle: CFE_ES_MemHandle_t) -> int32;
}
extern "C" {
    /*****************************************************************************/
/**
** \brief Function called by CFE_ES_PerfLogEntry and CFE_ES_PerfLogExit macros
**
** \par Description
**        This function logs the entry and exit marker for the specified 
**        \c id. This function is used by the Software Performance Analysis 
**        tool (see section 5.15).    
**
** \par Assumptions, External Events, and Notes:
**        None
**
** \param[in]   Marker          Identifier of the specific event or marker.
** \param[in]   EntryExit       Used to specify Entry(0) or Exit(1)
**
** \sa #CFE_ES_PerfLogEntry, #CFE_ES_PerfLogExit
**
******************************************************************************/
    pub fn CFE_ES_PerfLogAdd(Marker: uint32, EntryExit: uint32);
}
extern "C" {
    /*****************************************************************************/
/**
** \brief Register a generic counter
**
** \par Description
**        This routine registers a generic counter. 
**
** \par Assumptions, External Events, and Notes:
**        None.
**
** \param[in]  *CounterName   The Name of the generic counter.
**
** \param[out] *CounterIdPtr  The Counter Id of the newly created counter.
**
** \returns
** \retcode #CFE_SUCCESS                \retdesc \copydoc CFE_SUCCESS            \endcode
** \retcode #CFE_ES_BAD_ARGUMENT      \retdesc \copydoc CFE_ES_BAD_ARGUMENT  \endcode
** \endreturns
**
** \sa #CFE_ES_IncrementGenCounter, #CFE_ES_DeleteGenCounter, #CFE_ES_SetGenCount, #CFE_ES_GetGenCount, #CFE_ES_GetGenCounterIDByName
**
******************************************************************************/
    pub fn CFE_ES_RegisterGenCounter(CounterIdPtr: *mut uint32,
                                     CounterName:
                                         *const ::std::os::raw::c_char)
     -> int32;
}
extern "C" {
    /*****************************************************************************/
/**
** \brief Delete a generic counter
**
** \par Description
**        This routine deletes a previously registered generic counter. 
**
** \par Assumptions, External Events, and Notes:
**        None.
**
** \param[in]  CounterId     The Counter Id of the newly created counter.
**
** \returns
** \retcode #CFE_SUCCESS                \retdesc \copydoc CFE_SUCCESS            \endcode
** \retcode #CFE_ES_BAD_ARGUMENT      \retdesc \copydoc CFE_ES_BAD_ARGUMENT  \endcode
** \endreturns
**
** \sa #CFE_ES_IncrementGenCounter, #CFE_ES_RegisterGenCounter, #CFE_ES_SetGenCount, #CFE_ES_GetGenCount, #CFE_ES_GetGenCounterIDByName
**
******************************************************************************/
    pub fn CFE_ES_DeleteGenCounter(CounterId: uint32) -> int32;
}
extern "C" {
    /*****************************************************************************/
/**
** \brief Increments the specified generic counter
**
** \par Description
**        This routine increments the specified generic counter. 
**
** \par Assumptions, External Events, and Notes:
**        None.
**
** \param[in]   CounterId    The Counter to be incremented.
**
** \returns
** \retcode #CFE_SUCCESS                \retdesc \copydoc CFE_SUCCESS            \endcode
** \retcode #CFE_ES_BAD_ARGUMENT      \retdesc \copydoc CFE_ES_BAD_ARGUMENT  \endcode
** \endreturns
**
** \sa #CFE_ES_RegisterGenCounter, #CFE_ES_DeleteGenCounter, #CFE_ES_SetGenCount, #CFE_ES_GetGenCount, #CFE_ES_GetGenCounterIDByName
**
******************************************************************************/
    pub fn CFE_ES_IncrementGenCounter(CounterId: uint32) -> int32;
}
extern "C" {
    /*****************************************************************************/
/**
** \brief Set the specified generic counter
**
** \par Description
**        This routine sets the specified generic counter to the specified value. 
**
** \par Assumptions, External Events, and Notes:
**        None.
**
** \param[in]   CounterId    The Counter to be set.
**
** \param[in]   Count        The new value of the Counter.
**
** \returns
** \retcode #CFE_SUCCESS                \retdesc \copydoc CFE_SUCCESS            \endcode
** \retcode #CFE_ES_BAD_ARGUMENT      \retdesc \copydoc CFE_ES_BAD_ARGUMENT  \endcode
** \endreturns
**
** \sa #CFE_ES_RegisterGenCounter, #CFE_ES_DeleteGenCounter, #CFE_ES_IncrementGenCounter, #CFE_ES_GetGenCount, #CFE_ES_GetGenCounterIDByName
**
******************************************************************************/
    pub fn CFE_ES_SetGenCount(CounterId: uint32, Count: uint32) -> int32;
}
extern "C" {
    /*****************************************************************************/
/**
** \brief Get the specified generic counter count
**
** \par Description
**        This routine gets the value of a generic counter. 
**
** \par Assumptions, External Events, and Notes:
**        None.
**
** \param[in]   CounterId    The Counter to get the value from.
**
** \param[in]   *Count     The value of the Counter.
**
** \returns
** \retcode #CFE_SUCCESS                \retdesc \copydoc CFE_SUCCESS            \endcode
** \retcode #CFE_ES_BAD_ARGUMENT      \retdesc \copydoc CFE_ES_BAD_ARGUMENT  \endcode
** \endreturns
**
** \sa #CFE_ES_RegisterGenCounter, #CFE_ES_DeleteGenCounter, #CFE_ES_SetGenCount, #CFE_ES_IncrementGenCounter, #CFE_ES_GetGenCounterIDByName
**
******************************************************************************/
    pub fn CFE_ES_GetGenCount(CounterId: uint32, Count: *mut uint32) -> int32;
}
extern "C" {
    /*****************************************************************************/
/**
** \brief Get the Id associated with a generic counter name
**
** \par Description
**        This routine gets the Counter Id for a generic counter specified by name.
**
** \par Assumptions, External Events, and Notes:
**        None.
**
** \param[in]   *CounterName     The name of the Counter.
**
** \param[out]  *CounterIdPtr    The Counter Id for the given name.
**
** \returns
** \retcode #CFE_SUCCESS                \retdesc \copydoc CFE_SUCCESS            \endcode
** \retcode #CFE_ES_BAD_ARGUMENT      \retdesc \copydoc CFE_ES_BAD_ARGUMENT  \endcode
** \endreturns
**
** \sa #CFE_ES_RegisterGenCounter, #CFE_ES_DeleteGenCounter, #CFE_ES_SetGenCount, #CFE_ES_IncrementGenCounter, #CFE_ES_GetGenCount
******************************************************************************/
    pub fn CFE_ES_GetGenCounterIDByName(CounterIdPtr: *mut uint32,
                                        CounterName:
                                            *const ::std::os::raw::c_char)
     -> int32;
}
extern "C" {
    /*****************************************************************************/
/**
** \brief Process an exception detected by the underlying OS/PSP
**
** \par Description
**        This hook routine is called from the PSP when an exception occurs
**
** \par Assumptions, External Events, and Notes:
**        None.
**
** \param[in]   HostTaskId       The OS (not OSAL) task ID
** \param[in]   ReasonString     Identifier from PSP
** \param[in]   ContextPointer   Context data from PSP
** \param[in]   ContextSize      Size of context data from PSP
**
******************************************************************************/
    pub fn CFE_ES_ProcessCoreException(HostTaskId: uint32,
                                       ReasonString:
                                           *const ::std::os::raw::c_char,
                                       ContextPointer: *const uint32,
                                       ContextSize: uint32);
}
/** 
**  \brief Data structure used to hold system time values
**
**  \par Description
**       The #CFE_TIME_SysTime_t data structure is used to hold time
**       values.  Time is referred to as the elapsed time (in seconds
**       and subseconds) since a specified epoch time.  The subseconds
**       field contains the number of 2^(-32) second intervals that have
**       elapsed since the epoch.
**
*/
#[repr(C)]
#[derive(Debug, Copy)]
pub struct CFE_TIME_SysTime_t {
    /**< \brief Number of seconds since epoch */
    pub Seconds: uint32,
    /**< \brief Number of subseconds since epoch (LSB = 2^(-32) seconds) */
    pub Subseconds: uint32,
}
#[test]
fn bindgen_test_layout_CFE_TIME_SysTime_t() {
    assert_eq!(::std::mem::size_of::<CFE_TIME_SysTime_t>() , 8usize , concat !
               ( "Size of: " , stringify ! ( CFE_TIME_SysTime_t ) ));
    assert_eq! (::std::mem::align_of::<CFE_TIME_SysTime_t>() , 4usize , concat
                ! ( "Alignment of " , stringify ! ( CFE_TIME_SysTime_t ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const CFE_TIME_SysTime_t ) ) . Seconds as *
                const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( CFE_TIME_SysTime_t ) ,
                "::" , stringify ! ( Seconds ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const CFE_TIME_SysTime_t ) ) . Subseconds as *
                const _ as usize } , 4usize , concat ! (
                "Alignment of field: " , stringify ! ( CFE_TIME_SysTime_t ) ,
                "::" , stringify ! ( Subseconds ) ));
}
impl Clone for CFE_TIME_SysTime_t {
    fn clone(&self) -> Self { *self }
}
#[repr(i32)]
/** 
**  \brief Enumerated types identifying the quality of the current time
**
**  \par Description
**       The #CFE_TIME_ClockState_t enumerations identify the three recognized states of the current time.
**       If the clock has never been successfully synchronized with the primary onboard clock source, the
**       time is conisdered to be #CFE_TIME_INVALID.  If the time is currently synchronized (i.e. - the
**       primary synchronization mechanism has not been dropped for any significant amount of time), then
**       the current time is considered to be #CFE_TIME_VALID.  If the time had, at some point in the past,
**       been synchronized, but the synchronization with the primary onboard clock has since been lost, then
**       the time is considered to be #CFE_TIME_FLYWHEEL.  Since different clocks drift at different rates
**       from one another, the accuracy of the time while in #CFE_TIME_FLYWHEEL is dependent upon the time
**       spent in that state.
*/
#[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
pub enum CFE_TIME_ClockState_t {
    CFE_TIME_INVALID = -1,
    CFE_TIME_VALID = 0,
    CFE_TIME_FLYWHEEL = 1,
}
#[repr(i32)]
/** 
**  \brief Enumerated types identifying the relative relationships of two times
**
**  \par Description
**       Since time fields contain numbers that are relative to an epoch time, then it is possible for a time value
**       to be "negative".  This can lead to some confusion about what relationship exists between two time values.
**       To resolve this confusion, the cFE provides the API #CFE_TIME_Compare which returns these enumerated values.
*/
#[derive(Debug, Copy, Clone, PartialEq, Eq, Hash)]
pub enum CFE_TIME_Compare_t {
    CFE_TIME_A_LT_B = -1,
    CFE_TIME_EQUAL = 0,
    CFE_TIME_A_GT_B = 1,
}
/**
**  \brief Time related variables that are maintained through a Processor Reset
**
**  \par Description
**       The #CFE_TIME_ResetVars_t data structure contains those variables that are maintained
**       in an area of memory that is not cleared during a Processor Reset.  This allows the
**       cFE Time Service to maintain time to the best of its ability after a Processor Reset.
*/
#[repr(C)]
#[derive(Debug, Copy)]
pub struct CFE_TIME_ResetVars_t {
    /**< \brief Data validation signature used to verify data structure contents*/
    pub Signature: uint32,
    /**< \brief Leap seconds value */
    pub LeapSeconds: int16,
    /**< \brief Current clock signal selection */
    pub ClockSignal: uint16,
    /**< \brief Current Mission Elapsed Time (MET) */
    pub CurrentMET: CFE_TIME_SysTime_t,
    /**< \brief Current Spacecraft Time Correlation Factor (STCF) */
    pub CurrentSTCF: CFE_TIME_SysTime_t,
    /**< \brief Current time client delay value */
    pub CurrentDelay: CFE_TIME_SysTime_t,
}
#[test]
fn bindgen_test_layout_CFE_TIME_ResetVars_t() {
    assert_eq!(::std::mem::size_of::<CFE_TIME_ResetVars_t>() , 32usize ,
               concat ! ( "Size of: " , stringify ! ( CFE_TIME_ResetVars_t )
               ));
    assert_eq! (::std::mem::align_of::<CFE_TIME_ResetVars_t>() , 4usize ,
                concat ! (
                "Alignment of " , stringify ! ( CFE_TIME_ResetVars_t ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const CFE_TIME_ResetVars_t ) ) . Signature as *
                const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( CFE_TIME_ResetVars_t )
                , "::" , stringify ! ( Signature ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const CFE_TIME_ResetVars_t ) ) . LeapSeconds as
                * const _ as usize } , 4usize , concat ! (
                "Alignment of field: " , stringify ! ( CFE_TIME_ResetVars_t )
                , "::" , stringify ! ( LeapSeconds ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const CFE_TIME_ResetVars_t ) ) . ClockSignal as
                * const _ as usize } , 6usize , concat ! (
                "Alignment of field: " , stringify ! ( CFE_TIME_ResetVars_t )
                , "::" , stringify ! ( ClockSignal ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const CFE_TIME_ResetVars_t ) ) . CurrentMET as
                * const _ as usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( CFE_TIME_ResetVars_t )
                , "::" , stringify ! ( CurrentMET ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const CFE_TIME_ResetVars_t ) ) . CurrentSTCF as
                * const _ as usize } , 16usize , concat ! (
                "Alignment of field: " , stringify ! ( CFE_TIME_ResetVars_t )
                , "::" , stringify ! ( CurrentSTCF ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const CFE_TIME_ResetVars_t ) ) . CurrentDelay
                as * const _ as usize } , 24usize , concat ! (
                "Alignment of field: " , stringify ! ( CFE_TIME_ResetVars_t )
                , "::" , stringify ! ( CurrentDelay ) ));
}
impl Clone for CFE_TIME_ResetVars_t {
    fn clone(&self) -> Self { *self }
}
/**
**   \brief Time Synchronization Callback Function Ptr Type
**
**   \par Description
**        Applications that wish to get direct notification of the receipt of the cFE Time Synchronization signal
**        (typically a 1 Hz signal), must register a callback function with the following prototype via the
**        #CFE_TIME_RegisterSynchCallback API.
*/
pub type CFE_TIME_SynchCallbackPtr_t =
    ::std::option::Option<unsafe extern "C" fn() -> int32>;
extern "C" {
    /*****************************************************************************/
/**
** \brief Get the current spacecraft time
**
** \par Description
**        This routine returns the current spacecraft time.  The time returned 
**        is either TAI (no leap seconds) or UTC (including leap seconds).  This choice
**        is made in the mission configuration file by defining either #CFE_TIME_CFG_DEFAULT_TAI
**        or #CFE_TIME_CFG_DEFAULT_UTC as TRUE at compile time.  To maintain re-usability 
**        across missions, most applications should be using this function 
**        (or #CFE_TIME_GetTime) rather than the specific routines for getting UTC/TAI directly.
**
** \par Assumptions, External Events, and Notes:
**          None
**
** \returns
** \retcode #CFE_TIME_SysTime_t  \retdesc  The current spacecraft time   \endcode
** \endreturns
**
** \sa #CFE_TIME_GetTAI, #CFE_TIME_GetUTC, #CFE_TIME_GetMET, 
**     #CFE_TIME_GetMETseconds, #CFE_TIME_GetMETsubsecs
**
******************************************************************************/
    pub fn CFE_TIME_GetTime() -> CFE_TIME_SysTime_t;
}
extern "C" {
    /*****************************************************************************/
/**
** \brief Get the current TAI time
**
** \par Description
**        This routine returns the current TAI time to the caller.  TAI is an 
**        international time standard that does not include leap seconds.  
**        This routine should only be used in situations where TAI is absolutely 
**        required.  Applications that call #CFE_TIME_GetTAI() may not be portable 
**        to all missions.  Maintenance of correct TAI in flight is not guaranteed 
**        under all mission operations scenarios.  To maintain re-usability across 
**        missions, most applications should be using #CFE_TIME_GetTime(), rather 
**        than the specific routines for getting UTC/TAI directly.
**
** \par Assumptions, External Events, and Notes:
**          -# The "TAI" time returned is referenced to the mission-defined time epoch, 
**             which may or may not be the same as the standard TAI epoch.
**          -# Even though TAI does not include leap seconds, the time returned by this 
**             function can still jump forward or backward without warning when the 
**             spacecraft clock is set or adjusted by operators.  Applications using 
**             this function must be able to handle these time discontinuities gracefully.
**
** \returns
** \retcode #CFE_TIME_SysTime_t  \retdesc  The current TAI time   \endcode
** \endreturns
**
** \sa #CFE_TIME_GetTime, #CFE_TIME_GetUTC, #CFE_TIME_GetMET, 
**     #CFE_TIME_GetMETseconds, #CFE_TIME_GetMETsubsecs
**
******************************************************************************/
    pub fn CFE_TIME_GetTAI() -> CFE_TIME_SysTime_t;
}
extern "C" {
    /*****************************************************************************/
/**
** \brief Get the current UTC time
**
** \par Description
**        This routine returns the current UTC time to the caller.  This routine 
**        should only be used in situations where UTC is absolutely required.  
**        Applications that call #CFE_TIME_GetUTC() may not be portable to all 
**        missions.  Maintenance of correct UTC in flight is not guaranteed under 
**        all mission operations scenarios.  If UTC is maintained in flight, it will 
**        jump backwards occasionally due to leap second adjustments.  To maintain 
**        re-usability across missions, most applications should be using 
**        #CFE_TIME_GetTime(), rather than the specific routines for getting 
**        UTC/TAI directly.
**
** \par Assumptions, External Events, and Notes:
**          Note: The "UTC" time returned is referenced to the mission-defined time epoch, 
**                which may or may not be the same as the standard UTC epoch.
**
** \returns
** \retcode #CFE_TIME_SysTime_t  \retdesc The current UTC time   \endcode            
** \endreturns
**
** \sa #CFE_TIME_GetTime, #CFE_TIME_GetTAI, #CFE_TIME_GetMET, 
**     #CFE_TIME_GetMETseconds, #CFE_TIME_GetMETsubsecs
**
******************************************************************************/
    pub fn CFE_TIME_GetUTC() -> CFE_TIME_SysTime_t;
}
extern "C" {
    /*****************************************************************************/
/**
** \brief Convert specified MET into Spacecraft Time
**
** \par Description
**        This function returns Spacecraft Time given MET.  Note that Spacecraft 
**        Time is returned as either UTC or TAI depeneding on whether the mission
**        configuration parameter #CFE_TIME_CFG_DEFAULT_UTC or #CFE_TIME_CFG_DEFAULT_TAI
**        was set to TRUE at compile time.
**
** \par Assumptions, External Events, and Notes:
**          None
**
** \param[in] METTime      The MET to be converted.
**
** \returns
** \retcode #CFE_TIME_SysTime_t  \retdesc  Spacecraft Time (UTC or TAI) corresponding to the specified MET   \endcode
** \endreturns
**
** \sa #CFE_TIME_GetMET, #CFE_TIME_GetMETseconds, #CFE_TIME_GetMETsubsecs,
**     #CFE_TIME_Sub2MicroSecs, #CFE_TIME_Micro2SubSecs, #CFE_TIME_CFE2FSSeconds, #CFE_TIME_FS2CFESeconds
**
******************************************************************************/
    pub fn CFE_TIME_MET2SCTime(METTime: CFE_TIME_SysTime_t)
     -> CFE_TIME_SysTime_t;
}
extern "C" {
    /*****************************************************************************/
/**
** \brief Get the current value of the spacecraft time correction factor (STCF).
**
** \par Description
**        This routine returns the current value of the spacecraft time correction 
**        factor.  This is the delta time between the MET and the TAI time.  
**        Applications cannot set or adjust the STCF; that can only be done 
**        through ground commands.  However, science applications may want to 
**        include the STCF in their data products to aid in time correlation 
**        during downstream science data processing. 
**
** \par Assumptions, External Events, and Notes:
**          None
**
** \returns
** \retcode #CFE_TIME_SysTime_t  \retdesc  The current STCF    \endcode
** \endreturns
**
** \sa #CFE_TIME_GetLeapSeconds, #CFE_TIME_GetClockState, #CFE_TIME_GetClockInfo
**               
******************************************************************************/
    pub fn CFE_TIME_GetSTCF() -> CFE_TIME_SysTime_t;
}
extern "C" {
    /*****************************************************************************/
/**
** \brief Get the current value of the Mission Elapsed Time (MET).
**
** \par Description
**        This routine returns the current mission-elapsed time (MET).  MET is 
**        usually derived from a hardware-based clock that is not adjusted 
**        during normal operations.  Callers of this routine should not assume 
**        that the MET return value has any specific relationship to any 
**        ground-based time standard. 
**
** \par Assumptions, External Events, and Notes:
**          None
**
** \returns
** \retcode #CFE_TIME_SysTime_t  \retdesc  The current MET    \endcode
** \endreturns
**
** \sa #CFE_TIME_GetTime, #CFE_TIME_GetTAI, #CFE_TIME_GetUTC, 
**     #CFE_TIME_GetMETseconds, #CFE_TIME_GetMETsubsecs, #CFE_TIME_MET2SCTime
**
******************************************************************************/
    pub fn CFE_TIME_GetMET() -> CFE_TIME_SysTime_t;
}
extern "C" {
    /*****************************************************************************/
/**
** \brief Get the current seconds count of the mission-elapsed time.
**
** \par Description
**        This routine is the same as #CFE_TIME_GetMET(), except that it 
**        returns only the integer seconds portion of the MET time. 
**
** \par Assumptions, External Events, and Notes:
**          None
**
** \returns
** \retstmt The current MET seconds   \endstmt             
** \endreturns
**
** \sa #CFE_TIME_GetTime, #CFE_TIME_GetTAI, #CFE_TIME_GetUTC, #CFE_TIME_GetMET, 
**     #CFE_TIME_GetMETsubsecs, #CFE_TIME_MET2SCTime
**
******************************************************************************/
    pub fn CFE_TIME_GetMETseconds() -> uint32;
}
extern "C" {
    /*****************************************************************************/
/**
** \brief Get the current sub-seconds count of the mission-elapsed time.
**
** \par Description
**        This routine is the same as #CFE_TIME_GetMET(), except that it 
**        returns only the integer sub-seconds portion of the MET time.
**        Each count is equal to 2^(-32) seconds. 
**
** \par Assumptions, External Events, and Notes:
**          None
**
** \returns
** \retstmt The current MET sub-seconds  \endstmt              
** \endreturns
**
** \sa #CFE_TIME_GetTime, #CFE_TIME_GetTAI, #CFE_TIME_GetUTC, #CFE_TIME_GetMET, 
**     #CFE_TIME_GetMETseconds, #CFE_TIME_MET2SCTime
**
******************************************************************************/
    pub fn CFE_TIME_GetMETsubsecs() -> uint32;
}
extern "C" {
    /*****************************************************************************/
/**
** \brief Get the current value of the leap seconds counter.
**
** \par Description
**        This routine returns the current value of the leap seconds counter.  
**        This is the delta seconds between international atomic time (TAI) 
**        and universal coordinated time (UTC).  Applications cannot set or 
**        adjust the leap seconds; that can only be done through ground commands.  
**        However, science applications may want to include the leap seconds 
**        counter in their data products to aid in time correlation during 
**        downstream science data processing.  Note that some mission operations 
**        teams do not maintain the leap seconds count, preferring to adjust the 
**        STCF instead.  Users of this function should check with their mission 
**        ops team to see how they are planning to handle leap seconds. 
**
** \par Assumptions, External Events, and Notes:
**          None
**
** \returns
** \retstmt The current leap seconds.   \endstmt
** \endreturns
**
** \sa #CFE_TIME_GetSTCF, #CFE_TIME_GetClockState, #CFE_TIME_GetClockInfo
**               
******************************************************************************/
    pub fn CFE_TIME_GetLeapSeconds() -> int16;
}
extern "C" {
    /*****************************************************************************/
/**
** \brief Get the current state of the spacecraft clock.
**
** \par Description
**        This routine returns the spacecraft clock state.  Applications that 
**        are highly dependent on valid time may want to call this routine 
**        before taking actions based on the times returned by the various 
**        clock routines 
**
** \par Assumptions, External Events, and Notes:
**          None
**
** \returns
** \retcode #CFE_TIME_ClockState_t \retdesc The current spacecraft clock state    \endcode
** \endreturns
**
** \sa #CFE_TIME_GetSTCF, #CFE_TIME_GetLeapSeconds, #CFE_TIME_GetClockInfo
**               
******************************************************************************/
    pub fn CFE_TIME_GetClockState() -> CFE_TIME_ClockState_t;
}
extern "C" {
    /*****************************************************************************/
/**
** \brief Provides information about the spacecraft clock.
**
** \par Description
**        This routine returns information on the spacecraft clock in a bit mask. 
**
** \par Assumptions, External Events, and Notes:
**          None
**
** \returns
** \retstmt Spacecraft clock information.  To extract the information from the
**         returned value, the following masks can be used as in the following: <br>
**         <tt> if ((ReturnValue & CFE_TIME_FLAG_xxxxxx) == CFE_TIME_FLAG_xxxxxx)</tt> then 
**            the following definition of the \c CFE_TIME_FLAG_xxxxxx is true. <br>  \endstmt
** \retcode  #CFE_TIME_FLAG_CLKSET \retdesc \copydoc CFE_TIME_FLAG_CLKSET \endcode
** \retcode  #CFE_TIME_FLAG_FLYING \retdesc \copydoc CFE_TIME_FLAG_FLYING \endcode
** \retcode  #CFE_TIME_FLAG_SRCINT \retdesc \copydoc CFE_TIME_FLAG_SRCINT \endcode
** \retcode  #CFE_TIME_FLAG_SIGPRI \retdesc \copydoc CFE_TIME_FLAG_SIGPRI \endcode
** \retcode  #CFE_TIME_FLAG_SRVFLY \retdesc \copydoc CFE_TIME_FLAG_SRVFLY \endcode
** \retcode  #CFE_TIME_FLAG_CMDFLY \retdesc \copydoc CFE_TIME_FLAG_CMDFLY \endcode
** \retcode  #CFE_TIME_FLAG_ADDADJ \retdesc \copydoc CFE_TIME_FLAG_ADDADJ \endcode
** \retcode  #CFE_TIME_FLAG_ADD1HZ \retdesc \copydoc CFE_TIME_FLAG_ADD1HZ \endcode
** \retcode  #CFE_TIME_FLAG_ADDTCL \retdesc \copydoc CFE_TIME_FLAG_ADDTCL \endcode
** \retcode  #CFE_TIME_FLAG_SERVER \retdesc \copydoc CFE_TIME_FLAG_SERVER \endcode
** \retcode  #CFE_TIME_FLAG_GDTONE \retdesc \copydoc CFE_TIME_FLAG_GDTONE \endcode
** \retcode  #CFE_TIME_FLAG_UNUSED \retdesc \copydoc CFE_TIME_FLAG_UNUSED \endcode    
** \endreturns
**
** \sa #CFE_TIME_GetSTCF, #CFE_TIME_GetLeapSeconds, #CFE_TIME_GetClockState
**               
******************************************************************************/
    pub fn CFE_TIME_GetClockInfo() -> uint16;
}
extern "C" {
    /*****************************************************************************/
/**
** \brief Adds two time values
**
** \par Description
**        This routine adds the two specified times and returns the result.  
**        Normally, at least one of the input times should be a value representing 
**        a delta time.  Adding two absolute times together will not cause an error, 
**        but the result will probably be meaningless. 
**
** \par Assumptions, External Events, and Notes:
**          None
**
** \param[in] Time1   The first time to be added.
**
** \param[in] Time2   The second time to be added.
**
** \returns
** \retstmt The sum of the two times, in the #CFE_TIME_SysTime_t format described above.  
**         If the sum is greater than the maximum value that can be stored in a 
**         #CFE_TIME_SysTime_t, the result will roll over (this is not considered an error).  \endstmt
** \endreturns
**
** \sa #CFE_TIME_Subtract, #CFE_TIME_Compare
**                
******************************************************************************/
    pub fn CFE_TIME_Add(Time1: CFE_TIME_SysTime_t, Time2: CFE_TIME_SysTime_t)
     -> CFE_TIME_SysTime_t;
}
extern "C" {
    /*****************************************************************************/
/**
** \brief Subtracts two time values
**
** \par Description
**        This routine subtracts time2 from time1 and returns the result.  The 
**        time values can represent either absolute or delta times, but not all 
**        combinations make sense.
**           -  AbsTime - AbsTime = DeltaTime
**           -  AbsTime - DeltaTime = AbsTime
**           -  DeltaTime - DeltaTime = DeltaTime
**           -  DeltaTime - AbsTime = garbage
**
** \par Assumptions, External Events, and Notes:
**          None
**
** \param[in] Time1   The base time.
**
** \param[in] Time2   The time to be subtracted from the base time.
**
** \returns
** \retstmt The result of subtracting the two times, in the #CFE_TIME_SysTime_t 
**         format.  If the subtraction results in an underflow, the result will 
**         roll over (this is not considered an error).    \endstmt            
** \endreturns
**
** \sa #CFE_TIME_Add, #CFE_TIME_Compare
**                
******************************************************************************/
    pub fn CFE_TIME_Subtract(Time1: CFE_TIME_SysTime_t,
                             Time2: CFE_TIME_SysTime_t) -> CFE_TIME_SysTime_t;
}
extern "C" {
    /*****************************************************************************/
/**
** \brief Compares two time values
**
** \par Description
**        This routine compares two time values to see which is "greater".  It 
**        is important that applications use this function rather than trying 
**        to directly compare the component pieces of times.  This function will 
**        handle roll-over cases seamlessly, which may not be intuitively obvious.
**        The cFE's internal representation of time "rolls over" when the 32 bit 
**        seconds count reaches 0xFFFFFFFF.  Also, subtracting a delta time from 
**        an absolute time close to the epoch could result in "roll under".  The 
**        strange cases that result from these situations can be handled by defining 
**        the comparison function for times as follows:
**        Plot the two times on the circumference of a circle where 0 is at the 
**        top and 0x80000000 is at the bottom.  If the shortest arc from time A 
**        to time B runs clockwise around the circle, then time A is less than 
**        time B.  If the shortest arc from A to B runs counter-clockwise, then 
**        time A is greater than time B.
**
** \par Assumptions, External Events, and Notes:
**          None
**
** \param[in] TimeA   The first time to compare.
**
** \param[in] TimeB   The second time to compare.
**
** \returns
** \retstmt The result of comparing the two times, one of: \endstmt
** \retcode #CFE_TIME_EQUAL  \retdesc \copydoc CFE_TIME_EQUAL  \endcode
** \retcode #CFE_TIME_A_GT_B \retdesc \copydoc CFE_TIME_A_GT_B \endcode
** \retcode #CFE_TIME_A_LT_B \retdesc \copydoc CFE_TIME_A_LT_B \endcode             
** \endreturns
**
** \sa #CFE_TIME_Add, #CFE_TIME_Subtract
**                
******************************************************************************/
    pub fn CFE_TIME_Compare(TimeA: CFE_TIME_SysTime_t,
                            TimeB: CFE_TIME_SysTime_t) -> CFE_TIME_Compare_t;
}
extern "C" {
    /*****************************************************************************/
/**
** \brief Converts a sub-seconds count to an equivalent number of microseconds
**
** \par Description
**        This routine converts from a sub-seconds count 
**        (each tick is 1 / 2^32 seconds) to microseconds (each tick is 1e-06 seconds).
**
** \par Assumptions, External Events, and Notes:
**          None
**
** \param[in] SubSeconds   The sub-seconds count to convert.
**
** \returns
** \retstmt The equivalent number of microseconds.    \endstmt            
** \endreturns
**
** \sa #CFE_TIME_MET2SCTime, #CFE_TIME_Micro2SubSecs, 
**     #CFE_TIME_CFE2FSSeconds, #CFE_TIME_FS2CFESeconds
**
******************************************************************************/
    pub fn CFE_TIME_Sub2MicroSecs(SubSeconds: uint32) -> uint32;
}
extern "C" {
    /*****************************************************************************/
/**
** \brief Converts a number of microseconds to an equivalent sub-seconds count.
**
** \par Description
**        This routine converts from microseconds (each tick is 1e-06 seconds) 
**        to a subseconds count (each tick is 1 / 2^32 seconds).
**
** \par Assumptions, External Events, and Notes:
**          None
**
** \param[in] MicroSeconds   The sub-seconds count to convert.
**
** \returns
** \retstmt The equivalent number of subseconds.  If the number of microseconds 
**         passed in is greater than one second, (i.e. > 999,999), the return 
**         value is equal to \c 0xffffffff.     \endstmt           
** \endreturns
**
** \sa #CFE_TIME_MET2SCTime, #CFE_TIME_Sub2MicroSecs, 
**     #CFE_TIME_CFE2FSSeconds, #CFE_TIME_FS2CFESeconds
**
******************************************************************************/
    pub fn CFE_TIME_Micro2SubSecs(MicroSeconds: uint32) -> uint32;
}
extern "C" {
    /*****************************************************************************/
/**
** \brief Converts cFE seconds into the File System's seconds
**
** \par Description
**        File systems use specific time epochs for their time tagging of files.
**        Since spacecraft systems rarely use an epoch that matches a particular
**        file system, this function provides a mechanism to translate a given
**        spacecraft time (in seconds) to the file system's time.  The conversion
**        is controlled by the configuration parameter #CFE_TIME_FS_FACTOR which
**        is set equal to the number of seconds between the spacecraft's epoch and
**        the file system's epoch.
**
** \par Assumptions, External Events, and Notes:
**          None
**
** \param[in] SecondsCFE   The spacecraft time, in seconds, to be converted.
**
** \returns
** \retstmt The equivalent time, in seconds, for the file system.    \endstmt            
** \endreturns
**
** \sa #CFE_TIME_MET2SCTime, #CFE_TIME_Sub2MicroSecs, #CFE_TIME_Micro2SubSecs, 
**     #CFE_TIME_FS2CFESeconds
**
******************************************************************************/
    pub fn CFE_TIME_CFE2FSSeconds(SecondsCFE: uint32) -> uint32;
}
extern "C" {
    /*****************************************************************************/
/**
** \brief Converts a file system's seconds into cFE seconds
**
** \par Description
**        File systems use specific time epochs for their time tagging of files.
**        Since spacecraft systems rarely use an epoch that matches a particular
**        file system, this function provides a mechanism to translate a file
**        system time (in seconds) into the spacecraft time (in seconds).  The 
**        conversion is controlled by the configuration parameter #CFE_TIME_FS_FACTOR 
**        which is set equal to the number of seconds between the spacecraft's epoch and
**        the file system's epoch.
**
** \par Assumptions, External Events, and Notes:
**          None
**
** \param[in] SecondsFS   The file system time, in seconds, to be converted.
**
** \returns
** \retstmt The equivalent time, in seconds, for the spacecraft.    \endstmt
** \endreturns
**
** \sa #CFE_TIME_MET2SCTime, #CFE_TIME_Sub2MicroSecs, #CFE_TIME_Micro2SubSecs, 
**     #CFE_TIME_CFE2FSSeconds
**
******************************************************************************/
    pub fn CFE_TIME_FS2CFESeconds(SecondsFS: uint32) -> uint32;
}
extern "C" {
    /*****************************************************************************/
/**
** \brief Print a time value as a string
**
** \par Description
**        This routine prints the specified time to the specified string buffer 
**        in the following format: <br> <br>
**           \c yyyy-ddd-hh:mm:ss.xxxxx\\0 <br> <br>
**        where:
**           - \c yyyy = year
**           - \c ddd = Julian day of the year
**           - \c hh = hour of the day (0 to 23)
**           - \c mm = minute (0 to 59)
**           - \c ss = second (0 to 59)
**           - \c xxxxx = subsecond formatted as a decimal fraction (1/4 second = 0.25000)
**           - \c \\0 = trailing null
**
** \par Assumptions, External Events, and Notes:
**          None
**
** \param[in]  PrintBuffer   Pointer to a character array of at least 
**                           #CFE_TIME_PRINTED_STRING_SIZE characters in length
**
** \param[in]  TimeToPrint   The time to print into the character array.
**
** \param[out] *PrintBuffer  The time as a character string as described above.
**
** \sa
**                
******************************************************************************/
    pub fn CFE_TIME_Print(PrintBuffer: *mut ::std::os::raw::c_char,
                          TimeToPrint: CFE_TIME_SysTime_t);
}
extern "C" {
    /*****************************************************************************/
/**
** \brief Provides the 1 Hz signal from an external source
**
** \par Description
**        This routine provides a method for cFE TIME software to be notified 
**        of the occurance of the 1Hz tone signal without knowledge of the 
**        specific hardware design.  Regardless of the source of the tone, 
**        this routine should be called as soon as possible after detection 
**        to allow cFE TIME software the opportunity to latch the local clock 
**        as close as possible to the instant of the tone.
**
** \par Assumptions, External Events, and Notes:
**          - This routine may be called directly from within the context of an
**            interrupt handler.
**
** \sa #CFE_TIME_ExternalMET, #CFE_TIME_ExternalGPS, #CFE_TIME_ExternalTime
**                
******************************************************************************/
    pub fn CFE_TIME_ExternalTone();
}
extern "C" {
    /*****************************************************************************/
/**
** \brief Provides the Mission Elapsed Time from an external source
**
** \par Description
**        This routine provides a method to provide cFE TIME with MET acquired 
**        from an external source.  There is a presumption that this function 
**        will be called at the appropriate time (relative to the tone) such 
**        that this call may be used by cFE TIME as the signal to generate the 
**        "time at the tone" data command.  The "time at the tone" data command 
**        must arrive within the configuration parameter specified window for 
**        tone signal and data packet verification. <br> <br>
**        The MET value at the tone "should" have zero subseconds.  Although the 
**        interface accepts non-zero values for sub-seconds, it may be harmful 
**        to other applications that expect zero subseconds at the moment of the 
**        tone.  Any decision to use non-zero subseconds should be carefully considered.
**
** \par Assumptions, External Events, and Notes:
**          - This routine is included in the API only when 3 specific configuration 
**            parameters are set to TRUE.  The first is #CFE_TIME_CFG_SERVER which defines 
**            this instantiation of cFE TIME as a time server (not a client).  The 
**            second required configuration parameter is #CFE_TIME_CFG_SOURCE which 
**            enables time source selection commands to the cFE TIME task, and further 
**            enables configuration definitions for the selected type of external time 
**            data.  The third configuration parameter required for this routine is 
**            #CFE_TIME_CFG_SRC_MET, which indicates that the external time data consists 
**            of MET.
**
** \param[in]  NewMET   The MET value at the next (or previous) 1 Hz tone signal.
**
** \sa #CFE_TIME_ExternalTone, #CFE_TIME_ExternalGPS, #CFE_TIME_ExternalTime
**                
******************************************************************************/
    pub fn CFE_TIME_ExternalMET(NewMET: CFE_TIME_SysTime_t);
}
extern "C" {
    /*****************************************************************************/
/**
** \brief Provide the time from an external source that has data common to GPS receivers.
**
** \par Description
**        This routine provides a method to provide cFE TIME with current time 
**        data acquired from an external source.  There is a presumption that 
**        this function will be called at the appropriate time (relative to the 
**        tone) such that this call may be used by cFE TIME as the signal to 
**        generate the "time at the tone" data command.  The "time at the tone" 
**        data command must arrive within the configuration parameter specified 
**        window for tone signal and data packet verification. <br> <br>
**        Internally, cFE TIME will calculate a new STCF as the difference between 
**        this new time value and the spacecraft MET value at the tone.  This allows 
**        cFE TIME to always calculate time as the sum of MET and STCF.  The value 
**        of STCF will change only as much as the drift factor between spacecraft 
**        MET and the external time source.
**
** \par Assumptions, External Events, and Notes:
**          - This routine is included in the API only when 3 specific configuration 
**            parameters are set to TRUE.  The first is #CFE_TIME_CFG_SERVER which defines this 
**            instantiation of cFE TIME as a time server (not a client).  The second 
**            required configuration parameter is #CFE_TIME_CFG_SOURCE which enables 
**            time source selection commands to the cFE TIME task, and further enables 
**            configuration definitions for the selected type of external time data.  
**            The third configuration parameter required for this routine is 
**            #CFE_TIME_CFG_SRC_GPS, which indicates that the external time data consists 
**            of a time value relative to a known epoch, plus a leap seconds value.
**
** \param[in]  NewTime   The MET value at the next (or previous) 1 Hz tone signal.
**
** \param[in]  NewLeaps The Leap Seconds value used to calculate time as UTC.
**
** \sa #CFE_TIME_ExternalTone, #CFE_TIME_ExternalMET, #CFE_TIME_ExternalTime
**                
******************************************************************************/
    pub fn CFE_TIME_ExternalGPS(NewTime: CFE_TIME_SysTime_t, NewLeaps: int16);
}
extern "C" {
    /*****************************************************************************/
/**
** \brief Provide the time from an external source that measures time relative to a known epoch.
**
** \par Description
**        This routine provides a method to provide cFE TIME with current time 
**        data acquired from an external source.  There is a presumption that 
**        this function will be called at the appropriate time (relative to the 
**        tone) such that this call may be used by cFE TIME as the signal to 
**        generate the "time at the tone" data command.  The "time at the tone" 
**        data command must arrive within the configuration specified window for 
**        tone signal and data packet verification. <br> <br>
**        Internally, cFE TIME will calculate a new STCF as the difference between 
**        this new time value and the spacecraft MET value at the tone.  This allows 
**        cFE TIME to always calculate time as the sum of MET and STCF.  The value 
**        of STCF will change only as much as the drift factor between spacecraft 
**        MET and the external time source.
**
** \par Assumptions, External Events, and Notes:
**          - This routine is included in the API only when 3 specific configuration 
**            parameters are set to TRUE.  The first is #CFE_TIME_CFG_SERVER which defines this 
**            instanciation of cFE TIME as a time server (not a client).  The second 
**            required configuration parameter is #CFE_TIME_CFG_SOURCE which enables 
**            time source selection commands to the cFE TIME task, and further enables 
**            configuration definitions for the selected type of external time data.  
**            The third configuration parameter required for this routine is 
**            #CFE_TIME_CFG_SRC_TIME, which indicates that the external time data consists 
**            of a time value relative to a known epoch.
**
** \param[in]  NewTime   The MET value at the next (or previous) 1 Hz tone signal.
**
** \sa #CFE_TIME_ExternalTone, #CFE_TIME_ExternalMET, #CFE_TIME_ExternalGPS
**                
******************************************************************************/
    pub fn CFE_TIME_ExternalTime(NewTime: CFE_TIME_SysTime_t);
}
extern "C" {
    /*****************************************************************************/
/**
** \brief Registers a callback function that is called whenever time synchronization occurs
**
** \par Description
**        This routine passes a callback function pointer for an Application that wishes to
**        be notified whenever a legitimate time synchronization signal (typically a 1 Hz)
**        is received.
**
** \par Assumptions, External Events, and Notes:
**          None
**
** \returns
** \retcode #CFE_SUCCESS  \retdesc \copydoc CFE_SUCCESS  \endcode
** \retcode #CFE_TIME_TOO_MANY_SYNCH_CALLBACKS \retdesc \copydoc CFE_TIME_TOO_MANY_SYNCH_CALLBACKS \endcode
** \retcode #CFE_ES_ERR_APPID  \retdesc \copydoc CFE_ES_ERR_APPID   \endcode
** \endreturns
**
** \sa #CFE_TIME_UnregisterSynchCallback
**
******************************************************************************/
    pub fn CFE_TIME_RegisterSynchCallback(CallbackFuncPtr:
                                              CFE_TIME_SynchCallbackPtr_t)
     -> int32;
}
extern "C" {
    /*****************************************************************************/
/**
** \brief Unregisters a callback function that is called whenever time synchronization occurs
**
** \par Description
**        This routine removes the specified callback function pointer from the list
**        of Callback functions that are called whenever a time synchronization (typically
**        the 1Hz signal) is received.
**
** \par Assumptions, External Events, and Notes:
**          None
**
** \returns
** \retcode #CFE_SUCCESS  \retdesc \copydoc CFE_SUCCESS  \endcode
** \retcode #CFE_TIME_CALLBACK_NOT_REGISTERED \retdesc \copydoc CFE_TIME_CALLBACK_NOT_REGISTERED \endcode
** \retcode #CFE_ES_ERR_APPID  \retdesc \copydoc CFE_ES_ERR_APPID   \endcode
** \endreturns
**
** \sa #CFE_TIME_RegisterSynchCallback
**
******************************************************************************/
    pub fn CFE_TIME_UnregisterSynchCallback(CallbackFuncPtr:
                                                CFE_TIME_SynchCallbackPtr_t)
     -> int32;
}
extern "C" {
    /*****************************************************************************/
/**
** \brief This function should be called from the system PSP layer once per second
**
** \par Description
**        Drives the time processing logic from the system PSP layer.  This must be called
**        once per second based on a hardware interrupt or OS kernel signal.
**
** \par Assumptions, External Events, and Notes:
**        This will update the global data structures accordingly, incrementing each
**        by the 1Hz amount.
**
**
******************************************************************************/
    pub fn CFE_TIME_Local1HzISR();
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct CFE_PSP_ExceptionContext_t {
    pub regs: [uint32; 32usize],
}
#[test]
fn bindgen_test_layout_CFE_PSP_ExceptionContext_t() {
    assert_eq!(::std::mem::size_of::<CFE_PSP_ExceptionContext_t>() , 128usize
               , concat ! (
               "Size of: " , stringify ! ( CFE_PSP_ExceptionContext_t ) ));
    assert_eq! (::std::mem::align_of::<CFE_PSP_ExceptionContext_t>() , 4usize
                , concat ! (
                "Alignment of " , stringify ! ( CFE_PSP_ExceptionContext_t )
                ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const CFE_PSP_ExceptionContext_t ) ) . regs as
                * const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! (
                CFE_PSP_ExceptionContext_t ) , "::" , stringify ! ( regs ) ));
}
impl Clone for CFE_PSP_ExceptionContext_t {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct CFE_PSP_MemTable_t {
    pub MemoryType: uint32,
    pub WordSize: uint32,
    pub StartAddr: cpuaddr,
    pub Size: uint32,
    pub Attributes: uint32,
}
#[test]
fn bindgen_test_layout_CFE_PSP_MemTable_t() {
    assert_eq!(::std::mem::size_of::<CFE_PSP_MemTable_t>() , 24usize , concat
               ! ( "Size of: " , stringify ! ( CFE_PSP_MemTable_t ) ));
    assert_eq! (::std::mem::align_of::<CFE_PSP_MemTable_t>() , 8usize , concat
                ! ( "Alignment of " , stringify ! ( CFE_PSP_MemTable_t ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const CFE_PSP_MemTable_t ) ) . MemoryType as *
                const _ as usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( CFE_PSP_MemTable_t ) ,
                "::" , stringify ! ( MemoryType ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const CFE_PSP_MemTable_t ) ) . WordSize as *
                const _ as usize } , 4usize , concat ! (
                "Alignment of field: " , stringify ! ( CFE_PSP_MemTable_t ) ,
                "::" , stringify ! ( WordSize ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const CFE_PSP_MemTable_t ) ) . StartAddr as *
                const _ as usize } , 8usize , concat ! (
                "Alignment of field: " , stringify ! ( CFE_PSP_MemTable_t ) ,
                "::" , stringify ! ( StartAddr ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const CFE_PSP_MemTable_t ) ) . Size as * const
                _ as usize } , 16usize , concat ! (
                "Alignment of field: " , stringify ! ( CFE_PSP_MemTable_t ) ,
                "::" , stringify ! ( Size ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const CFE_PSP_MemTable_t ) ) . Attributes as *
                const _ as usize } , 20usize , concat ! (
                "Alignment of field: " , stringify ! ( CFE_PSP_MemTable_t ) ,
                "::" , stringify ! ( Attributes ) ));
}
impl Clone for CFE_PSP_MemTable_t {
    fn clone(&self) -> Self { *self }
}
extern "C" {
    pub fn CFE_PSP_Main(ModeId: uint32,
                        StartupFilePath: *mut ::std::os::raw::c_char);
}
extern "C" {
    pub fn CFE_PSP_GetTime(LocalTime: *mut OS_time_t);
}
extern "C" {
    pub fn CFE_PSP_Restart(resetType: uint32);
}
extern "C" {
    pub fn CFE_PSP_GetRestartType(restartSubType: *mut uint32) -> uint32;
}
extern "C" {
    pub fn CFE_PSP_FlushCaches(type_: uint32, address: cpuaddr, size: uint32);
}
extern "C" {
    pub fn CFE_PSP_GetProcessorId() -> uint32;
}
extern "C" {
    pub fn CFE_PSP_GetSpacecraftId() -> uint32;
}
extern "C" {
    pub fn CFE_PSP_Get_Timer_Tick() -> uint32;
}
extern "C" {
    pub fn CFE_PSP_GetTimerTicksPerSecond() -> uint32;
}
extern "C" {
    pub fn CFE_PSP_GetTimerLow32Rollover() -> uint32;
}
extern "C" {
    pub fn CFE_PSP_Get_Timebase(Tbu: *mut uint32, Tbl: *mut uint32);
}
extern "C" {
    pub fn CFE_PSP_Get_Dec() -> uint32;
}
extern "C" {
    pub fn CFE_PSP_InitProcessorReservedMemory(RestartType: uint32) -> int32;
}
extern "C" {
    pub fn CFE_PSP_GetCDSSize(SizeOfCDS: *mut uint32) -> int32;
}
extern "C" {
    pub fn CFE_PSP_WriteToCDS(PtrToDataToWrite: *mut ::std::os::raw::c_void,
                              CDSOffset: uint32, NumBytes: uint32) -> int32;
}
extern "C" {
    pub fn CFE_PSP_ReadFromCDS(PtrToDataToRead: *mut ::std::os::raw::c_void,
                               CDSOffset: uint32, NumBytes: uint32) -> int32;
}
extern "C" {
    pub fn CFE_PSP_GetResetArea(PtrToResetArea: *mut cpuaddr,
                                SizeOfResetArea: *mut uint32) -> int32;
}
extern "C" {
    pub fn CFE_PSP_GetUserReservedArea(PtrToUserArea: *mut cpuaddr,
                                       SizeOfUserArea: *mut uint32) -> int32;
}
extern "C" {
    pub fn CFE_PSP_GetVolatileDiskMem(PtrToVolDisk: *mut cpuaddr,
                                      SizeOfVolDisk: *mut uint32) -> int32;
}
extern "C" {
    pub fn CFE_PSP_GetKernelTextSegmentInfo(PtrToKernelSegment: *mut cpuaddr,
                                            SizeOfKernelSegment: *mut uint32)
     -> int32;
}
extern "C" {
    pub fn CFE_PSP_GetCFETextSegmentInfo(PtrToCFESegment: *mut cpuaddr,
                                         SizeOfCFESegment: *mut uint32)
     -> int32;
}
extern "C" {
    pub fn CFE_PSP_WatchdogInit();
}
extern "C" {
    pub fn CFE_PSP_WatchdogEnable();
}
extern "C" {
    pub fn CFE_PSP_WatchdogDisable();
}
extern "C" {
    pub fn CFE_PSP_WatchdogService();
}
extern "C" {
    pub fn CFE_PSP_WatchdogGet() -> uint32;
}
extern "C" {
    pub fn CFE_PSP_WatchdogSet(WatchdogValue: uint32);
}
extern "C" {
    pub fn CFE_PSP_Panic(ErrorCode: int32);
}
extern "C" {
    pub fn CFE_PSP_InitSSR(bus: uint32, device: uint32,
                           DeviceName: *mut ::std::os::raw::c_char) -> int32;
}
extern "C" {
    pub fn CFE_PSP_Decompress(srcFileName: *mut ::std::os::raw::c_char,
                              dstFileName: *mut ::std::os::raw::c_char)
     -> int32;
}
extern "C" {
    pub fn CFE_PSP_AttachExceptions();
}
extern "C" {
    pub fn CFE_PSP_SetDefaultExceptionEnvironment();
}
extern "C" {
    pub fn CFE_PSP_PortRead8(PortAddress: cpuaddr, ByteValue: *mut uint8)
     -> int32;
}
extern "C" {
    pub fn CFE_PSP_PortWrite8(PortAddress: cpuaddr, ByteValue: uint8)
     -> int32;
}
extern "C" {
    pub fn CFE_PSP_PortRead16(PortAddress: cpuaddr, uint16Value: *mut uint16)
     -> int32;
}
extern "C" {
    pub fn CFE_PSP_PortWrite16(PortAddress: cpuaddr, uint16Value: uint16)
     -> int32;
}
extern "C" {
    pub fn CFE_PSP_PortRead32(PortAddress: cpuaddr, uint32Value: *mut uint32)
     -> int32;
}
extern "C" {
    pub fn CFE_PSP_PortWrite32(PortAddress: cpuaddr, uint32Value: uint32)
     -> int32;
}
extern "C" {
    pub fn CFE_PSP_MemRead8(MemoryAddress: cpuaddr, ByteValue: *mut uint8)
     -> int32;
}
extern "C" {
    pub fn CFE_PSP_MemWrite8(MemoryAddress: cpuaddr, ByteValue: uint8)
     -> int32;
}
extern "C" {
    pub fn CFE_PSP_MemRead16(MemoryAddress: cpuaddr, uint16Value: *mut uint16)
     -> int32;
}
extern "C" {
    pub fn CFE_PSP_MemWrite16(MemoryAddress: cpuaddr, uint16Value: uint16)
     -> int32;
}
extern "C" {
    pub fn CFE_PSP_MemRead32(MemoryAddress: cpuaddr, uint32Value: *mut uint32)
     -> int32;
}
extern "C" {
    pub fn CFE_PSP_MemWrite32(MemoryAddress: cpuaddr, uint32Value: uint32)
     -> int32;
}
extern "C" {
    pub fn CFE_PSP_MemCpy(dest: *mut ::std::os::raw::c_void,
                          src: *mut ::std::os::raw::c_void, n: uint32)
     -> int32;
}
extern "C" {
    pub fn CFE_PSP_MemSet(dest: *mut ::std::os::raw::c_void, value: uint8,
                          n: uint32) -> int32;
}
extern "C" {
    pub fn CFE_PSP_MemValidateRange(Address: cpuaddr, Size: uint32,
                                    MemoryType: uint32) -> int32;
}
extern "C" {
    pub fn CFE_PSP_MemRanges() -> uint32;
}
extern "C" {
    pub fn CFE_PSP_MemRangeSet(RangeNum: uint32, MemoryType: uint32,
                               StartAddr: cpuaddr, Size: uint32,
                               WordSize: uint32, Attributes: uint32) -> int32;
}
extern "C" {
    pub fn CFE_PSP_MemRangeGet(RangeNum: uint32, MemoryType: *mut uint32,
                               StartAddr: *mut cpuaddr, Size: *mut uint32,
                               WordSize: *mut uint32, Attributes: *mut uint32)
     -> int32;
}
extern "C" {
    pub fn CFE_PSP_EepromWrite8(MemoryAddress: cpuaddr, ByteValue: uint8)
     -> int32;
}
extern "C" {
    pub fn CFE_PSP_EepromWrite16(MemoryAddress: cpuaddr, uint16Value: uint16)
     -> int32;
}
extern "C" {
    pub fn CFE_PSP_EepromWrite32(MemoryAddress: cpuaddr, uint32Value: uint32)
     -> int32;
}
extern "C" {
    pub fn CFE_PSP_EepromWriteEnable(Bank: uint32) -> int32;
}
extern "C" {
    pub fn CFE_PSP_EepromWriteDisable(Bank: uint32) -> int32;
}
extern "C" {
    pub fn CFE_PSP_EepromPowerUp(Bank: uint32) -> int32;
}
extern "C" {
    pub fn CFE_PSP_EepromPowerDown(Bank: uint32) -> int32;
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct CFE_SB_Msg_t {
    /**< \brief CCSDS Primary Header #CCSDS_PriHdr_t */
    pub Hdr: __BindgenUnionField<CCSDS_PriHdr_t>,
    /**< \brief Forces minimum of 32-bit alignment for this object */
    pub Dword: __BindgenUnionField<uint32>,
    /**< \brief Allows byte-level access */
    pub Byte: __BindgenUnionField<[uint8; 6usize]>,
    pub bindgen_union_field: [u32; 2usize],
}
#[test]
fn bindgen_test_layout_CFE_SB_Msg_t() {
    assert_eq!(::std::mem::size_of::<CFE_SB_Msg_t>() , 8usize , concat ! (
               "Size of: " , stringify ! ( CFE_SB_Msg_t ) ));
    assert_eq! (::std::mem::align_of::<CFE_SB_Msg_t>() , 4usize , concat ! (
                "Alignment of " , stringify ! ( CFE_SB_Msg_t ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const CFE_SB_Msg_t ) ) . Hdr as * const _ as
                usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( CFE_SB_Msg_t ) , "::" ,
                stringify ! ( Hdr ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const CFE_SB_Msg_t ) ) . Dword as * const _ as
                usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( CFE_SB_Msg_t ) , "::" ,
                stringify ! ( Dword ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const CFE_SB_Msg_t ) ) . Byte as * const _ as
                usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( CFE_SB_Msg_t ) , "::" ,
                stringify ! ( Byte ) ));
}
impl Clone for CFE_SB_Msg_t {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct CFE_SB_CmdHdr_t {
    /**< \brief CCSDS Primary Header #CCSDS_PriHdr_t */
    pub Pri: CCSDS_PriHdr_t,
    /**< \brief CCSDS Command Secondary Header #CCSDS_CmdSecHdr_t */
    pub Sec: CCSDS_CmdSecHdr_t,
}
#[test]
fn bindgen_test_layout_CFE_SB_CmdHdr_t() {
    assert_eq!(::std::mem::size_of::<CFE_SB_CmdHdr_t>() , 8usize , concat ! (
               "Size of: " , stringify ! ( CFE_SB_CmdHdr_t ) ));
    assert_eq! (::std::mem::align_of::<CFE_SB_CmdHdr_t>() , 2usize , concat !
                ( "Alignment of " , stringify ! ( CFE_SB_CmdHdr_t ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const CFE_SB_CmdHdr_t ) ) . Pri as * const _ as
                usize } , 0usize , concat ! (
                "Alignment of field: " , stringify ! ( CFE_SB_CmdHdr_t ) ,
                "::" , stringify ! ( Pri ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const CFE_SB_CmdHdr_t ) ) . Sec as * const _ as
                usize } , 6usize , concat ! (
                "Alignment of field: " , stringify ! ( CFE_SB_CmdHdr_t ) ,
                "::" , stringify ! ( Sec ) ));
}
impl Clone for CFE_SB_CmdHdr_t {
    fn clone(&self) -> Self { *self }
}
#[repr(C)]
#[derive(Debug, Copy)]
pub struct CFE_SB_TlmHdr_t {
    /**< \brief CCSDS Primary Header #CCSDS_PriHdr_t */
    pub Pri: CCSDS_PriHdr_t,
    /**< \brief CCSDS Telemetry Secondary Header #CCSDS_TlmSecHdr_t */
    pub Sec: CCSDS_TlmSecHdr_t,
}
#[test]
fn bindgen_test_layout_CFE_SB_TlmHdr_t() {
    assert_eq!(::std::mem::size_of::<CFE_SB_TlmHdr_t>() , 12usize , concat ! (
               "Size of: " , stringify ! ( CFE_SB_TlmHdr_t ) ));
    assert_eq! (::std::mem::align_of::<CFE_SB_TlmHdr_t>() , 1usize , concat !
                ( "Alignment of " , stringify ! ( CFE_SB_TlmHdr_t ) ));
    assert_eq! (unsafe {
                & ( * ( 0 as * const CFE_SB_TlmHdr_t ) ) . Pri as * const _ as
